{
  "title": "No Title",
  "content": "## Developer Docs\nShortcuts:\nUse the mParticle SDKs and APIs to collect, organize, and manage customer data.\n\n## Quickstart\nPick a platform, and follow the SDK quickstart tutorial to see how easy it is to collect data and forward it to a third-party integration.\n\n## Learn about mParticle\nFrom event tracking to predicting user behavior, the developer docs guide you through each stage of building a complete mParticle implementation.\n\n## SDK\n\n## Client SDK\nTrack and send customer data directly from your app to any server.\n- Android\n- iOS\n- Web\n- Alexa\n- AMP\n- Cordova\n- Fire TV\n- Flutter\n- React Native\n- Roku\n- Unity\n- Xbox\n\n## Server SDK\nTrack and send customer data between servers.\n- Go\n- Java\n- Node\n- Python\n- Ruby\n\n## Media SDK\nTrack media events and heartbeats across three platforms.\n- Android\n- iOS\n- Web\n\n## API\n\n## Events API\nCollect data for contexts too complex for the Server SDK.\n\n## Bulk Profile Deletion API\nSave time when improving data quality by deleting data associated with sets of customers.\n\n## Calculated Attributes API\nSend seeds for your calculated attributes.\n\n## Custom Access Roles API\nCreate and manage custom sets of permissions for your mParticle account users.\n\n## Data Planning API\nDefine your data schema with Data Master.\n\n## Data Subject Request API\nSubmit data subject requests for GDPR and CCPA compliance via the OpenDSR API.\n\n## ID Sync API\nMatch and resolve identities to build a single user profile for all user activities.\n\n## Platform API\nProgrammatically update your mParticle inputs, outputs, filters, and more.\n\n## Pixel Service API\nSend data to mParticle from your web site via a tracking pixel.\n\n## Profile API\nAccess user profiles at scale to power personalized experiences.\n\n## Group Identity API\nCreate groups of users based on shared attributes.\n\n## Warehouse Sync API\nGo beyond Reverse-ETL and build a headless data infrastructure.\n\n## Tools\n\n## mParticle CLI\nAccess some mParticle features from a terminal.\n\n## Smartype\nManage your data plans as code.\n\n## Smartype Linting\nLint your code against your data plan.\n\n## More Guides\n\n## Data Hosting\nUnderstand how to reference the pod where your org is hosted.\n\n## ComposeID\nUse IDSync to identify unknown users with data stored in Snowflake.\n\n## Glossary\nList of mParticle-specific terms.\n\n## Partners\nBecome an mParticle partner and make your platform available for input or output.\n\n## Rules\nCleanse and transform data before it is output to another system.\n\n## Segment Migration\nMigrate your Segment implementation to mParticle.",
  "url": "https://docs.mparticle.com/developers"
}