{
  "title": "What is Cloud Connect?",
  "content": "## Introduction\nCloud Connect allows you to run complex SQL queries directly against your data warehouse and translate the resulting records into profile attributes and audiences.\n\n## Cloud Connect in Action\n\n## 📘Cloud Connect in Action\nCloud Connect in Action\nCheck out thesolution architecture developedwith Google which leverages BigQuery and Analytics Hub in addition to Cloud Connect to create a rich pattern for secure data collaboration and activation.\n\n## Getting Started\n\n## Accessing Cloud Connect\nCloud Connect is available to all Lytics customers. If you don't currently have access via the product switcher at the top of the primary navigation, contact support or your account management team.\n\n## Common Use-cases\nCloud Connect unlocks many use cases enabling marketers to segment their customers based on any attributes stored in their database. A few examples include:\n- Time Window: All users who did not log in last month.\n- Joins (B2B): All users associated with accounts without feature \"x.\"\n- Lifetime Value (LTV) or Rollup: All users with a premium subscription have purchased at least two products.\n\n## 📘Need a warehouse?\nNeed a warehouse?\nDon't currently have access to a data warehouse? Lytics has you covered with Lytics Warehouse. We provide a simple data warehouse on top of Google BigQuery to all of our customers as part of Conductor. Simply reach out to account manager or support for access and information.\n\n## How it Works\nCloud Connect augments the rest of the Lytics CDP suite by providing a secure and flexible entry point into your data warehouse. Users can quickly write a standard SQL query to perform a number of complex data manipulations or aggregations and stream the results directly to materialized user profiles. From there, generate insight-heavy reports, enrich targeted segments, and activate across hundreds of marketing channels in just a few clicks.\nBelow you'll find an overview of the general architecture, which can be summarized into these key value drivers:\n- Direct access to existing customer data in your warehouse.\n- No need to rip and replace or replicate consumer data in order to activate.\n- Leverage standard SQL to extract only what is relevant to your business goals.\n- Maintain your warehouse as the \"source of truth.\"\n- Requires very little to implement and begin generating ROI.\nUpdatedover 1 year ago",
  "url": "https://docs.lytics.com/docs/cloud-connect-intro"
}