{
  "title": "User Profiles",
  "content": "## Introduction\nUser profiles provide relevant insights about individual customers in relation to your entire customer base. Referencing a user profile helps answer questions about who your customers are and how they are engaging with your brand.\nInitially, the user profile offers a way to test your Lytics implementation and validate the outcomes of your marketing tactics. For example, you can check if campaigns are working as expected by using a “test” persona and seeing how the user profile data gets updated.\nAs you get deeper into building campaigns, the user profile provides insight into how your marketing influences user behaviors. For example, if you run a mobile campaign, you can drill down to see if customers are engaging on mobile devices, what days and times they are most active, and what types of content they are affinity for. User profiles are updated in real-time, but there can be a delay while the data is being processed and scores are being calculated for behavior and content affinity.\nTo provide quick access to customer data, the user profile is divided into three tabs:Intelligence,Audiences, andDetails.\n\n## Anatomy of a User Profile\n\n## Intelligence\nThe intelligence tab gives a snapshot of key information about an individual user. At the top, a bar is displayed to help you quickly understand user engagement across all channels:Likelihood to re-engage,Current engagement level, andFrequency of user interactions.\nEach of these boxes summarizes the data science-powered behavioral scores into practical terms. The individual behavior scores and the user’s content affinity are displayed below. This rich data based on a user’s actual behavior is available thanks to the predictive analytics built into Lytics.\n\n## Recent activity by channel\nThis module gives an overview of which channels (email, web, mobile, etc.) an individual user has been active in. When appropriately mapped, it will also provide information on when users were active on each channel (within the last day or within the last 30 days).\nNOTE: If this module is empty, please see below for details on how to configure the user fields. As with all data mapping exercises, it is best to include your Customer Success representatives for optimal results.\n\n## How the recent activity by channel is managed\nIf you are customizing LQL or handling custom streams, it is important to understand how this module should be configured. For all our built-in integrations, Lytics includes this data mapping by default.\nAt its core, the \"Recent activity by channel\" module is built from a single user field. This field will not exist in legacy accounts and must be added to the existing LQL manually. For all new accounts that get the latest default LQL files, the baseline should be included.\nIn order to handle either custom data mapping for an account or backfill an old account, the user fieldlast_channel_activitiesmust be defined in a streams LQL file. This field is defined as amap[string]timeand should not be altered.\n\n```\nlast_channel_activities\n```\n\n```\nmap[string]time\n```\nIn each stream you'll simply map a string, such as \"web\" or \"email\" to a timestamp such asepochms()in order to update the field. A more lengthy example for an email LQL might look something like:\n\n```\nepochms()\n```\n\n```\n-- Profile Support\nmap(\"email\", epochms())    AS last_channel_activities    IF eq(tolower(action), \"open\") OR eq(tolower(action), \"click\")    SHORTDESC \"Last Activity By Channel\"    KIND map[string]time\n```\n\n```\n-- Profile Support\nmap(\"email\", epochms())    AS last_channel_activities    IF eq(tolower(action), \"open\") OR eq(tolower(action), \"click\")    SHORTDESC \"Last Activity By Channel\"    KIND map[string]time\n```\nThe example above is for when you only want to map the activity event in the case of a click or open. This definition will vary from stream to stream.\nWhen it comes to which keys to use, we recommend following these standards for common channels:\n- email\n- ad\n- web\n- mobile\n- support\n\n## Unique identifiers\nHighlights the identifiers that have been used to materialize this particular user's profile.\n\n## Event chart\nThe event chart shows a user’s activity by hour and day of the week. The top right of the chart highlights when a user is most active, for example Tuesdays at 10am.\n\n## Audience Membership\nThis tab displays a list of all the current Audiences a user belongs to and the total size of each audience. Audiences include factual information such as “Has Email Address” and “Known Location” along with Lytics score-driven characteristics such as “Deeply Engaged” or “Binge User”.\n\n## Profile Details\nThe details tab gives an under-the-hood display of the exact user fields contributing to a user’s behavioral data and their audiences. Unique identifiers are shown first, which are essential for enabling cross-channel mapping. For all user fields, the associated stream and value is provided.\n\n## Profile Picture\nSome profiles may include a profile picture when viewed in the user interface. This image comes fromGravatar. If the profile in question has an email address, Lytics converts it to an MD5 hash. That hash is then used to look up the corresponding image on Gravatar. This image is only displayed in the Lytics UI and is not part of the profile itself.\nUpdatedalmost 2 years ago",
  "url": "https://docs.lytics.com/docs/understanding-user-profiles"
}