{
  "title": "Audiences",
  "content": "## Introduction\nAudiences are central to creating personalized marketing using Lytics. It is how groups of users get targeted and defines how cross-channel user data is used in campaigns. Lytics offers audiences as a tool that operates on user fields as well as other audiences. This provides the ability to craft audiences that target one user, every user, or any number in between.\nLytics audiences are automatically kept up to date. As time passes, an audience that once targeted 500 users may grow to target 10,000. This is great if your audience is targeting engaged users who have shown interest in your upcoming product, but not so great if your audience targets users with outstanding support tickets. Lytics makes it easy to find these insights so your campaign strategies can be adjusted accordingly.\nAudiences can be used in Lytics Experiences, third-party ad campaigns, and tools like Google BigQuery for advanced reporting. When all of that isn’t enough, the Lytics APIs provide deep integrations with the Lytics platform.\n\n## 📘\nAccess the audience builder from Lytics navigation menu by expanding theAudiencestab and clickingAudiences. Once on the Audiences page, click on the+ Create New Audiencebutton.\n\n## Creating Audiences\nBuilding new audiences allows you to target specific groups of your users. Why send the same email to your entire audience? Instead, send emails to distinct audiences with content that you know those users enjoy. Lytics gives you the ability to create audiences based on cross channel user data, behaviors and interests.\nAudiences can be built using existing audiences, user content affinity, your personalization campaigns, or by custom rules utilizing any user fields in your Lytics account. Create rulesets by combining multiple audiences and boolean logic to target users with as much or as little granularity as you require.\nLytics updates your audiences automatically. Once an audience is built, users will join or leave whenever they match (or fail to match) the rules you have set. Export your audiences, often in real-time, to your integrated marketing tools giving you the power of Lytics however you engage with your users.\n\n## 📘\nAccess the audience builder from Lytics navigation menu by expanding theAudiencestab and clickingAudiences. Once on the Audiences page, click on the+ Create New Audiencebutton.\n\n## Building Audiences: Existing Audiences\nTheExisting Audiencestab in the audience builder contains a list of all existing audiences and their size categorized by audience type such as characteristic. Characteristics are pre-built audiences pertaining to single user attributes such as location or behavior.\nKeep in mind that the audience sizes you see in this list arenotreal-time. They are updated every few hours for performance reasons. When creating or editing an audience, however, you will always see real-time numbers so that you can make precise decisions based on accurate data.\nYou can use theFilter by Audience Typedrop-down to filter the list or use theSearchbox to quickly find an audience by name.\nSelect an audience or characteristic to add it to the definition of the audience you are building or editing.\n\n## Building Audiences: Content Affinity\nTheContent Affinitytab in the audience builder is used to add Affinity-based rules to your audience. SinceAffinitiesare agroup of related Topics, this allows you to effectively target users interested in several subjects or products.\nIn the example above, we created a \"Lavender\" Affinity for an online beauty store, which includes 6 Topics such as \"lavender\", \"lavender lotion\", and \"lavender luxury.\" Instead of creating an audience with 6 rules (one per Topic), we just select our Lavender Affinity that contains those 6 Topics.\nOnce you choose an Affinity for your audience, you will be able to select the range of affinity values. The histogram displays the distribution of user interest for the selected Affinity and is helpful to build an audience that has the desired size. By default, users withAny Affinityare selected. You can choose a built-in range by clicking any of theAffinitybuttons or, to set a custom range, use the slider to refine the range of users to target. As you change the range, the total number of users that fit the range is shown in the right column.\nAs soon as you create an Affinity, Lytics start scoring users against it as they interact with your content or products. For active users, you can expect this number to start populating within a few days. For inactive users, it can take up to 2 weeks for them to be scored against an Affinity. So it's recommended that you create Affinities in advance of the audience needed for an Affinity-based campaign.\n\n## Topic-Based Audiences\nUnder theCustom Ruletab in the Audience Builder, you can find the existing audiences based on Topics in your content taxonomy. If you want to create new audiences based on a single Topic, you can do so as follows:\n- Search for \"Topics\" in the Custom Rule tab of the Audience Builder\n- Select the Topic of interest.\n- Set the threshold according to the desired users' level of interest in that Topic.\nOnce you hit \"Add Condition\", the custom rule for a Topic will look like this:\nAlthough Topics are still supported in the Audience Builder, we strongly recommend you use Affinities to build audiences for a more efficient workflow and more effective targeting.\n\n## Inferred Content Affinity\nSome users may find a field namedInferred Content Affinitywhen trying to build affinity or topic based audiences. This field contains topics that a user could be interested in even though they may not have interacted with the topics directly. To learn more about how these inferrences are made, you can read about ourcontent taxonomy process. Note that topic affinity already includes this information, but this field contains only inferred affinity. We would also recommend not using this field to build audiences as it is not a wholistic view of a user's affinity.\n\n```\nInferred Content Affinity\n```\n\n## Building Audiences: Custom Rules\nTheCustom Rulestab in the audience builder is used to add any rule based on auser fieldto the audience being built or edited.\nCustom rules allow for ultimate access of all data that is aggregated in user fields. Custom rules are simple statements that can be combined to create very precise audiences. Using them correctly requires a thorough understanding of the data being used, but there is no replacement for this level of segmentation.\n\n## 🚧Audiences Field Value Limits\nAudiences Field Value Limits\nAudiences can have a maximum of 1,000 field values. \"Values\" in this context apply to a single evaluation against a user field.\nWhen exceeded, the error message \"Audience too large! Remove values to save this audience\" will be displayed. For example, the following scenarios would trigger the alert:\n- An audience with a single rule that supports multiple values ( e.g. contains one of) with 1001+ values.\n- An audience with 1001+ user field rules each with a single evaluation (e.g. exists).\n- Any variation in between such as two rules each containing over 500 evaluations, etc.\nThe user field list displays all the fields in your account. TheSourcedrop-down can be used to filter on the data stream the user field came from. TheIncludesdrop-down can be used to filter user fields on the percentage of users that have a field. Use theSearchinput to search for a user field by name.\nGenerally, to add a Custom Rule to an audience definition:\n- Choose a User Field\n- Choose an operator (e.g., text contains, value is less than)\n- Choose a value\nThere are variations to this general procedure based on thetypeof the user field and the operator chosen.\n\n## User Field Types\nHow you work with user fields in the Custom Rules tab will depend on way the field is mapped in on the user profile.\nNumeric user fields are most commonly used for data that is counted. For instance, the number of times a visitor has been to a website or the number of times a subscriber has opened an email. Exact values can be matched, but more commonly, inequalities are expressed.\nExamples:\n- Total Number of Visits must equal 5:Any user who has visited 4 times, 6 times, or any number of times other than 5 will not be matched by this rule.\n- Total Number of Visits must be less than 3:Any user who has visited 0, 1, or 2 times will be matched by this rule.\nText User fields are commonly used for words and miscellaneous information. For instance, a user’s first name. Since there is no mathematical relationship between two text values, the operations used are generally exact match or partial match.\nThere are 5 operator options when making audiences with text user fields:\n- Equal: The value for the field you want the audience to have. Format and character spacing for the value must match exactly what is in the data stream. You can select the value by interacting with the visualization or be promoted with available values by typing into the search bar.\n- Contain: The text entered (case sensitive and exact order) appears within a value for the field.\n- Be Like: Use the wildcard character*along with text to decide the parts of values you want to match. E.g.,testwill only match on the exact string test, whiletest*will match strings starting with test, such as \"testing\", and*test*will match any string that has test in it, such as \"my test case\".\n\n```\n*\n```\n\n```\ntest\n```\n\n```\ntest*\n```\n\n```\n*test*\n```\n- Equal one of: Add each, exact value you want included individually. A new search bar will appear after each selection. You can remove values from the list using the “x” to the left of the value. The logic for each of these rules follows the logic from “Equal”.\n- Exist: Excludes everyone that does not have a value for the field.\nExamples\n- First Name must equal Ash:Only users named Ash will be matched.\n- First name must contain Ash:Any user named Ash will be matched. Additionally, anyone named Ashley, Ashton, or any other name that has the letters \"Ash\" next to each other will be matched. Dash or Natasha will NOT be matched - as these do not have an “A.” To make an audience that includes these, create a second rule set for “First name must contain ash.”\nDate user fields are commonly used for any data that represents a point in time. For instance, the last time a user visited a website. Most commonly, a date is chosen to divide the people who fall before or after that date. You will need to select both your starting point and a directionin timefor your custom rule.\nYour starting point could be a fixed point in time (useful for milestone events, like product launches) or a relative point in time (useful for scheduled follow ups).\nSince each rule only handles going forward or backward from a single point in time, you may need to create two rules that work together to bound a range of time. One rule will capture all dates after the first point in time, and a second rule will capture all dates before a later point in time.\nSome date fields have a natural boundary, such as Last Visits, which will never include a date in the future. If you want all Last Visits from a point in time up until now, you would only need to create one rule.\nExamples\n- Last Visit must be Before June 22, 2016:Created by selectingSpecific Dateand the directionBefore. This rule includes only users who have not visited since the 22nd of June.\n- Last Visit must be After 3 days in the past:Created by selectingRelative Date, entering 3 daysIn the pastand selecting the directionAfter. This rule includes only users who have visited in the last three days.\n- Subscription End Date must be within the next 30 days:Created by building two rules: one to set the start date to always be the current date and the other to set the end date to 30 days in the future relative to the current date.Create the first rule by selectingRelative Date,After, entering0 Days, selectingIn the past, and clickingAdd Condition.Create the second rule by selectingRelative Date,Before,30 Days,In the future, and clickingAdd Condition.This audience will now include all users who have a subscription ending in the next 30 days beginning with the current date.\n- Create the first rule by selectingRelative Date,After, entering0 Days, selectingIn the past, and clickingAdd Condition.\n- Create the second rule by selectingRelative Date,Before,30 Days,In the future, and clickingAdd Condition.\n- This audience will now include all users who have a subscription ending in the next 30 days beginning with the current date.\nSet user fields are commonly used for collecting related data over time. For instance, all the URLs a user has visited. These fields are generally used much like text user fields, even though the data is structured differently.\nExamples\n- All URL Paths Ever must contain one of/blog,/products, or/about:Any user who has visited any one of these three paths will be matched.\n\n```\n/blog\n```\n\n```\n/products\n```\n\n```\n/about\n```\n- Followed Sports must contain Baseball:Any user who follows Baseball will be matched. This is true whether they only follow Baseball or follow Baseball in addition to Football, Hockey, and Bowling.\nMap user fields are used to add hierarchy to a dynamic domain of data. For instance,Events By Deviceis a count of all events, but grouped by each device. So instead of building a rule by only specifying the count, the rule is built by first specifying the device, then the count. The device could be thought of as an additional, dynamic user field that is nested under the map user field.\n- Selecting a KeyWhen using a map user field, the first step is selecting the dynamic user field to build a rule with, called akey. Using theURLs Visitedexample, thekeyscould include any numeric value. Since thesekeysare dynamic,  counts will be updated automatically.\nSelecting a Key\n- When using a map user field, the first step is selecting the dynamic user field to build a rule with, called akey. Using theURLs Visitedexample, thekeyscould include any numeric value. Since thesekeysare dynamic,  counts will be updated automatically.\n- Building the ConditionOnce a key is selected a condition is built. Thetypeof the nested user field is called thevalue type. In the case ofURLs Visited, thevalue typeis numeric. When building audiences with nested fields, the visualization chart will not display for mapped fields to minimize page load times.\nBuilding the Condition\n- Once a key is selected a condition is built. Thetypeof the nested user field is called thevalue type. In the case ofURLs Visited, thevalue typeis numeric. When building audiences with nested fields, the visualization chart will not display for mapped fields to minimize page load times.\nExamples\n- Events By Device (Desktop) must be greater than 5:Only users who have visited the website more than 5 times on a desktop will be matched. If a user has visited more than 5 times on the mobile web, they will not be matched.\n- Signup Date for Event (Personalization Webinar) must be within the last 7 days:Only the users who signed up for the Personalization Webinar in the last week will be matched. Users who signed up more than 7 days ago will not be matched. Users who signed up for a different event in the last 7 days will also not be matched.\n\n## Out of the Box Custom Rules\nSome user fields are mapped by default and populated through the use of the Lytics Javascript tag and Experiences. These out of the box fields can be incredibly useful when building audiences using Custom Rules.\nAssuming that you have not made changes to the 'default' webLQLfile that is automatically created when theLytics Javascript Tagis installed, the following custom rules are available to you for use when building audiences.\n\n```\nvisit_city\n```\n\n```\nvisit_country\n```\n\n```\nvisit_region\n```\nThere are a variety of use cases that involve targeting users who have engaged with previous marketing campaigns. For example, if a user converted on anIterable Experienceemail, and you want to follow up with an SMS message. The steps below will walk you through how to create an audience to target users who were reached by or clicked on anExperience.\n- Navigate toExperiencesand search for the one you would like to use.\n- You will need to get an ID for the Experience, which differs depending on the Experience type:ForLytics Web Personalization Experiences: Look up the URL for this Experience and locate the long string of numbers of letters as highlighted below. Save this to your clipboard.Forall other Experience types: open developer tools and navigate to the “Network” tab. Refresh the page and filter the requests by “experience”. Find the response that looks similar to the example below, and save theexternal_idvalue (nested undervehicle) to your clipboard.Note:You can also use the Experience API to fetch the current Experience by ID to get the full payload, including the Experience'sexternal_id.\n- ForLytics Web Personalization Experiences: Look up the URL for this Experience and locate the long string of numbers of letters as highlighted below. Save this to your clipboard.\n- Forall other Experience types: open developer tools and navigate to the “Network” tab. Refresh the page and filter the requests by “experience”. Find the response that looks similar to the example below, and save theexternal_idvalue (nested undervehicle) to your clipboard.Note:You can also use the Experience API to fetch the current Experience by ID to get the full payload, including the Experience'sexternal_id.\n\n```\nexternal_id\n```\n\n```\nvehicle\n```\n\n```\nexternal_id\n```\n- In your Lytics account, navigate toAudiences>Create New Audience.\n- In the audience builder, selectCustom Ruleand search for the provider of the Experience you would like to segment on.\n- After you enter a provider, you should see a field for conversions and reach on those Experience types. Select the action you wish to segment off of.\n- Copy and paste the ID you copied from step 2 into the text box.\n- ChooseExistas your operator and add the condition to your audience.\n- SelectAdd Condition. You now have an audience based on past interactions with an Experience. You can save the audience as is, or continue to add rules based on your use case.\n\n## Building Audiences: Multiple Rules and Rule Sets\nAll audience definitions are comprised of rules based onexisting audiences,content affinity,campaigns, andcustom rules. You may have noticed that after you add your first rule in the audience builder you have the option toAdd New RuleorAdd New Rule Set. Adding new rules and rulesets, and setting the conditions for their interaction, gives you the ability to refine which users your audiences target.\n\n## Working With Multiple Rules\nThis audience has a single rule: included all users with the characteristicBehavior: Perusers. This will select all users with anintensity scoreof 20 or less but with afrequency scoreof 20 or greater. These are users who interact often but not on a deep level. You can refine this rule further by clickingAdd New Rule.\nThis audience now also includes a rule for users who have a low content affinity forTechnologycontent. Now that it has been added, there are three numbers of interest. The first number, 87,650, is the number of users with the characteristicBehavior: Perusers. The second number, 466,730, is the number of users who have low affinity forTechnologycontent. The third number, 11,514, are the users who meetbothof these conditions.\nClicking theAnd/Ortoggle, will switch the way the two rules intereact. The audience now includes all 542,921 users whoeitherhave the characteristicBehavior: Perusersor have low afffinity forTechnologycontent.\n\n## Excluding Rules\nIn addition to theAnd/Ortoggle, there is theIncluded/Excludedtoggle. This toggleinvertsa condition.\nThis audience contains a rule that targets the 159,084 users with the characteristicBrowser / OS: Mobileor users who have used a mobile devices.\nClicking theInclude/Excludetoggle the audience will now target the 705,166 users whodo nothave the characteristicBrowser / OS: Mobile.\nThe sum of the two numbers will be the total audience size that meets those rule(s).\nThis is especially apparent when using a rule such asCreated Timestamp Exists. Every user in Lytics will have a timestamp of when they were created. Therefore, the number of users whodo notmeet the condition of having a created timestamp will always be 0.\n\n## Working With Rule Sets\nWhen building elaborate audiences, having a single set of rules that are evaluated using either anANDor anORis not enough. A ruleset is a set of rules that itself can be used as a rule for an even larger set of rules that is again evaluated using anANDor anOR.\nThis audience has two rulesets. The first ruleset has one rule: all users who have the characteristicEmail Capture Status: Known Email. The second ruleset has two rules: all users have some affinity forMarketingORAdvertisingcontent. Combining these two rulesets with theANDoperator produces an audience that targets users with an email address that have some interest in either marketing or advertising. This audience could be used to email a special newsletter or promotion about a product or trending topic that is related to marketing or advertising.\n\n## Excluding Rule Sets\nRulesets, just like rules, can be excluded. Clicking theInclude/Excludetoogle on the second ruleset will result in the audience targeting all users with an email address who do not have some interest in either marketing or advertising. It could be used to send a different email to the remainder of your users with email addresses.\n\n## Building Audiences: Configuration Options\nConfigure your Lytics audiences with the following options to execute your use cases.\n\n## Enabling API Access\nBy default, newly created Lytics audiences are not enabled for API access and thus will not be available to public APIs. Enabling API access is necessary when integrating with other client-side tags/ pixels,Pathfora, or the Lyticspersonalization APIendpoints.\nSelect theAPI Accessiblecheckbox to enable access.\n\n## Generate Insights\nLytics Insightsprovide visibility into the performance of your audiences and campaigns as users interact with your brand. Insights are generated out-of-the-box for Lytics Behavioral and Engagement audiences. You can also request up to10 custom audiencesto be prioritized as candidates for generating Insights.\nWhen creating a new audience or editing an existing one, select theGenerate Insightscheckbox to make that audience a candidate for Insights (shown in the screenshot above).\nLytics prioritizes Insights based on the statistical significance of the data and the most frequently used audiences for your account. Therefore, even if you select the \"Generate Insights\" option for a particular audience, it is not guaranteed to show up in your Insights drawer.\n\n## Managing Audiences\nManaging audiences becomes important as an account develops and your user base grows. Audiences are critical to both targeted campaigns as well as discovering insights about your users.\nTheAudiencessection of Lytics houses all of your account’s audiences. You can view, create, and manage audiences from this section.\nAudiences are listed alphabetically by default. Click any column header to change the sort property. Common sort options areLast ModifiedandSize(the number of users in the audience).\n\n## Naming Your Audiences\nFor better targeting, Lytics encourages the creation of many audiences. They’re easy and free to make. When working with a large library of audiences, naming conventions become important.\nName your audiences by purpose and include any categorization in the name. Giving them a common prefix (e.g., Holiday Promo: Tech lovers, Holiday Promo: Loyal Shoppers) will help you to keep everything related next to each other in the user interface.\nAudiences appear throughout the Lytics platform. Make sure your naming convention works in any context to avoid confusion.\n\n## Finding Audiences\nThe easiest way to find an audience is to use theSearchbox. As you enter your search term the audience list will display any matching audiences.\n\n## 📘\nFuzzy matching is used to search for audiences so the results will not be an exact match to the search term.\n\n## Editing Audiences\nOccasionally you will want to return to previously created audiences and update the logic used to create the segment.\n- Find the audienceyou would like to edit\n- Click on the audience to navigate to the overview of the audience\n- Click theEditbutton to enter the audience builder\n- Make your desired changes within the audience builder\n- ClickSave\n\n## 🚧\nWhen editing audiences that are in an active triggered workflow, it is recommended that you reconfigure the job after the audience changes have been made.\n\n## Duplicating Audiences\n- Find the audienceyou would like to duplicate\n- Click on the audience to navigate to the overview of the audience\n- Click the...button to enter the audience builder. The audience builder will be pre-populated with all of the criteria of the audience you duplicated.\n- Make any desired changes\n- ClickSave\n\n## 🚧\nAudiences created by duplication will retain the name and slug of the duplicated audience, but with have \"duplicate\" appended at the end. It is recommended that you update both the name and manually input a unique slug name for clarity sake.\n\n## Deleting Audiences\nDeleting audiences is an integral part to keeping a tidy workspace in Lytics. Audiences can be deleted in one of two ways: individually or in batch.\nNote: Deleting an audience does not delete the users associated with that audience.\n\n## Deleting an Individual Audience\n- From theBrowse Audienceslist, select the name of the audience you wish to delete.\n- From the options menu, selectDelete.\n- ClickDelete.\n- ClickAcceptto confirm.\n\n## Deleting Multiple Audiences\n- From theBrowse Audienceslist, select the checkboxes of the audiences you wish to delete.NOTE:Audience selection persists when changing pages allowing you to select audiences from multiple pages.\n- ClickDelete Selected Audiences.\n- ClickDelete.NOTE:Lytics will check to see if the audiences you selected are safe to delete. Audiences are considered safe if they are not used in an ongoing export, campaign, or another audience's definition. You will be prompted to delete dependant audiences, clickYesto delete the selected audience and any dependants listed orSkipcancel deletion of the selected audience.\n- ClickAcceptto confirm.\n\n## Maintaining Audiences\n\n## 📘\nFrom theAudiencespage, click any audience in the list to view all of its details.\nAn audience's landing page contains a lot of valuable information about your users and the audience itself. At the top of the audience page, you will find the following information...\n- Audience name\n- ID\n- Slug\n- Created by\n- Created on date\n- Last updated date\n- API access configuration\nBelow this information you will find multiple tabs where you can access additional information about the audience.\n\n## Audience Summary\nThe audience summary page is designed to provide insights into the current state of an audience as well as how the audience has changed over time. When first navigating to an audience landing page, this tab will be selected by default.\nThe Summary tab includes the following sections:\n- General MetricsThe total number of users in this audienceThe total percentage of this audience as compared to the total number of profiles in your accountThe percentage change in audience size over the last 7 and last 30 days\n- The total number of users in this audience\n- The total percentage of this audience as compared to the total number of profiles in your account\n- The percentage change in audience size over the last 7 and last 30 days\n- Activity trend (graph of audience size over the defined date range)\n\n## Activity Graph\nAfter creating a new audience, the audience size graph will begin to populate within a day. Depending on the date range you specify, the activity graph can be viewed using following intervals:\n- Hourly\n- Daily\n- Weekly\n- Monthly\nAudience Size Trends\n\n## 📘\nThe statistics for audience size start from the creation date of the audience.\nKeep in mind that audiences are real-time. This makes them quite different from the user lists in other marketing tools which are frozen in time and only change when you update the list. Audiences are filters applied to the total audience and will change whenever a user's behavior changes in a way that will add or remove them from the audience definition. In this way, tracking audience size over time is a powerful reporting tool.\nFor example, you create an audience that contains users who have visited the international news section of your website. Upon creation the audience contains 120,000 users. You then run a marketing campaign promoting your international news section. After one week, the audience has grown from 120,000 to 400,000 users with most of the growth occurring in the 24 hours after the campaign was launched. This is clear evidence that the campaign was effective, and most effective in the first 24 hours, at driving users to your international news section.s\n\n## Audience Details\nSelect theDetailstab to view the following sections:\n- Exports: This section outlines what exports (if any) are using this audience\n- Recent Users: This section allows you to view a sample of users in this audience who have been active recently (by clicking theViewbutton)\n\n## Audience Characteristics\nSelect theCharacteristicstab to view the characteristics of users in this audience. Characteristics include:\n- Behavior\n- Web Activity\n- Content Affinity\n- Campaign Referral Interactions\n\n## Audience Logs\nSelect theLogstab to view recent events relating to this audience. Activity such as creation, updating and syncing can all be found here.\n\n## Activating Audiences\n\n## Activating Audiences in Experiences\nCreating a Lytics Experience is one of the easiest and most common ways to activate Lytics Audiences. Learn more aboutLytics Experiencesto find out how you can engage your audiences on site.\n\n## Accessing Audiences Using the Public Entity API\nThe Lytics Experience Editor is a great way to get started with website personalization, but through the use of the Lytics API, there is much more that can be done.\nThe Lytics Experience editor is powered by the Pathfora SDK which is in turn powered by the Lytics Entity API. The Lytics Entity API is how to find out what audiences the current user belongs to as well as what traits the user has. Using the Lytics Entity API it's possible to create completely custom personalized experiences on your site.\n\n## 📘\nPersonalizing a site using the Public Entity API requires making code changes to the host website.\nTo read more about the Entity API,check out the API documentation.\n\n## Exporting Audiences to Other Tools\nA core benefit of Lytics is exporting your smart audiences to the other tools in your marketing tech stack. That way, the campaigns run on your channels are enriched with thebehavioral dataandcontent affinitiespowered by data science on Lytics.\nFrom the audience overview page, click theExportbutton to create a new export job . TheExportmenu lists built in exports such asEmail CSVand any out of the box Integrations. Specific instructions for exporting can be found in the Integrations section (under the desired tool) of our documentation.\nUpdated5 months ago",
  "url": "https://docs.lytics.com/docs/audiences"
}