{
  "title": "Lytics Integration Options",
  "content": "## Lytics Integration Options\nIf you don’t see your ads or marketing tool in our integrations list we offer the following options to connect with other platforms. With our Integration Options we enable flexibility across the various channels where your data exists and tools to build customized integrations. Lytics Integration Options include:\n- Webhooks\n- Lytics File Service integrations for server-to-server file transfer\n- Javascript Tag\n- Mobile SDK\n- Data Warehouse Integrations\nRead on for details on each option. If you have questions about any of these options or would like to further explore an integration with a specific platform reach out to your Lytics contact.\n\n## Webhooks\nWebhooks offer one of the simplest and most flexible options for enabling applications to share data. They’re broadly used in the cloud computing world for integrations that can be stood up quickly with a minimal amount of code. The Lytics Webhook integration supports triggered delivery of audience membership (enters and exits) to a destination url where another application can pick it up. See ourWebhook documentationfor full details.\nInterested to understand how a Webhook integration might be applied? Look at thisMobile Messaging use casefor a simple Lytics Webhook integration to support one-to-one personalized messaging with Twilio.\n\n## Server-to-Server File Transfer\nServer-to-server file transfer is a very common mechanism for data sharing. Lytics File Service options enable Lytics to pull or push user data from an SFTP (secure file transfer protocol) using a CSV (comma-separated values) or JSON file. If you have another platform that also enables integrations via SFTP, this integration path helps to automate the process of passing data between your system and Lytics. Check out theLytics File Service documentationto learn about setting up the file transfer job.\nIn addition to SFTP, Amazon S3 is a very commonly used medium for server-to-server file transfer. Refer to ourAmazon S3 documentationfor data import and export options.\n\n## Javascript Layer/JS Tag\nThe Lytics JS Tag is the default option for client-side (website) data sharing with Lytics. The JS Tag supports the delivery of user behavior attributes from your website into Lytics and can also return back to the website user profile data such as audience members or content recommendations from Lytics for real time personalization. Refer to our JS Tag Documentation for full details.\n\n## Mobile SDK\nThe Lytics Mobile SDK facilitates in-app data sharing with iOS and Android. Similar to the JS Tag, the Mobile SDK supports user behavior-based data delivery to Lytics and profile data to the app for real-time personalization. See ourMobile SDK Documentationfor more details.\n\n## Using Your Data Warehouse\nIf you already use a data warehouse to manage your data this is a great option for data import and export with Lytics. Lytics integrates with\n- Google Big Query\n- Amazon Redshift\n- Microsoft Azure\n- Snowflake\n- Databricks\nEach of these providers offers options for importing data into databases which can then be imported into Lytics using Cloud Connect or our Data Import integrations. Lytics can also export data into each of these data warehouses.\nUpdated10 months ago",
  "url": "https://docs.lytics.com/docs/lytics-integration-options"
}