{
  "title": "Acoustic",
  "content": "## Overview\nAcoustic(previously known as Silverpop) is a marketing platform that enables email, SMS, and mobile campaigns, among other marketing analytics and automation solutions.\nIntegrating Lytics with Acoustic allows you to import users and their activity data to build behavioral audiences and gain Insights in Lytics. You can then export Lytics audiences back to Acoustic to refine your targeting and deliver personalized messaging.\n\n## Authorization\nIf you have not done so already, you will need to set up an Acoustic account before you begin the process described below. Your Acoustic account user must have permission to createApplication Accessvia the API.\n- SelectAcousticfrom the list of providers.\n- Select theFull Authmethod for authorization.\n- Enter aLabelto identify your authorization.\n- (Optional) Enter aDescriptionfor further context on your authorization.\n- Enter yourClient IDfor the application that you have created in your Acoustic account. For more information, please refer toAcoustic Documentation.\n- Enter theClient Secretfor your entered Client ID.\n- Enter thePodnumber of your Acoustic Campaign. You can find the Pod information in Account Setting page of yourAcousticaccount. For example, if it isPod 2then just enter2.\n- EnterRefresh Tokenthat you have created to grant Lytics access. For more information, please refer toAcoustic Documentation.\n- Enter yourSFTP Usernamefor the Acoustic Account.\n- Enter yourSFTP Passwordfor the above SFTP User. You can use your own credentials here, or create a new user for this integration.\n- ClickSave Authorization.\n\n## 📘\nFor this integration, it is recommended to create a new Acoustic User specific for Lytics with the optionDo not enforce password expiration policies for this userselected so the authentication is long lasting, and can be revoked on an account by account basis.\n\n```\nDo not enforce password expiration policies for this user\n```\n\n## Import Audiences & Activity\nImport Acoustic users and their activity information into Lytics so you can leverage that data to build behavioral audiences and gain Insights powered by Lytics data science.\n\n## Integration Details\n- Implementation Type:Server-side Integration.\n- Implementation Technique: XMLAPI Integrationto download CSV formatted data.\n- Frequency:  Data is imported as aBatch Integration; imported once, or every 8 hours on a continuous basis.\n- Resulting Data: Full Lytics user profiles for all Acoustic users complete with activity data.\nThis integration utilizes theAcoustic XML APIto import Acoustic users and their activity to Lytics. Each run of the job will proceed as follows:\n- Exportsusers from the selected Acoustic Database as a CSV file to an Acoustic-manged SFTP server. The CSV files are then read and imported to thesilverpop_usersstream in Lytics.\n\n```\nsilverpop_users\n```\n- Exportsemail activity from users in the selected Acoustic Database as a CSV file to an Acoustic-manged SFTP server. The CSV files are then read and imported to thesilverpop_activitystream in Lytics.\n\n```\nsilverpop_activity\n```\n- After successful completion, the job will import new/updated users with their updated activity every 8 hours ifconfiguredto run continuously.\n\n## Fields\nThe following fields are included in the default mapping for thesilverpop_usersstream. Note this integration was formerly named Silverpop, hence the data stream name, but this job will receive your current Acoustic data.\n\n```\nsilverpop_users\n```\n\n```\nunique_id\n```\n\n```\nOpted Out\n```\n\n```\nOpted Out Date\n```\n\n```\nOpt In Date\n```\n\n```\nOpt In Details\n```\nSimilarly, the following fields are included in the default mapping for thesilverpop_activitystream:\n\n```\nsilverpop_activity\n```\n\n```\nunique id\n```\n\n## Configuration\nFollow these steps to set up an Import Audiences and Activity Data job for Acoustic.\n- SelectAcousticfrom the list of providers.\n- Select theImport Audiences and Activity Datajob type from the list.\n- Select the Authorization you would like to use orcreate a new one.\n- Enter aLabelto identify this job you are creating in Lytics.\n- (Optional) Enter aDescriptionfor further context on your job.\n- From theTypedropdown, select the Acoustic source type: database, list, or query.\n- From theSourcedropdown, select the Acoustic source to import user data from.\n- Click on theShow Advanced Optionstab to expand the advanced configuration.\n- Check theKeep Updatedcheckbox to update the list every 8 hours.\n- In theActivity Startfield, enter the date to import activity from. The default is to retrieve one year of activity.\n- ClickStart Import.\n\n## Export Audiences\nSend Lytics user profiles and audience membership to your Acoustic Database to refine your targeting and deliver personalized messaging across channels. All existing users and new users of the selected Lytics audiences are exported.\n\n## Integration Details\n- Implementation Type:Server-side Integration.\n- Implementation Technique:API Integration,Audience Trigger Integration.\n- Frequency:Real-time Integration.\n- Resulting data: Lytics users are exported toAcoustic Database.\nThis integration utilizes the AcousticImport List APIto export user data from Lytics to the Acoustic Database. Once the export is started, the job:\n- Creates the column mapping file according to the fields selected duringconfigurationand uploads to the Acoustic Campaign SFTP server.\n- Writes the users that are part of selected Lytics audiences to the CSV file and initiates the CSV Import job in Acoustic.\n- The updates will be sent to Acoustic every 8 minute or a batch of 10000 users, whichever occurs first.\n\n## Fields\nYou can export any Lytics user fields to Acoustic Database columns that are present in the selected Acoustic Database. Lytics allows you to map user fields with the corresponding Acoustic Database columns as part of the job configuration described below.\nTo export using the Acoustic Recipient ID as the sync field use theAcoustic Export Audience with Recipient ID export.\n\n## Configuration\nFollow these steps to set up an Export Audiences job for Acoustic.\n- SelectAcousticfrom the list of providers.\n- Select theExport Audiencesjob type from the list.\n- Select the Authorization you would like to use or create a new onecreate a new one.\n- Enter aLabelto identify this job you are creating in Lytics.\n- (Optional) Enter aDescriptionfor further context on your job.\n- From theAcoustic Databasedropdown, select the Acoustic database to populate with Lytics users.\n- Using theAudiencelist, select the Lytics audiences to export. As users enter or exit the selected audience(s) their record will be sent to Acoustic.\n- From theSync Fieldsmapping, choose the sync fields that are used to match and identify users like unique ID or email. At least one sync field must be specified.\n- From theAdditional Map Fields, map additional fields that you would like to send from Lytics to Acoustic by selecting the Lytics field on the left, and its Acoustic destination on the right.\n- FromFields to Trigger, select up to 75 user fields to trigger user change events. For any user in the exported audience, if any of the selected field values change, then the user will be updated in Acoustic.\n- Check theCreate New Contactscheckbox to create new contacts in Acoustic if they do not already exist.\n- Check theUpdate Contactscheckbox to update fields of existing contacts in Acoustic.\n- In theSingle Audience Fieldtext field, select a field or enter a name to create a field to write the additional Lytics audiences to. If the field is left empty, a Yes/No field is created for each selected Lytics audience.\n- (Optional) In theSingle Audience File Empty Stringtext field, specify this to a value like \"null\" to represent an empty audience. Otherwise, an empty string is sent by default.\n- Check theKeep Updatedcheckbox to continuously export users as they enter the audience.\n- From theTime of Daydropdown, select a time of day to complete export each day. Export will sync every hour if left empty.\n- From theTimezonedropdown, select the timezone for time of day specified above.\n- ClickStart Export.\n\n## Export Audiences with Recipient ID\nSend Lytics user profiles and audience membership to your Acoustic Database to refine your targeting and deliver personalized messaging across channels. All existing users and new users of the selected Lytics audiences are exported.\n\n## 📘\nThis export is specifically used for exporting using the Acoustic Recipient ID as the sync field. It will only update users already in Acoustic with a Recipient ID. In order to add users to Acoustic or if you would like to use other sync fields use the standardAcoustic Export Audience export.\n\n## Integration Details\n- Implementation Type:Server-side Integration.\n- Implementation Technique:API Integration,Audience Trigger Integration.\n- Frequency:Real-time Integration.\n- Resulting data: Lytics users are exported toAcoustic Database.\nThis integration utilizes the AcousticImport List APIto export user data from Lytics to the Acoustic Database. Once the export is started, the job:\n- Creates the column mapping file according to the fields selected duringconfigurationand uploads to the Acoustic Campaign SFTP server.\n- Writes the users that are part of selected Lytics audiences to the CSV file and initiates the CSV Import job in Acoustic.\n- The updates will be sent to Acoustic every 5 minutes or a batch of 10000 users, whichever occurs first.\n\n## Fields\nYou can export any Lytics user fields to Acoustic Database columns that are present in the selected Acoustic Database. Lytics allows you to map user fields with the corresponding Acoustic Database columns as part of the job configuration described below.\n\n## Configuration\nFollow these steps to set up an Export Audiences job for Acoustic.\n- SelectAcousticfrom the list of providers.\n- Select theExport Audiencesjob type from the list.\n- Select the Authorization you would like to use orcreate a new one.\n- Enter aLabelto identify this job you are creating in Lytics.\n- (Optional) Enter aDescriptionfor further context on your job.\n- From theAcoustic Databasedropdown, select the Acoustic database to populate with Lytics users.\n- Using theAudiencelist, select the Lytics audiences to export. As users enter or exit the selected audience(s) their record will be sent to Acoustic.\n- From theRecipient IDfield, choose the field that contains the Acoustic Recipient ID in Lytics.\n- From theAdditional Map Fields, map additional fields that you would like to send from Lytics to Acoustic by selecting the Lytics field on the left, and its Acoustic destination on the right.\n- FromFields to Trigger, select up to 75 user fields to trigger user change events. For any user in the exported audience, if any of the selected field values change, then the user will be updated in Acoustic.\n- In theSingle Audience Fieldtext field, select a field or enter a name to create a field to write the additional Lytics audiences to. If the field is left empty, a Yes/No field is created for each selected Lytics audience.\n- (Optional) In theSingle Audience File Empty Stringtext field, specify this to a value like \"null\" to represent an empty audience. Otherwise, an empty string is sent by default.\n- Check theKeep Updatedcheckbox to continuously export users as they enter the audience.\n- From theTime of Daydropdown, select a time of day to complete export each day. Export will sync every hour if left empty.\n- From theTimezonedropdown, select the timezone for time of day specified above.\n- ClickStart Export.\n\n## Export Audiences to Relational Tables\nSend Lytics user profile data and audience membership to your Acoustic Relational tables.  All existing and new users of the selected audience are exported in real-time.\n\n## Integration Details\n- Implementation Type:Server-side Integration.\n- Implementation Technique:API Integration,Audience Trigger Integration.\n- Frequency:Real-time Integration.\n- Resulting data: Lytics users are exported toAcoustic Relational Table.\nThis integration utilizes the AcousticRelational Table Management apito export user data from Lytics to the Acoustic Relational Table. Once the export is started, the job:\n- Creates or writes to the following tables depending on the configuration of the job (see theexamplebelow for a visual example),User table - the user identifier plus all scalar fields will be written to this table.Audience table - the user identifier plus a boolean (Yes/No) column for each Lytics audience exported. Users that belong to the audience will havetrueas value in the respective audience column, and similarly, will havefalseif the user does not belong to the audience.Non-scalar tables - for each non-scalar field exported a separate table will be created.For sets, the table will have a column for the user identifier plus a column calledlytics_valuewith a row written for each value in the set.For maps, the table will have a column for the user identifier plus two columns,lytics_keyandlytics_valuewith a row written for each key/value pair in the map.\n- User table - the user identifier plus all scalar fields will be written to this table.\n- Audience table - the user identifier plus a boolean (Yes/No) column for each Lytics audience exported. Users that belong to the audience will havetrueas value in the respective audience column, and similarly, will havefalseif the user does not belong to the audience.\n\n```\ntrue\n```\n\n```\nfalse\n```\n- Non-scalar tables - for each non-scalar field exported a separate table will be created.For sets, the table will have a column for the user identifier plus a column calledlytics_valuewith a row written for each value in the set.For maps, the table will have a column for the user identifier plus two columns,lytics_keyandlytics_valuewith a row written for each key/value pair in the map.\n- For sets, the table will have a column for the user identifier plus a column calledlytics_valuewith a row written for each value in the set.\n\n```\nlytics_value\n```\n- For maps, the table will have a column for the user identifier plus two columns,lytics_keyandlytics_valuewith a row written for each key/value pair in the map.\n\n```\nlytics_key\n```\n\n```\nlytics_value\n```\n- As users enter or exit the audience, rows will added or updated in the tables above\n- The updates will be sent to Acoustic every 5 minutes or a batch of 1000 users, whichever occurs first.\n\n## Fields\nYou can export any Lytics user fields to Acoustic Relational Table. Lytics allows you to map user fields with the corresponding table columns as part of job configuration. The job also has option to create column in Acoustic table for Lytics user field.\n\n## Configuration\nFollow these steps to set up an Export Audiences job for Acoustic.\n- SelectAcousticfrom the list of providers.\n- Select theExport Audience to Acoustic Relational Tablejob type from the list.\n- Select the Authorization you would like to use orcreate a new one.\n- Enter aLabelto identify this job you are creating in Lytics.\n- (Optional) Enter aDescriptionfor further context on your job.\n- Using theAudienceslist, select the Lytics audiences to export. As users enter or exit the selected audience(s) their record will be sent to Acoustic.\n- From theAcoustic User Tabledropdown, select the Acoustic relational table to populate with user profile data. SelectCreate New Tableto create new user table with namelytics_user_table_{timestamp}.{timestamp}is replaced with current timestamp in formatYYYYMMDDHHmmss.\n\n```\nCreate New Table\n```\n\n```\nlytics_user_table_{timestamp}\n```\n\n```\n{timestamp}\n```\n\n```\nYYYYMMDDHHmmss\n```\n- IfCreate New Tableis selected, from theUser Table Key Fielddropdown, select the Lytics user field to be used as primary key for new user table. Should be left blank if writing to an existing table.\n\n```\nCreate New Table\n```\n- If writing to an existing table, from theAcoustic User Table Mapping, map Lytics user fields that you would like to send from Lytics to corresponding Acoustic field.NOTE:All the key column for the selected Acoustic user table must be mapped.\n- For either exporting to a new table or writing an existing table, from theExtra Fieldslist, select the additional Lytics user fields to export. These are extra scalar fields to be sent to Acoustic user table. Each field will be added as a separate column in the table.\n- From theAcoustic Audience Membership Tabledropdown, either select the Acoustic relational table to populate with audience information or selectCreate New Table. If the creation of a new audience table is selected, a table will be created with the namelytics_audiences_table_{timestamp}.{timestamp}is replaced with current timestamp in formatYYYYMMDDHHmmss.\n\n```\nCreate New Table\n```\n\n```\nlytics_audiences_table_{timestamp}\n```\n\n```\n{timestamp}\n```\n\n```\nYYYYMMDDHHmmss\n```\n- IfCreate New Tableis selected for the Acoustic audience membership table, in theAudience Membership Table Key Fielddropdown, select the Lytics user field to be used as primary key for new audience membership table. Should be left blank if writing to an existing table.\n\n```\nCreate New Table\n```\n- If writing to an existing audience table, from theAcoustic Audience Membership Table Key Mapping, map the keys from Lytics to the key columns in Acoustic. The primary key in Acoustic must be mapped.\n- Using theNon-Scalar User Fieldslist, select any Lytics non-scalar user field to export. An Acoustic relational table with namelytics_{field-name}_table_{timestamp}will be created for each selected non-scalar field.\n\n```\nlytics_{field-name}_table_{timestamp}\n```\n- If exporting non-scalar fields, from theNon-Scalar Field Table Key Fielddropdown, select Lytics user field to be used as primary key for all new non-scalar field table.\n- SelectExisting Usersto send users currently in the Lytics audience to Acoustic.\n- ClickCompleteto create the job.\n\n## Example\nBelow is an example of a user exported and how they may look in Acoustic.\n\n```\nSample User\n{\n  \"email\": \"[email protected]\",\n  \"first_name\": \"James\",\n  \"last_name\": \"McDermott\",\n  \"channels\": [ \"web\", \"email\" ],\n  \"hourly\": {\n    \"17\": 1,\n    \"21\": 1,\n    \"23\": 2\n  },\n  \"segments\": {\n    \"all\",\n    \"highly_engaged\"\n  }\n}\n```\n\n```\nSample User\n{\n  \"email\": \"[email protected]\",\n  \"first_name\": \"James\",\n  \"last_name\": \"McDermott\",\n  \"channels\": [ \"web\", \"email\" ],\n  \"hourly\": {\n    \"17\": 1,\n    \"21\": 1,\n    \"23\": 2\n  },\n  \"segments\": {\n    \"all\",\n    \"highly_engaged\"\n  }\n}\n```\nUser Table: lytics_user_table_20240408220715\nAudience Table: lytics_audiences_table_20240408220715\nNon-scalar table for channels: lytics_channels_table_20240408220715\nNon-scalar table for hourly: lytics_hourly_table_20240408220715\nUpdated27 days ago",
  "url": "https://docs.lytics.com/docs/acoustic"
}