{
  "title": "Adobe",
  "content": "## Overview\nThis guide offers an overview of options for leveraging Lytics standard integration capabilities to connect with Adobe’s ads products.\nThe decisioning capabilities of Lytics can be combined with the personalized activation proficiency of the Adobe products:\n- Adobe Campaign\n- Adobe Analytics\n- Adobe Target\n- Adobe Ad Cloud\n- Adobe Audience Manager\n\n## Options for sending data from Lytics to Adobe:\n- Sending file based data directly to Adobe using aLytics File Servce\n- Sending data in near real time from Lytics to one of our supported data warehouse integrations (Google BigQuery,Microsoft Azure,Snowflake,Amazon Web Services (AWS) Redshift).Then from the data warehouse, send the data to Adobe Cloud\n- Client Side - Lytics surfaces data in Web Layer via the Lytics JavaScript Tag. Learn how you can via the Lytics taghere.\n\n## Options for sending data from Adobe to Lytics:\n- From Adobe send data to a Lytics Supported data warehouse  (Google BigQuery,Microsoft Azure,Snowflake,Amazon Web Services (AWS) Redshift). The data from the data warehouse can be imported into Lytics. In many cases this is the recommended approach to avoid duplication of processes and data storage.\n- Sending file based data from Adobe to Lytics using aLytics File Service\n- Client Side - Using the Lytics JavaScript Tag [link] to pass Information to Lytics from the website / data layer\n\n## Further details on integrating with Adobe products\nAdobe Campaign\nLytics can export file based data to Adobe Campaign via hourly/daily CSV file export to an SFTP location. Adobe Campaign can import CSV files from its own secure location. This is more of a limitation on the Adobe Campaign side regarding limited API access.\n\n## Adobe Analytics\nThere are many ways to get data into Lytics from Adobe Analytics. One common method is to use the Lytics Javascript tag (jstag.send) function to send eVars directly from the data layer into Lytics on page load. This method will simplify the onboarding process and minimize the need to do a data transfer from Adobe Analytics on a regular basis.\nAs part of onboarding, we can help identify which data you would like to pull in for activation and identify the right mechanisms for ingestion. Lytics provides ways to ingest this data from scheduled SFTP pickups to Bulk API imports or transactional APIs.\n\n## Adobe Target\nOur Javascript Tag will communicate user audience membership to Adobe Target, which will respond with the appropriate site personalizations.  This Lytics data will be returned from our platform on page load and the Users Profile, segmentation information and content recommendations will be placed in the web page data layer.\nYou can pass this information simply by leveraging the lio.data.segments object that is loaded onto every page where the Lytics JS tag is deployed.\n\n## Adobe Ad Cloud\nSimilar to other Adobe products, Adobe Ad Cloud supports the consumption of user audiences via SFTP, Json file upload, API (Lytics can create a webhook to stream data - but more conversation with Adobe will be needed) as well as direct from other Adobe products like Adobe Audience Manager.\nLytics can also directly send audiences from Lytics into ad platforms (e.g. Facebook, Google, Linkedin, Twitter, Snapchat, Instagram, LiveRamp.  With our Google partnership, Lytics has early access to Google’s API-based integration for custom audiences within DV360.\n\n## Adobe Audience Manager\nWe can deliver audiences into Audience Manager via SFTP or Data Warehouse integration, similar to how the above integrations have been documented.\nUpdated2 months ago",
  "url": "https://docs.lytics.com/docs/adobe"
}