{
  "title": "Insights",
  "content": "## Introduction\nLytics Insights provide visibility into how your audiences and campaigns perform and recommend how you may improve engagement, drive conversions, and increase marketing ROI.\nYou can think of Lytics Insights as a way to connect thedatayou have with thedecisionsyou are making for marketing campaigns. Defined in a few words, Lytics Insights are:\n- Actionable: Direct knowledge to your marketing initiatives.\n- Contextual: Provide actions that are relevant to the Lytics user consuming them.\n- Explanatory: Describe phenomena in terms of your business processes or outcomes.\n- Novel: Offer a new understanding of your customers and campaigns.\nInsights serve as a key ingredient to achieve marketing personalization. To effectively leverage customer data, you must apply it throughout your campaign planning and execution process. Unlike metrics that remain on a BI dashboard or report, Lytics Insights are designed beimmediately activatedin your segmentation and campaign strategies.\nIf your account package includes Insights, you can access Insights from anywhere in the Lytics UI.\n\n## How Insights Work\nInsights surface meaningful data and recommended action, enabling you to make better, data-driven decisions during your campaign planning and execution. The core idea behind Insights is simple. Insights are a combination of facts and actions:\n- Fact: Observable, data-driven information providing demonstrable value. This is a unique set of raw metrics, such as the number of users or the amount of lift.\n- Action: Suggested behavior based on user role, data source, activation channels, industry, etc. This is the contextualization of a fact into something to be done.\nInsights are made possible thanks to the data science capabilities built into Lytics. The heavy lift of processing and interpreting data is automatically handled by machine learning models under-the-hood.\nThis is a prime example of how machine learning can augment (not replace) a marketer’s role. Machines efficiently and accurately sift through lots of data, allowing people to then make use of the important information in the most relevant context. For example, a model can predict which users are most likely to churn, and a marketer can then target those at-risk users with a win-back campaign on Facebook.\n\n## Insight Cards\nInsights are presented asInsight Cardsthat are available throughout the entire app.Simply navigate to the left-hand side of the Lytics UI to open theInsights Drawer, which contains a list ofInsight Cardsunique to your account.\nBelow is an example of an Insight card and what it's comprised of:\n- Creation date: When the Insight was generated.\n- Expiration date: When the Insight will be removed from the drawer. Insights expire after 2 weeks.\n- Insight statement: The explanation or comparison of noteworthy data will depend on the type of Insight. You can click on an audience name to view its summary report.\n- Recommended action: Lytics will suggest how you can apply this Insight to your targeting along with a related use case.\n- Expanded definition: View more details by clicking the arrow. This example explains the Lytics score or other data field being calculated.\nInsights are generated and refreshed on aweekly basisto ensure you are viewing the most recent user data. Insights expire after 2 weeks, so you only target and activate an audience and campaigns during a relevant time frame.\nThe Insights Drawer will display a maximum of 25 cards at a time. Insights will be created for up to10 custom audiences, in addition to Lytic's out-of-the-box engagement audiences. Lytics will prioritize Insights based on the statistical significance of the data and the most frequently used audiences.\n\n## Compositional Insights\nCompositional Insights help you understand the makeup of your audiences. This information can answer, “what makes an audience unique?” and “How should I target these users differently?”\nCompositional Insights make it easier for you to create effective segmentation strategies. They compare data fields within audiences to surface which attributes drive user behavior. Compositional Insights currently include the following:\n\n## Audience Pairs\nThis Insight compares high-value audiences on their levels of engagement. This can take the form of comparing Lytic's out-of-the-box audiences on a particular behavioral score or a custom audience.\nAs a bite-size piece of information, this Insight Card has provided:\n- An easy way to leverage Lytics audiences and scores that are derived from data science.\n- A suggested next step of what to do with this information. For example, you may target these at-risk users with a win-back campaign.\n\n## Field Candidates\nThis Insight compares the prevalence of specific data fields within two audiences. Candidates included arefields used in audience definitionsand fields from thePromoted Schema Fieldsin yourAccount Settings.\nHaving a granular understanding of your audiences allows you to make more strategic targeting decisions. For example, there may be a data field that your organization is paying to collect. If you discover through an Insight Card that this field is not performing as expected in your campaigns, you could save marketing spend by eliminating that field and using others that are shown to be more predictive of user behavior.\n\n## Experience Insights\nExperience Insights help you track and understand campaign performance. This information can answer, “Which campaigns are resonating with my users?” and “Are my marketing tactics driving engagement or conversions?”\nExperience Insights allow you to refine campaigns based on current metrics proactively. Since Lytics Insights are generated and refreshed every week, you can take action to improve a campaign while it’s running.\nExperience Insights include the following types:\n\n## Experience Management\nThis Insight will surface when an experience is missing UTM parameters, which enable Lytics to track conversions from downstream tools such as Facebook.\nWhile this Insight is more straightforward than the other types Lytics offers, it helps you quickly identify when an Experience configuration is incomplete, affecting your ability to track performance and target users who have previously engaged in future campaigns.\n\n## Experience Performance\nThis Insight appears when a significant spike up or down in campaign performance exists. Awareness of such incidents allows you to make the necessary changes to improve campaign ROI.\nFor example, if conversion rates have rapidly declined for a particular campaign in the last week, you may need to reevaluate and consider changes such as refining your audience, messaging, or campaign tactics.\n\n## Activating Insights\nTaking action based on your Insights is the most important part of the process. As the introduction explains, Lytics Insights are designed to be actionable. By understanding how users interact with your brand at a granular level, you can iterate campaigns to improve their performance and deliver better user experiences.\n\n## Activating against Lytics Behavioral Scores\nUser engagement is a crucial component of personalization. Each Lytics Score (quantity, frequency, recency, intensity, momentum, propensity) indicates a different aspect of user behavior,  but overall, higher scores indicate high engagement, while lower scores indicate low engagement.\nBelow are some everyday use cases you might consider, depending on whether the target audience hashigherbehavioral scores (anything above 50) orlowerbehavioral scores (anything below 50).\n\n## Targeting Users with Low Engagement\nThere are two main approaches to reaching unengaged users. The first is to drive engagement using a variety of tactics, such as messaging on different channels, targeting based on content affinities, etc. The second approach is to increase marketing efficiency by suppressing these users, thus improving your conversions.\n\n## Targeting Users with High Engagement\nWhen creating strategies around your most active users, you will want to keep them engaged by delivering relevant content and establishing a first-party relationship that increases their Lifetime Value (LTV). You can find more users who are similar to your best customers using lookalike audiences.\nYou can also learn more about what makes these engaged users different, which can inform your overall targeting strategies.\n- View the Audience summary by clicking the audience name on your Insight Card to see the history of this audience and its characteristics.\n\n## Activating against Lytics Content Affinity\nGiving your users more of what they love is a great tactic to consider to either drive engagement for less active users or to keep currently active users engaged.\nUpdatedalmost 2 years ago",
  "url": "https://docs.lytics.com/docs/insights"
}