{
  "title": "Importing External Experiences",
  "content": "## Importing External Experiences\nYou can import existing marketing initiatives currently managed by your channel providers, which enables you to quickly gain insights about the campaigns you’re already running. You can then take action by connecting these Experiences to your Lytics audiences.\nWhile you can monitor Experiences and activate audiences for them within Lytics, the management of external Experiences still happens inside your channel tools. If you want to stop, delete, or edit the execution of an Experience, you need to do so within the provider. If you choose to delete an Experience in Lytics that still has a matching campaign in your channel tool, it will show up on the import list and can be re-imported.\n\n## Centralize cross-channel reporting\nLytics serves as a central hub to monitor your cross-channel marketing, making it easier to understand and improve the performance of  your campaigns. For example, instead of logging into Facebook to check your ad campaign metrics and Iterable to check your email newsletter open rates, you can monitor the performance of both tools within your Lytics dashboard.\nTo start monitoring external Experiences on Lytics, follow the batch import steps.\n\n## Monitor Experiences via batch import\nOn your Lytics dashboard, navigate toExperiences, and selectAdd Experiences > Import.\n\n## Select your provider\nThe Lytics Canvas connects out-of-the-box with select channel providers. Over time, more providers will be added to this list. If you want to use a provider that is not currently available, you can use the \"Generic Experience\" workflow to export Lytics audiences to any of your integrated providers.\n\n## Authorize\nNext, you will be prompted to select an authorization for your chosen provider. Existing authorizations will be shown. If you have multiple accounts within a particular channel such as Facebook, you will choose which account to import from. If you don’t have an authorization, you will be prompted to add one before continuing. For Facebook, there is a second step for authorizing Ad Set ID after you’ve selected your account ID.\n\n## Import Experiences\nFinally, select the Experiences you want to import into Lytics (up to 10 at a time). The total number of Experiences you can bring into Lytics is only limited by the amount in your connected provider. However, to have meaningful and accurate reporting, it's recommended to only import Experiences that will add value to your use cases.\nCompleted experiences, such as an Ad Set that previously \"ended\", will not show on the list of importable Experiences. But if you have Ad Sets in Facebook that are saved as drafts, paused, or currently running, those will be available to import.\n\n## Connect Experiences with Lytics audiences\nOnce you start monitoring external Experiences, you can activate them by adding a Lytics audience. This lets you enrich your existing campaigns with Lytics behavioral audiences, content affinities, and delivery optimization.An example use case is to conserve Facebook ad spend by only targeting “Currently Engaged” users who have a high affinity for the content of a particular campaign. Leveraging data science under the hood, Lytics audiences can bring immediate value to your existing marketing campaigns.\nIf you have already imported an external Experience, you can activate it from the Experience summary view by clickingEditin the top right.\nIf you want to activate an Experience that you haven't imported yet, follow the single import steps below, which will guide you through the Experience editor.\n\n## Activate Experiences via single import\nTo activate an Experience that you haven't imported yet, you will follow the workflow of creating a new Experience in Lytics. From the Experiences list view, clickAdd Experiences>New.\nSelect your chosen provider and thenImportthe campaign, ad set, or journey. This example will continue with importing a SendGrid campaign.\nNext you will select an Authorization for your chosen provider as described above.\nThen you will select the campaign or ad set to import. Note that here you can only import one Experience at a time. ClickImport 1 Experienceto continue.\n\n## Complete the Experience Editor steps\nFinally, you will complete the following Experience Editor steps:\n- Target: configure your target audience for this Experience.\n- Configure provider: choose how the audience for your Experience will be exported to the third-party tool.\n- Configure delivery: option to automatically determine when to deliver messages to individual users on the third-party tool.\nUpon completion, your Experience will be ready to publish.\nUpdatedalmost 2 years ago",
  "url": "https://docs.lytics.com/docs/importing-external-experiences"
}