{
  "title": "Developer Quickstart",
  "content": "## Introduction\nWelcome to the Lytics developer tier! This guide will walk you through the steps to get started with Lytics and leverage its powerful personalization capabilities for your website.\n\n## Before You Begin\nBefore diving into the setup process, make sure you have the following:\n- Site Access / Management Permission: To install Lytics, you need permission to install JavaScript either via a tag manager or directly onto your website. Alternatively, you can install Lytics via aDrupal module.\n- Active Lytics Account: Verify that you can access an active Lytics account. If you don't have one yet, you canclaim your free developer account.\n- Lytics Dev Tools Chrome Extension: Install ourdeveloper toolsChrome extension to streamline the development and installation process.\n\n## Getting Started Checklist\nGetting started with Lytics is quick and easy! In just a few minutes, you'll be able to set up Lytics and start personalizing your website. We've focused this guide on the 3 essential steps to ensure a positive experience for you and your customers:\n- 1. Install the Lytics tag on your site.\n- 2. Ensuring site content and Lytics are syncing.\n- 3. Create your first personalized message.\n\n## Digging Deeper\nAfter completing the initial checklist outlined above, it's time to explore further avenues for enhancing and utilizing your profiles to their fullest potential. We've broken additional guides into two core focuses:\n\n## Building Profiles\nHere, we'll gain a comprehensive understanding of all available out-of-the-box attributes. Discover how to tag your site and integrate other sources to create robust and comprehensive profiles. This section is divided into:\n\n## Default Attributes & Segments:\n- Profile Attributes\n- Audience Segments\n- Content Collections\n\n## Site Activity & Conversion Tagging:\n- Capturing Website Activity (coming soon)\n- Capture Website Conversion Activity (coming soon)\n\n## Using Profiles\nHere, we'll explore leveraging out-of-the-box personalization SDKs and APIs to deliver optimal user experiences. Discover how to harness Lytics' tools and integrations to create tailored experiences that resonate with your audience. This section covers:\n\n## Guides & Inspiration\n- Surface a lead capture form only to unknown visitors.\n- Surface content recommendations based on interests.\n- Surface a promotional message to high-momentum visitors. (coming soon)\n- Sync profiles & audiences to GA4 or meta. (coming soon)\n- Personalize your site based on behaviors and stored attributes. (coming soon)\n\n## SDK Documentation\n- WebJavaScript SDKPersonalization SDK\n- JavaScript SDK\n- Personalization SDK\n- MobileiOS SDKAndroid SDKReact Native SDK\n- iOS SDK\n- Android SDK\n- React Native SDK\nUpdated6 months ago\n- 1. Account Setup",
  "url": "https://docs.lytics.com/docs/developer-quickstart#before-you-begin"
}