[
  {
    "title": "Lytics CDP",
    "content": "## Quick Start\n- Developer Quickstart\n\n## Account Management\n- What is Vault?\n- Accessing Accounts\n- Monitoring Metrics and Alerts\n- View More…\n\n## Key Concepts\n- Identity Resolution\n- Consent & Privacy\n- Client & Server Side Cookies\n- View More…\n\n## Pipeline & Profiles\n- Data Pipeline\n- Schema Management\n- Identity\n\n## Warehouse Access\n- What is Cloud Connect?\n- Connecting Warehouses\n- Data Models & Queries\n- View More…\n\n## Audiences & Activation\n- User Profiles\n- Audiences\n- Reports\n- View More…\n\n## Tutorials\n- Leveraging User Profiles\n- Data Collection & Onboarding\n- Data Management\n- View More…\n\n## SDKs & Tools\n- Web\n- Mobile\n- Chrome Extension\n\n## Integrations\n- Lytics Integration Options\n- Acoustic\n- Adobe\n- View More…\n\n## Partners\n- Partner Types\n- Lytics Communication\n\n## Legacy\n- Insights\n- Importing External Experiences\n- IDP-initiated SSO (legacy)\n- View More…",
    "url": "https://docs.lytics.com/"
  },
  {
    "title": "Developer Quickstart",
    "content": "## Introduction\nWelcome to the Lytics developer tier! This guide will walk you through the steps to get started with Lytics and leverage its powerful personalization capabilities for your website.\n\n## Before You Begin\nBefore diving into the setup process, make sure you have the following:\n- Site Access / Management Permission: To install Lytics, you need permission to install JavaScript either via a tag manager or directly onto your website. Alternatively, you can install Lytics via aDrupal module.\n- Active Lytics Account: Verify that you can access an active Lytics account. If you don't have one yet, you canclaim your free developer account.\n- Lytics Dev Tools Chrome Extension: Install ourdeveloper toolsChrome extension to streamline the development and installation process.\n\n## Getting Started Checklist\nGetting started with Lytics is quick and easy! In just a few minutes, you'll be able to set up Lytics and start personalizing your website. We've focused this guide on the 3 essential steps to ensure a positive experience for you and your customers:\n- 1. Install the Lytics tag on your site.\n- 2. Ensuring site content and Lytics are syncing.\n- 3. Create your first personalized message.\n\n## Digging Deeper\nAfter completing the initial checklist outlined above, it's time to explore further avenues for enhancing and utilizing your profiles to their fullest potential. We've broken additional guides into two core focuses:\n\n## Building Profiles\nHere, we'll gain a comprehensive understanding of all available out-of-the-box attributes. Discover how to tag your site and integrate other sources to create robust and comprehensive profiles. This section is divided into:\n\n## Default Attributes & Segments:\n- Profile Attributes\n- Audience Segments\n- Content Collections\n\n## Site Activity & Conversion Tagging:\n- Capturing Website Activity (coming soon)\n- Capture Website Conversion Activity (coming soon)\n\n## Using Profiles\nHere, we'll explore leveraging out-of-the-box personalization SDKs and APIs to deliver optimal user experiences. Discover how to harness Lytics' tools and integrations to create tailored experiences that resonate with your audience. This section covers:\n\n## Guides & Inspiration\n- Surface a lead capture form only to unknown visitors.\n- Surface content recommendations based on interests.\n- Surface a promotional message to high-momentum visitors. (coming soon)\n- Sync profiles & audiences to GA4 or meta. (coming soon)\n- Personalize your site based on behaviors and stored attributes. (coming soon)\n\n## SDK Documentation\n- WebJavaScript SDKPersonalization SDK\n- JavaScript SDK\n- Personalization SDK\n- MobileiOS SDKAndroid SDKReact Native SDK\n- iOS SDK\n- Android SDK\n- React Native SDK\nUpdated6 months ago\n- 1. Account Setup",
    "url": "https://docs.lytics.com/docs/developer-quickstart"
  },
  {
    "title": "What is Vault?",
    "content": "## Introduction\nVault is a centralized hub for managing security and other administrative features in Lytics. It provides a single place for Lytics admins to access and change their key security features and user permissions, regardless of product. This means that the controls set in Vault apply to Conductor, Decision Engine, Cloud Connect, and any other products associated with your Lytics account.\nTake a quick tour of Lytics Vault.\n\n## Navigating Vault\nVault is comprised of the following sections:\n- Account Usage- an overview of your general account quota usage related to event consumption.\n- Account Settings- view and change necessary administrative settings and details of your account. These are sectioned into the following categories.Account DetailsJavaScript TagLytics APIContentSecuritySchema\n- Account Details\n- JavaScript Tag\n- Lytics API\n- Content\n- Security\n- Schema\n- Users- view a list of users accessing your Lytics account, change their details or permissions, remove a user, or invite a new user to the account.\n- SecurityAccess Tokens- view and manage a list of Lytics API access tokens. New tokens can be provisioned with specific permissions.Authorizations- create, edit, view, and delete authorizations within Lytics. Authorizations are credentials to third parties that enable the necessary scopes and permissions for data import and export jobs to run.\n- Access Tokens- view and manage a list of Lytics API access tokens. New tokens can be provisioned with specific permissions.\n- Authorizations- create, edit, view, and delete authorizations within Lytics. Authorizations are credentials to third parties that enable the necessary scopes and permissions for data import and export jobs to run.\n- Account SetupJavaScript Tag- learn how to install the Lytics JavaScript tag and validate the installation.\n- JavaScript Tag- learn how to install the Lytics JavaScript tag and validate the installation.\n\n## Who can access Vault?\nVault is focused primarily on account admins or those that have permission to administer settings, user access, etc. Based upon these permissions, your experience in Vault may vary, and all sections outlined above may not be available.\n\n## 📘\nIf you are unable to access a section please reach out to your account administrator to request those adjusted permissions.\nIn general, Admins will be able to access all areas. Data Managers, Campaign Managers, Experience Managers, and Goal Managers can access the Authorizations section to manage the credentials for their jobs and experiences. Finally, all Lytics users, regardless of role, should have access to view the JavaScript tag installation page under Account Setup, and they should be able to view their user profile where they can change details such as their Name, Email Address, Phone Number (for two-factor authentication) and change their password. Your user profile will be accessible under the main Lytics navigation under \"Manage My Profile.\"\n\n## Notable Changes\nFor existing customers, slight changes will impact your day-to-day management activities.\n\n## Product Switcher\nVault will be available directly from the primary product switcher at the top left of your Lytics interface. This will be your primary access point for account management from now on.\n\n## Account Usage\nOur account usage data and quota meters received a much-needed facelift. The usage metrics act as the Vault \"dashboard\" for admin users.\n\n## Account Settings\nAccount setting sections are now accessible through the main navigation. These settings have received a minor facelift update. The form controls for multi-text fields have been slightly updated for a more standard user experience. In addition, users are now prompted to save or discard their changes when navigating away from these pages with unsaved settings.\n\n## Users\nThe user list is now sortable and filterable based on name, email, who invited them, and how long they've been a Lytics user. Each user has a page to view their details and roles. In Vault, in addition to assigning new roles, an administrator can edit any user's name and email address.\nThe user invite form is now on its page to improve the flow and experience of inviting users. Roles are now sorted into two categories - Admin or Custom Roles. An admin inherently has access to everything, while custom roles give a finer-grain definition of what the user can access. The details on each role are shown in a tooltip when you hover over the role name.\n\n## Access Tokens\nThe access tokens list is now sortable and filterable based on the name, description, the creator of the token, or when/if it has expired. You can now view additional details about the access tokens you've already created, such as the roles assigned, when it was made, and when it will expire. In addition, new access tokens can now be assigned as an admin or with any combination of more granular access roles.\n\n## Authorizations\nAuthorizations are now to be created and updated only in Vault. You will still be able to utilize the auths you create in Vault in other products, but for example, when creating a job in Conductor or Decision Engine, if you don't see an authorization you want to use for that job, you will be linked into the authorizations wizard within Vault to create the auth.\n\n## JavaScript Tag Installation\nThis page remains unchanged, with simple styling changes and updated links to our documentation for troubleshooting.\nUpdatedover 1 year ago",
    "url": "https://docs.lytics.com/docs/what-is-vault"
  },
  {
    "title": "Accessing Accounts",
    "content": "## Introduction\nUnder the account menu in the main navigation, find the Account Settings option.\nYou should see your account information, such as the name of your account, domain, the account owner's email, and more.\nYou can edit your account name, domain, and primary contact email from this page anytime. Once you change one of these values, you will be prompted to save or undo the changes.\nAccount ID and account number are never editable. They are assigned at account creation and are permanent identifiers.\n\n## Navigating Accounts\nFor users who have access to multiple accounts, you can quickly and securely navigate between Accounts using our account switcher at the bottom right of the primary navigation:\n\n## 1. Click \"Switch Account\"\n\n## 2. Select Account\nA menu will appear outlining the accounts you have access to. Simply select an account and a new tab will open with this accounts dashboard.\nUpdatedover 1 year ago",
    "url": "https://docs.lytics.com/docs/account-details"
  },
  {
    "title": "Monitoring Metrics and Alerts",
    "content": "## Monitoring\nMonitoring and alerting is available on every job and every authorization within Lytics.\nTo set up alerting on your jobs or authorizations, you can set up a monitoring job from either the Job API or the Lytics UI for alerting toSlack,Microsoft Teams, or directly toemail.\nIf a source or destination job has failed, Lytics will show the latest error message on the Conductor Diagnostics Dashboard and on the Logs tab of the Source/Destination Job Summary interface, and allow the job to be restarted if needed. The most detailed information for troubleshooting can be accessed from theJob Logs API\nAdditional generic monitoring on the Lytics system is available on our status page atlytics.statuspage.io.\nUpdated12 months ago",
    "url": "https://docs.lytics.com/docs/monitoring-and-alerts"
  },
  {
    "title": "Identity Resolution",
    "content": "## Introduction\nIdentity Resolution is a crucial component of customer communication. Establishing and maintaining a well-defined identity resolution strategy is essential, but it can be overwhelming to get started. Several challenges may arise, such as limited and outdated customer data, data silos, technical difficulties, in-flexibility, consistency, compliance, and maintenance.\nLytics offers a solution that powers brands' identity resolution strategies by aggregating data from disparate sources, defining a standardized customer schema, unifying disparate sources, surfacing individual consumer profiles, enabling better understanding, segmentation, and activation across channel tools, ensuring control, visibility, flexibility, security, privacy, and compliance, and maximizing match rates and accuracy across activation channels.\nThe goal is to construct complex consumer profiles and maintain accurate and compliant user profiles as your brand evolves. Defining the relationship between consumer identifiers is a necessary first step in surfacing unified user profiles that enable your brand to create the best consumer engagements while meeting evolving compliance requirements. To achieve this, we've broken our approach into three components:\n\n## Our Approach\n\n## Define: Relationships Between Identifiers\nProfile definition is the first step in surfacing unified user profiles that enable your brand to create the best consumer engagements while meeting evolving compliance requirements.\nTo build a strong identity resolution strategy, three key questions must be answered:\n- How important is accuracy?\n- How do you define and manage the strength of each identifier to ensure profiles are materialized properly?\n- How can the materialized profiles be analyzed and delivered to other tools?\n\n## Construct: Complex Profiles\nData is messy. Lytics' Profile Materialization provides a necessary cleansing & polishing layer atop the defined resolution strategy. This ensures what is surfaced is accurate and accessible and enables your team to accelerate impact.\nAnswering the following two key questions guarantee profiles represent the ideal marketable entity:\n- What attributes should be surfaced on profiles for segmentation, and does the data need to be normalized at all?\n- What rules should be used to maintain profile integrity?\n\n## Maintain: Accurate & Compliant Profiles\nOver time profiles will bloat, attributes will become stale, and use cases become more complex. If unmanaged, a quality identity strategy will begin breaking down the moment it is implemented.\nLytics prevents your identity strategy from breakdown through a set of powerful tools focused on ensuring the following profile health-related questions have concrete answers:\n- How can you validate the health of your ID resolution strategy over time?\n- What is the process for managing consent?\n- How long is a profile relevant if it no longer has a means of being updated?\n- What is the life expectancy of expirable IDs, such as browser cookies?\n\n## Advanced Concepts\n\n## The Lytics Identity Graph\nBehind each Lytics profile is an identity graph.  This graph represents connections between pieces of data observed across multiple sources or even within a single source.\nTo create (or update) profiles from a data stream, the stream must contain one or moreidentity keysthat identify distinct users with which to associate the data.  When data is observed for a given identity key, it stores the relevant profile metadata in an object called anidentity fragment.  When there's evidence on a data stream  that two keys or fragments should be connected\nWhen evidence on a data stream shows that two keys or fragments identify the same real-world entity, those fragments become connected in the same identity graph.  Some identity graphs are significant and represent complex relationships in the data. In contrast, other identity graphs are small and describe a small interaction, like an anonymous cookie from a single-visit, incognito browser.\n\n## Graph Mechanics\nAs you learned from the identity resolution overview, a profile comprises one or more identity fragments.  Many profiles start as singletons – new data is observed on a data stream. That event's identifier keys create any necessary identity fragments and store the event's associated data on that fragment.\nHowever, we're not satisfied with several singletons – our objective is to stitch data sources together by linking the appropriate underlying fragments.  Stitching occurs when we observe two identifiers in a single event.  A common stitching event is a newsletter signup, where the email address from the newsletter form is linked to the cookie from their web activity and creates a link between activity from the browser on the device and any activity associated with the email address, which could eventually encompass purchases, support tickets, CRM data, etc.\nIn graph terms, stitching creates an edge between two nodes representing two identity fragments.  If we wanted to retrieve a profile associated with an email address, we would retrieve all of the fragments with edges or connections to other fragments.  From there, we'd want to find all of the connections to those other fragments, and so on, until there are no more connections to follow.  Following one fragment to another is calledtraversal.  The full set of fragments that are found to have connections to the initial fragment are calledneighbors.\nIn Lytics, default graph limits cap the number of traversals allowed for an individual profile at 50 and cap the number of neighbors allowed at 50.  Changing these values can create different sets of user profiles over the same data set and should not be adjusted lightly.  To change these values for your data, please contactLytics support.\n\n## Identity Keys\nAs we traverse identity graphs, we'll quickly find that identity fragments and their corresponding identity keys are not all created equal. An identifier's strength must contribute proportionally to its influence on identity resolution.\nFor example, you have email addresses and cookies as identity keys.  Generally, a user identified with an email address can have multiple cookie values (from different devices, browsers, periods, etc.).  Imagine hosting a promotional, in-person event and having multiple tablets collecting participants' email addresses.  Depending on how those email addresses are collected (most likely through an online form), you'll likely have one cookie associated withmanyemail addresses.\n\n## Field Types\nField types for Identity Keys can be either a string or a string set.  String sets are a common field type for cookies since one profile is expected to have many cookie values over time.  Email addresses are not so cut-and-dry.  Some organizations will constrain profiles to have one email address, while others will allow profiles to have multiple (personal, work, etc.).  In our example of email collection via physical tablet, if the email address is a single-valued string type, we won't end up with an over-merged hairball.\nUsing an identity key that allows for a set of values is usually a good idea to have a sensical capacity cap on the field type.  A set of cookies, for example, might have a capacity limit of 50 values.  On the other hand, a set of emails might have a capacity limit of 5 values.\n\n## Identity Key Rankings\nThe ranking of your identity keys should reflect their reliability and their relative importance in the strategy.  In the event of a conflict in stitching and merging, higher-ranked identity keys will win.  Typically, most Lytics users configure email identifiers to be ranked higher than cookie identifiers.\nImagine a scenario where email A is connected to cookies X and Y, while email B is connected to cookie Z.  If new data is observed that connects email B with cookie Y, we have aconflict, meaning that a resulting stitching between the two fragments would yield a profile with twodifferentemail fragments and violates our merge rules.\nThe ranks of identity keys would dictate that, for the new event, the email address it contains is of a higher priority than the cookie value that it contains and would consequently update the profile for Email A andnotthe profile for Email B.\n\n## Graph Compaction\nWe mentioned that a critical tenet of bulletproof identity resolution is that profile complexity remains stable over time.  That is, we need a way to ensure that a relatively greedy algorithm doesn't result in profiles becoming more fragile and susceptible to conflicts.\nIn Lytics, that is accomplished via graph compaction, a process by which data from multiple fragments is combined into a single fragment.  Doing so allows well-established relationships in the graph to be solidified while making room for new relationships within the profile.  It functions more as a type of profile housekeeping to keep profile fragments tidy.\nCompaction in identity graphs can take on a few forms.\n\n## Rank-based Compaction\nLet's go back to our example with Email A and Email B.  The point of identity resolution within a customer data platform is to enable long and rich relationships with customers.  The longer that Email A and Email B represent profiles in the platform, the more cookies with which they'll eventually become connected.  Each identity key's ranking allows an identity graph to compact by size or time.\n- Size compaction: Identity key sets can be compacted after they reach a configurable size.  If size compaction is enabled to compact a set after 30 values, then the data from the oldest 30 fragments would be combined into a single fragment and would be further compacted with new data as new values are observed.\n- Time compaction: These sets would be compacted after a configurable time threshold.  If time compaction is enabled to compact a set after 14 days, then the data from fragments older than 14 days would be compacted into a single fragment.\nUpdatedover 1 year ago",
    "url": "https://docs.lytics.com/docs/identity-resolution"
  },
  {
    "title": "Consent & Privacy",
    "content": "## Introduction\nAs businesses continue to collect and utilize customer data to power their marketing efforts, obtaining, managing, and enforcing proper consent is crucial. This is important for complying with various privacy laws and regulations and maintaining trust with customers. This document will explore the importance of granularity in a consent strategy and how Lytics can assist in the consent management process. We will cover best practices to consider and provide guidance on where to get started. The following four steps will be outlined:\n- Data Collection: How to collect consent adequately from disparate sources consistently.\n- Profile Materialization: How to flexibly surface the state of consent to individual user profiles.\n- Segmentation: How can the required consent rules be enforced when driving downstream campaigns?\n- Maintenance: How to ensure that your consent strategy scales and flexes to your ongoing market conditions without fail?\nBy following these steps, businesses can establish a solid and effective consent management strategy that respects customer privacy and builds trust.\n\n## Data Collection\nTo maintain compliance with data privacy regulations, businesses need a clear and flexible path for collecting consent data. Lytics offers a range of SDKs and data collection APIs to support this effort. When approaching consent data collection, it is essential to consider the following:\n- The source of the data and any inherent limitations. Can it be real-time, or does it need to be batch?\n- The granularity of the consent. Is this a simple boolean, on or off, or is this something more granular, like opting into a particular communication method?\n- Additional context related to the consent that may be important for your needs. Are there specific forms that are being consented to or a unique source?\nTo address these considerations, Lytics has developed a suggested schema to get you started. Of course, this can always be customized viaConductorto meet your specific needs.\n\n## Data Structure\nEffective consent management requires a comprehensive set of properties that can be deployed to ensure compliance and maintain customer trust. These properties should cover various aspects of data collection, storage, and usage and provide businesses with the tools to manage consent-related data effectively.\n\n## Examples\n\n## 📘We are here to help!\nWe are here to help!\nConsent is not a one size fits all scenario. Each customers data and business goals are unique. Before deploying any of the following examples it is always recommended to consult with your Technical Account Manager or a Solutions Architect.\nLytics deploys a flexible data model, and though the following is not representative of every method of collection, we've highlighted two working examples leveraging our available SDKs as a baseline:\n\n## Collecting Consent via the Web: Lytics JavaScriptTag\n\n```\njstag.send({\n  \"event\": \"form-submit\",\t\n  \"consent\": {\n    \"purpose\": \"global\",\n    \"location\": \"Portland, OR\",\n    \"documents\": [\"generic-submit-form\"],\n    \"consented\": true\n  }\n})\n```\n\n```\njstag.send({\n  \"event\": \"form-submit\",\t\n  \"consent\": {\n    \"purpose\": \"global\",\n    \"location\": \"Portland, OR\",\n    \"documents\": [\"generic-submit-form\"],\n    \"consented\": true\n  }\n})\n```\n\n## Collecting Consent via Mobile: Lytics iOS SDK\n\n```\nLytics.shared.consent(\n  name: \"consent-1\",\n  identifiers: AnyCodable([\n    \"userid\": \"my-fake-userid-1234\"\n  ]),\n  attributes: AnyCodable([\n    \"firstName\": \"Kevin\",\n    \"lastName\": \"McCalister\"\n  ]),\n  consent: AnyCodable([\n    \"documents\": [\n      \"terms_jan_2023\",\n      \"sharing_policy_jan_2023\"\n    ],\n    \"location\": \"Chicago, IL\",\n    \"consented\": true\n  ])\n)\n```\n\n```\nLytics.shared.consent(\n  name: \"consent-1\",\n  identifiers: AnyCodable([\n    \"userid\": \"my-fake-userid-1234\"\n  ]),\n  attributes: AnyCodable([\n    \"firstName\": \"Kevin\",\n    \"lastName\": \"McCalister\"\n  ]),\n  consent: AnyCodable([\n    \"documents\": [\n      \"terms_jan_2023\",\n      \"sharing_policy_jan_2023\"\n    ],\n    \"location\": \"Chicago, IL\",\n    \"consented\": true\n  ])\n)\n```\n\n## 📘\nWhen using Lytics SDKs, you do not have to include date within the data passed in the consent event. The timestamp of the consent event can be used to create the field and mapping for the date of consent.\n\n## Profile Materialization\nBuilding from the collection strategy outlined inCollecting Consent Data, we must determine how to materialize the consent-related data we've just collected to user profiles for segmentation. This can be achieved in a variety of ways. Regardless of the approach, however, it is essential to consider the level of granularity of the consent.\n\n## Granularity\nWhen collecting consent from users, obtaining granular consent for each specific use of a customer's personal data is an important consideration. Granular consent means that customers are provided with a clear understanding of the exact purposes for which their personal data will be used and can choose to consent or withhold consent for each specific use case.\nFor example, a business may seek granular consent from a customer to collect their email address and use it to send them promotional emails but not to share the email address with third-party partners for advertising purposes. This approach allows customers to make more informed decisions about how their personal data is used and provides greater control over their privacy.\nObtaining granular consent not only requires careful planning and clear communication with customers about the specific use cases for their personal data but also a rock-solid means for enforcing an individual's consent wishes across all future touchpoints.\n\n## Schema\nEnforcement begins by ensuring consent wishes are accurately materialized on each user's profile. This is done by first defining consent-related attributes to be used in segmentation.\n\n## Field Definition\nWhen defining profile fields, there are two primary considerations. What type of field should be used, such as astringor amapand how do you want to handle data merging when profiles are stitched?\n\n```\nstring\n```\n\n```\nmap\n```\n\n## Field Type\n\n## Merge Operator\nType StringBecause consent is something that may change for a consumer over time, the values must represent the most recent data. As such, thelatestmerge operator is always recommended. This means that as additional data is stitched to a user profile, the most recent events that are mapped to a field will win.\n\n```\nlatest\n```\n\n## Example String\nType MapFor a more complex or granular consent strategy, the map field type can be very helpful in accurately managing consent. As such, themergemerge operator is always recommended when trying to keep the key-value pairs up to date to the most recent consent state. This means that as additional data is stitched to a user profile, the most recent events that are mapped to a key-value pair will win.\n\n```\nmerge\n```\n\n## Example Map\n\n## Mapping Definition\nMappings are then leveraged to determine how data from any number of streams map to the defined field. In the example below, we take a simple approach to map the boolean value of true or false to the consent field if the consent is related tomarketing-consent.\n\n```\nmarketing-consent\n```\nThough this is one elementary example, the same practice can be replicated to ensure a consent attribute has the status, timestamp, and context of any important policies or sources for segmentation.\n\n## Example\n\n## Segmentation\nBusinesses can better understand their customers and create more effective campaigns by breaking down audiences into smaller, more targeted segments. Here we will discuss best practices for constructing \"building block\" audiences related to consent that can then be leveraged in campaign audiences. This progressive approach ensures consent rules are enforced while minimizing ongoing maintenance overhead.\n\n## Building Blocks\nBuilding Block Audiences provide the perfect means to maintain consent-related rules and extend the ruleset to all campaign audiences. The number and these audiences will depend on the granularity of your consent strategy. Still, as a basic example, we recommend creating both a \"has consented\" and \"has not consented\" counterpart for each level of consent.\nThis can be done simply through the GUI for our powerful segmentation engine, as shown below:\n\n## Campaign Segments\nOnce you have the necessary building blocks constructed, you can quickly integrate that rule set into your campaign audiences again through the GUI for our segmentation engine. The example below outlines a use case where you want to target high-value users who have opted in.\n\n## Global Job Segment Filter (Consent)\nConfigure a segment to prevent profiles from being sent to downstream destinations based on consent status or another relevant filter. This ensures that individuals who should be excluded will not be activated downstream.\nAPI documentation can be foundhere.\nUpdated7 months ago",
    "url": "https://docs.lytics.com/docs/consent"
  },
  {
    "title": "Client & Server Side Cookies",
    "content": "## What is a Cookie\nAn HTTP cookie (web cookie, browser cookie) is a small piece of data that a server sends to a user's web browser. The browser may store the cookie and send it back to the same server with later requests. Typically, an HTTP cookie is used to tell if two requests come from the same browser—keeping a user logged in, for example. It remembers stateful information for thestatelessHTTP protocol.\n\n## Cookie Flavors\n\n## First-party\nFirst-party cookies are created by the host domain – the domain the user is visiting. These cookies are generally considered good; they help provide a better user experience and keep the session open. This means the browser can remember key information, such as items you add to shopping carts, username, and language preferences.\n\n## Third-party\nThird-party cookies are those created by domains other than the one the user is visiting at the time and are mainly used for tracking and online-advertising purposes. They also allow website owners to provide certain services, such as live chats.\n\n## Common Cookie Use Cases\n\n## Session management\nLogins, shopping carts, game scores, or anything else the server should remember.\n\n## Personalization\nUser preferences, themes, and other settings.\n\n## Tracking\nRecording and analyzing user behavior.\n\n## How does Lytics use cookies?\nCookies are one of the preferred methods for maintaining a user identifier in the browser, both known and anonymous. This gets associated with all inbound events captured by our Javascript tag as they interact with customer websites. Specifically, our Javascript tag stores a string of digits and characters that are used as a unique ID commonly referred to as our_uidor, in some casesseeridas a first-party cookie.\n\n```\n_uid\n```\n\n```\nseerid\n```\n\n## Creating & Managing Cookies\n\n## Where do cookies come from?\n\n## Client-Side\nIn web development, the client-side refers to everything in a web application displayed on the client (end-user device). This includes what the user sees, such as text, images, and the rest of the UI, along with any actions an application performs within the user's browser.\nWhen someone refers to a “client-side cookie,” they are generally referring to a cookie that is created and/or managed via a common client-side programming language such as Javascript.\n\n## Server Side\nLike with client-side, server-side means everything that happens on the server instead of on the client. In the past, nearly all business logic ran on the server-side, including rendering dynamic webpages, interacting with databases, identity authentication, and push notifications.\nWhen someone refers to a “server-side cookie,” they are generally referring to a cookie that is created and managed using one of the many common server-side programming languages such as NodeJS, PHP, Python, etc.\n\n## Cookie Ingredients\n\n## Name\nDefines the cookie name. Generally, the cookie name is the primary way of retrieving a cookie and its associated value and attributes.\n\n## Value\nThe stored value for the cookie. This can include any US-ASCII character excluding a control character, whitespace, double quotes, comma, semicolon, and backslash.\n\n## Expires\nIndicates the maximum lifetime of the cookie as an HTTP-date timestamp. SeeDatefor the required formatting.\n\n```\nDate\n```\n\n## Max-Age\nIndicates the number of seconds until the cookie expires. A zero or negative number will expire the cookie immediately.\n\n## Domain\nDefines the host to which the cookie will be sent.\n\n## Path\nIndicates the path that must exist in the requested URL for the browser to send theCookieheader.\n\n```\nCookie\n```\n\n## Secure\nThis indicates that the cookie is sent to the server only when a request is made with theHTTPS:scheme (except on localhost) and, therefore, is more resistant toman-in-the-middle attacks.\n\n```\nHTTPS:\n```\n\n## HttpOnly\nForbids JavaScript from accessing the cookie, for example, through theDocument.cookieproperty. Note that a cookie created withHttpOnlywill still be sent with JavaScript-initiated requests, for example, when callingXMLHttpRequest.send()orfetch(). This mitigates attacks against cross-site scripting (XSS).\n\n```\nDocument.cookie\n```\n\n```\nHttpOnly\n```\n\n```\nXMLHttpRequest.send()\n```\n\n```\nfetch()\n```\n\n## SameSite\nControls whether or not a cookie is sent with cross-origin requests, providing some protection against cross-site request forgery attacks (CSRF).\n\n## Who’s taking away my cookies?!?\nIn June 2017, Apple introduced a new privacy feature calledIntelligent Tracking Prevention (ITP). This same feature was officially released in September 2017 with Safari 12 and iOS 11. Since then, the ITP has evolved and introduced several subsequent versions leading us to the current state (as of July 2022), which has many impacts on marketing but most notably:\n- ITP blocks all third-party cookies by default. (ITP 1.0/1.1)\n- ITP can grant exceptions to third-party cookies with Storage API. (ITP 2.0)\n- ITP caps all first-party cookies set with JavaScript to 7 days or 24 hours. (ITP 2.1/2.2)\n- ITP caps first-party cookies set by the server using CNAME cloaking to 7 days. (ITP 2.3)\nAs a result of the privacy and security efforts in general other browsers such as Mozilla’s Firefox(ETP) and Google Chrome have followed suit in announcing and/or implementing their security and tracking protocols, which continue to impact tools such as third and first-party cookies that have long been a staple in providing the data necessary for marketers to personalize their communications effectively.\n\n## What can I do to replace my cookies?\nWith each iteration on more stringent privacy-related changes comes a wave of workarounds or alternate approaches to maintaining access to behavioral data essential to marketing:\n\n## 1. Deploy a strong first-party identification strategy.\nThere is no replacement then a strong identification strategy. Creating a relationship in which a user will openly share their identity through a login or some other authenticated means will always result in the highest level of certainty on identity, which leads to the best level of personalization. However, many use cases focus on anonymous users or users who have not built up the relationship necessary to unlock this level of authentication.\n\n## 2. First-party client-side cookies have changed but are still a viable solution.\nThough third-party cookies are effectively dead, first-party cookies are still viable for many use cases. Not only do they offer a very simple off-the-shelf type of implementation for leveraging, they also have a long shelf life, assuming that an anonymous user interacts frequently enough to overcome the 7-day expiration window.\n\n## 3. First-party server-side cookies offer an extended expiration window.\nOver the past 12 months, there has been a surge of interest in server-side cookies. This method for setting cookies currently is not affected by the ITP changes that impact client-side cookies, most notably the automatic expiration at seven days. Rather, server-side cookies can live for long periods, leading to a higher quality identification for anonymous users. The downside, however, is they are far more difficult to leverage than the client-side. They require a much more technical integration with whatever server-side technology is used to power the web asset and may not be accessible in the same manner as client-side cookies.\n\n## Getting Technical with Server Side Cookies\nIn general, regardless of the specific attribute settings used when leveraging server-side cookies, they currently are not impacted by the 7-day expiration window that client-side cookies fall victim to. However, Apple has made it clear that they have additional plans to extend some of the client-side cookie limitations to the server-side, and the most important attribute in that discussion is theHttpOnlyattribute.\n\n```\nHttpOnly\n```\nhttps://webkit.org/blog/9521/intelligent-tracking-prevention-2-3/\nAs a CDP and technology leader, we always aim to help our customers future-proof their implementations. As such, even though a non-HttpOnly server-side cookie offers an easier means to bypass current client-side restrictions, it is our recommendation to consider investing to leverageHttpOnlycookies set by the server-side to prevent any potential impacts of the next few iterations of ITP. Below we’ll explore the two options and demonstrate the key differences.\n\n```\nHttpOnly\n```\n\n## Server Side Cookie without HttpOnly\nThe following example in Node.js demonstrates a sample snippet for setting the cookie server side. Most server-side languages have existing methods to make this very easy. In the case of creating a cookie for Lytics to leverage, you will also need to generate a unique ID which can be done in a variety of ways. In the case of Node, you may consider using therandomUUID() method of the Crypto interface. A simple Google search can lead you or your developer down the road of generating a unique ID that best fits your use case.\nOnce you have that unique ID, you simply set the cookie using the pre-defined Lytics name our Javascript tag is looking for. Alternatively, the tag can be configured to use any custom name.\n\n```\n// THE FOLLOWING REPRESENTS A UNTESTED AND NON-PRODUCTION LEVEL\n// EXAMPLE OF HOW TO SET A COOKIE SERVER SIDE WITH NODE.JS AND\n// ACCESS THE DOCUMENT.COOKIES FROM THE CLIENT SIDE\n\nvar express = require('express');\nvar app = express();\nvar cookieParser = require('cookie-parser');\nvar crypto = require('crypto');\nvar dayjs = require('dayjs');\n\n// cookieParser middleware\napp.use(cookieParser());\n\n// route for setting the cookies\napp.get('/setcookie', function (req, res) {\n  // setting a server side cookie without httponly\n  res.cookie(\"seerid\", crypto.randomUUID(), {\n    httpOnly: false,\n    expires: dayjs().add(30, \"days\").toDate(),\n  });\n\n  res.send(`<html><body><p>A server side cookie has been set.</p></body></html>`);\n})\n\n// Route for getting all the cookies\napp.get('/getcookie', function (req, res) {\n    res.send(`\n        <html>\n            <head>\n                <script>\n                    alert(document.cookie);\n                </script>\n            </head>\n            <body>\n                <p>This is an example of how to get the cookies client side.</p>\n            </body>\n        </html>`\n    );\n})\n\napp.listen(3000, (err) => {\n    if (err) throw err;\n    console.log('server running on port 3000');\n});\n```\n\n```\n// THE FOLLOWING REPRESENTS A UNTESTED AND NON-PRODUCTION LEVEL\n// EXAMPLE OF HOW TO SET A COOKIE SERVER SIDE WITH NODE.JS AND\n// ACCESS THE DOCUMENT.COOKIES FROM THE CLIENT SIDE\n\nvar express = require('express');\nvar app = express();\nvar cookieParser = require('cookie-parser');\nvar crypto = require('crypto');\nvar dayjs = require('dayjs');\n\n// cookieParser middleware\napp.use(cookieParser());\n\n// route for setting the cookies\napp.get('/setcookie', function (req, res) {\n  // setting a server side cookie without httponly\n  res.cookie(\"seerid\", crypto.randomUUID(), {\n    httpOnly: false,\n    expires: dayjs().add(30, \"days\").toDate(),\n  });\n\n  res.send(`<html><body><p>A server side cookie has been set.</p></body></html>`);\n})\n\n// Route for getting all the cookies\napp.get('/getcookie', function (req, res) {\n    res.send(`\n        <html>\n            <head>\n                <script>\n                    alert(document.cookie);\n                </script>\n            </head>\n            <body>\n                <p>This is an example of how to get the cookies client side.</p>\n            </body>\n        </html>`\n    );\n})\n\napp.listen(3000, (err) => {\n    if (err) throw err;\n    console.log('server running on port 3000');\n});\n```\nSince non-HttpOnly cookies are accessible out of the box client-side there is no additional lift necessary. Our tag will pick up the cookie and use that ID as the identifier. It is important to note that any UID changes must also be managed server-side as setting the cookie client-side will engage the 7-day expiration max. In this example, we simply raise an alert with the cookie string and do not show the actual implementation of the Lytics tag.\n\n## Server Side Cookie with HttpOnly\nSetting HttpOnly to true comes with an additional level of complexity but benefits from following the stringent and recommended guidelines of Apple ITP, which in theory will go farther in the way of future-proofing.\nMuch like the above example, we’ll set a cookie, in this case using Node, in the same way. The only difference here is settinghttpOnlyto true. This means that the cookie is secure but will no longer be accessible out of the box by Javascript. Rather, you’ll have to implement an alternative method for surfacing that ID to Javascript so that it can be passed to the Lytics Javascript tag and used during collection/resolution.\n\n```\nhttpOnly\n```\n\n```\n// THE FOLLOWING REPRESENTS A UNTESTED AND NON-PRODUCTION LEVEL\n// EXAMPLE OF HOW TO SET A COOKIE SERVER SIDE WITH NODE.JS AND\n// ACCESS THE DOCUMENT.COOKIES FROM THE CLIENT SIDE WHEN USING HTTPONLY\n\nvar express = require('express');\nvar app = express();\nvar cookieParser = require('cookie-parser');\nvar crypto = require('crypto');\nvar dayjs = require('dayjs');\n\n// cookieParser middleware\napp.use(cookieParser());\n\n// route for setting the cookies\napp.get('/setcookie', function (req, res) {\n  // setting a server side cookie with httponly\n  res.cookie(\"uuid\", crypto.randomUUID(), {\n    httpOnly: true,\n    expires: dayjs().add(30, \"days\").toDate(),\n  });\n\n  res.send(`<html><body><p>A server side cookie has been set using httpOnly.</p></body></html>`);\n})\n\n// Route for getting all the cookies\napp.get('/getcookie', function (req, res) {\n    res.send(`\n        <html>\n            <head>\n                <script>\n                    var uuid = '${req.cookies.uuid}';\n                    alert(uuid);\n                </script>\n            </head>\n            <body>\n                <p>This is an example of how to get the cookies client side when cookie is httpOnly.</p>\n            </body>\n        </html>`\n    );\n})\n\napp.listen(3000, (err) => {\n    if (err) throw err;\n    console.log('server running on port 3000');\n});\n```\n\n```\n// THE FOLLOWING REPRESENTS A UNTESTED AND NON-PRODUCTION LEVEL\n// EXAMPLE OF HOW TO SET A COOKIE SERVER SIDE WITH NODE.JS AND\n// ACCESS THE DOCUMENT.COOKIES FROM THE CLIENT SIDE WHEN USING HTTPONLY\n\nvar express = require('express');\nvar app = express();\nvar cookieParser = require('cookie-parser');\nvar crypto = require('crypto');\nvar dayjs = require('dayjs');\n\n// cookieParser middleware\napp.use(cookieParser());\n\n// route for setting the cookies\napp.get('/setcookie', function (req, res) {\n  // setting a server side cookie with httponly\n  res.cookie(\"uuid\", crypto.randomUUID(), {\n    httpOnly: true,\n    expires: dayjs().add(30, \"days\").toDate(),\n  });\n\n  res.send(`<html><body><p>A server side cookie has been set using httpOnly.</p></body></html>`);\n})\n\n// Route for getting all the cookies\napp.get('/getcookie', function (req, res) {\n    res.send(`\n        <html>\n            <head>\n                <script>\n                    var uuid = '${req.cookies.uuid}';\n                    alert(uuid);\n                </script>\n            </head>\n            <body>\n                <p>This is an example of how to get the cookies client side when cookie is httpOnly.</p>\n            </body>\n        </html>`\n    );\n})\n\napp.listen(3000, (err) => {\n    if (err) throw err;\n    console.log('server running on port 3000');\n});\n```\nAll code examples in this document are purely for demonstration. Any customer facing implementation should follow the guidance of our customer facing technical teams and the technical experts on our customer’s end. These examples in production represent HIGH risk as documented.\nUpdatedabout 1 year ago",
    "url": "https://docs.lytics.com/docs/client-server-side-cookie-deep-dive"
  },
  {
    "title": "Data Pipeline",
    "content": "Welcome to the Pipeline & Profiles section, where we will explore data management and analysis fundamentals. This section will delve into the concepts of data streams, data sources, and queries/LQL.\nData Sourcesrefers to the origin of the data and how you can leverage hundreds of different out-of-the-box integrations or APIs to aggregate your data from disparate channels.\nData Streamsoutline how to control and monitor data that is being streamed into the Lytics platform.\nQueries & LQLbreaks down our core query language and capabilities for transforming and unifying your data.\nUpdatedalmost 2 years ago",
    "url": "https://docs.lytics.com/docs/pipeline"
  },
  {
    "title": "Schema Management",
    "content": "Welcome to the Schema Management section, where we will explore how to define and manage data structures within the Lytics platform. This section will cover how to ensure data quality and consistency, including defining data types, creating custom fields, and enforcing validation rules. Whether you are a data analyst, developer, or system administrator, this section will provide you with the essential knowledge needed to understand schema management within the context of the Lytics platform.\nUpdatedalmost 2 years ago",
    "url": "https://docs.lytics.com/docs/schema-management"
  },
  {
    "title": "Merge Statistics",
    "content": "When data from multiple sources are combined into a single user profile, it is essential to ensure that the resulting data is accurate and consistent. Merge statistics in Lytics provide a way to monitor and optimize the merging process, ensuring that the data is adequately combined and reflects the most up-to-date and accurate information.\nIn the example below, you can see how merge stats can be used to uncover potential areas of issue. Out of the four available identifiers, user_id, is not responsible for any merges. This could be due to several reasons, such as no data populating that field, the relationship being defined inaccurately, etc.\nUpdatedalmost 2 years ago",
    "url": "https://docs.lytics.com/docs/identity"
  },
  {
    "title": "What is Cloud Connect?",
    "content": "## Introduction\nCloud Connect allows you to run complex SQL queries directly against your data warehouse and translate the resulting records into profile attributes and audiences.\n\n## Cloud Connect in Action\n\n## 📘Cloud Connect in Action\nCloud Connect in Action\nCheck out thesolution architecture developedwith Google which leverages BigQuery and Analytics Hub in addition to Cloud Connect to create a rich pattern for secure data collaboration and activation.\n\n## Getting Started\n\n## Accessing Cloud Connect\nCloud Connect is available to all Lytics customers. If you don't currently have access via the product switcher at the top of the primary navigation, contact support or your account management team.\n\n## Common Use-cases\nCloud Connect unlocks many use cases enabling marketers to segment their customers based on any attributes stored in their database. A few examples include:\n- Time Window: All users who did not log in last month.\n- Joins (B2B): All users associated with accounts without feature \"x.\"\n- Lifetime Value (LTV) or Rollup: All users with a premium subscription have purchased at least two products.\n\n## 📘Need a warehouse?\nNeed a warehouse?\nDon't currently have access to a data warehouse? Lytics has you covered with Lytics Warehouse. We provide a simple data warehouse on top of Google BigQuery to all of our customers as part of Conductor. Simply reach out to account manager or support for access and information.\n\n## How it Works\nCloud Connect augments the rest of the Lytics CDP suite by providing a secure and flexible entry point into your data warehouse. Users can quickly write a standard SQL query to perform a number of complex data manipulations or aggregations and stream the results directly to materialized user profiles. From there, generate insight-heavy reports, enrich targeted segments, and activate across hundreds of marketing channels in just a few clicks.\nBelow you'll find an overview of the general architecture, which can be summarized into these key value drivers:\n- Direct access to existing customer data in your warehouse.\n- No need to rip and replace or replicate consumer data in order to activate.\n- Leverage standard SQL to extract only what is relevant to your business goals.\n- Maintain your warehouse as the \"source of truth.\"\n- Requires very little to implement and begin generating ROI.\nUpdatedover 1 year ago",
    "url": "https://docs.lytics.com/docs/cloud-connect-intro"
  },
  {
    "title": "Connecting Warehouses",
    "content": "## Access\nCloud Connect tabs are found underData Pipeline>Cloud Connect. Connections configure the access to your data warehouses, and Data Models configure the SQL queries that are run to connect audience membership and profile attributes.\n\n## Creating a Connection\nClick+ Create New Connectionfrom the Connections Dashboard at the top right and complete the following steps.\n- Choose the provider.\n- Choose the Connection type.\n- Select an existing Authorization or create a new one by following theAuthorization instructions.\n- Add a name (label), description, and complete the configuration options. These will vary slightly between providers.\n\n## Authorization & Security\nThe authorization selected for your Connection will control your Lytics account users' access to your data warehouse. You can control whether a user has read access to the entire dataset or individual tables, maintaining your security and governance practices within your data warehouse.\n\n## Supported Data Warehouses\nCloud Connect currently supports a number of popular data warehouses:\n- Amazon Redshift\n- Databricks\n- Google BigQuery\n- Microsoft Azure SQL Database\n- Snowflake\n\n## Managing Connections\nOnce you have created a Connection, you can access a summary page showing how data from your data warehouse is being leveraged in Lytics. At the top of the page, you’ll see the following information:\n- Provider: Data warehouse that you are connecting with Lytics.\n- Authorization: Name of the authorization, such as “Cloud Connect JWT.” Note: Lytics users can access any data tables that the Connection Authorization has read access to.\n- Type: Indicates the type based on your provider.\n- Created By: Lytics user who created the Connection.\n- Created On: Date the Connection was initially created.\n- Last Updated: Date the Connection was most recently edited.\nThe rest of the Summary tab shows how many active and inactive data models are built using this Connection as a data source and how many tables are accessible from this dataset. The Activity chart displays how many rows are being queried, which can have cost implications based on your data warehouse usage.\n\n## Explore\nThe Explore tab provides a simple Schema Explorer to validate that the data shown is as you would expect to see in your data warehouse. In the example below, we only connected an individual table, but here you will see as many tables as the authorization has read access to.\n\n## Details\nThe Details section displays all the information about setting up your Connection, including the authorization and configuration settings.\n\n## Logs\nThe Logs section records the history of events for this Connection, which are helpful to ensure your connection is working as expected. Below are the connection event types you may see.\nUpdated4 months ago",
    "url": "https://docs.lytics.com/docs/managing-cloud-connections"
  },
  {
    "title": "Data Models & Queries",
    "content": "## Cloud Connect Data Models\nA Data Model is used by Cloud Connect to link or \"connect\" a user's external data warehouse to Lytics profiles. Each Data Model represents a set of records defined by a SQL query. Each Data Model will also configure a join key which defines how the Data Model is joined to Lytics Profiles.\nOnce a Connection to your data warehouse has been created, Data Models can be created via theData Modelstab within the navigation bar:\n\n## Creating a Data Model\nClick+ Create Newfrom the Data Models dashboard and complete the following steps.\n- Select the Connection.\nSelect the Connection.\n- Write the SQL query.Query Editor: Write and test standard SQL queries directly in Lytics. Alternatively, copy and paste queries you've tested in your BigQuery or Snowflake instance. When you clickTest Query, Lytics will return 10 sample records.\nWrite the SQL query.Query Editor: Write and test standard SQL queries directly in Lytics. Alternatively, copy and paste queries you've tested in your BigQuery or Snowflake instance. When you clickTest Query, Lytics will return 10 sample records.\n- Test the query and validate the results.\nTest the query and validate the results.\n- Configure the Data Model.Name: Data Model nameDescription: The Description of the Data Model.Slug: The Data Model name that will be used in the membership and activation fields in the audience builder. It is important that the name chosen here makes sense for those building audiences in the tool. If no slug is selected, it will auto-populate using the model name.Primary Key: Select the data warehouse ID that will be used to match against profiles in Lytics.External Lytics Key: Select a Lytics user profile field that is a unique identifier to map to an identifier in your incoming data source.Activated Fields:Select the fields you want to bring into Lytics profiles for activation. Note that each data model can only include 25 columns as activated fields.Sync Frequency: Select a time interval to run the query on - this is also the frequency that your Lytics profiles will be updated. The beta options are currently every 1 hour to every 3 weeks.Create new Lytics profile: Check this box if you want to create new profiles in Lytics if a profile with a matching ID does not already exist in Lytics. If you do not select this check box, only users with matching IDs to the Data Model IDs will be updated.\n- Activate the Model. Until the Data Model is activated, its SQL query will not be run against your data warehouse and Lytics profiles will not be updated with the selected fields.\n\n## 📘\nWhen building multiple Cloud Connect Data Models with the same primary key, you must select the same External Lytics Key mapping. Selecting a different Lytics key will result in an error when you try to save the new Data Model.\n\n## Example Use Case\nConsider this scenario to demonstrate why you'd want to create a Cloud Connect Data Model driven audience instead of a standard Lytics audience. Your company sells e-bikes and wants to run a holiday campaign that sends a promotion to any customer who purchased an e-bike in November or December last year. Perhaps you also want to refine your audience to those who are interested in particular bike brands. All of this purchase and product data already exists in your Google BigQuery instance (as shown below).\nInstead of directly importing all that purchase history data into Lytics, you can write a SQL query to find which customers meet this audience criteria. By copying this query directly into the Lytics Model Builder (as shown in the generate a query screenshot above), you'll create a new audience in Lytics that will be updated on the frequency interval you decide.\nOnce the Data Model is activated, profiles will be updated with a membership field that can be used to create an audience. Activated fields can be added to the Data Model that can then be used for more dynamic audiences.\n\n## SQL Translator\nIf you would like to skip having to write a SQL query, simply describe the Data Model of what you wish to fetch and using GenAI, Lytics will translate the description to a SQL query for you. Lytics makes queries to your database to ensure that the data is up to date and accurate when creating the query.\nUpdated2 months ago",
    "url": "https://docs.lytics.com/docs/creating-cloud-connect-audiences"
  },
  {
    "title": "User Profiles",
    "content": "## Introduction\nUser profiles provide relevant insights about individual customers in relation to your entire customer base. Referencing a user profile helps answer questions about who your customers are and how they are engaging with your brand.\nInitially, the user profile offers a way to test your Lytics implementation and validate the outcomes of your marketing tactics. For example, you can check if campaigns are working as expected by using a “test” persona and seeing how the user profile data gets updated.\nAs you get deeper into building campaigns, the user profile provides insight into how your marketing influences user behaviors. For example, if you run a mobile campaign, you can drill down to see if customers are engaging on mobile devices, what days and times they are most active, and what types of content they are affinity for. User profiles are updated in real-time, but there can be a delay while the data is being processed and scores are being calculated for behavior and content affinity.\nTo provide quick access to customer data, the user profile is divided into three tabs:Intelligence,Audiences, andDetails.\n\n## Anatomy of a User Profile\n\n## Intelligence\nThe intelligence tab gives a snapshot of key information about an individual user. At the top, a bar is displayed to help you quickly understand user engagement across all channels:Likelihood to re-engage,Current engagement level, andFrequency of user interactions.\nEach of these boxes summarizes the data science-powered behavioral scores into practical terms. The individual behavior scores and the user’s content affinity are displayed below. This rich data based on a user’s actual behavior is available thanks to the predictive analytics built into Lytics.\n\n## Recent activity by channel\nThis module gives an overview of which channels (email, web, mobile, etc.) an individual user has been active in. When appropriately mapped, it will also provide information on when users were active on each channel (within the last day or within the last 30 days).\nNOTE: If this module is empty, please see below for details on how to configure the user fields. As with all data mapping exercises, it is best to include your Customer Success representatives for optimal results.\n\n## How the recent activity by channel is managed\nIf you are customizing LQL or handling custom streams, it is important to understand how this module should be configured. For all our built-in integrations, Lytics includes this data mapping by default.\nAt its core, the \"Recent activity by channel\" module is built from a single user field. This field will not exist in legacy accounts and must be added to the existing LQL manually. For all new accounts that get the latest default LQL files, the baseline should be included.\nIn order to handle either custom data mapping for an account or backfill an old account, the user fieldlast_channel_activitiesmust be defined in a streams LQL file. This field is defined as amap[string]timeand should not be altered.\n\n```\nlast_channel_activities\n```\n\n```\nmap[string]time\n```\nIn each stream you'll simply map a string, such as \"web\" or \"email\" to a timestamp such asepochms()in order to update the field. A more lengthy example for an email LQL might look something like:\n\n```\nepochms()\n```\n\n```\n-- Profile Support\nmap(\"email\", epochms())    AS last_channel_activities    IF eq(tolower(action), \"open\") OR eq(tolower(action), \"click\")    SHORTDESC \"Last Activity By Channel\"    KIND map[string]time\n```\n\n```\n-- Profile Support\nmap(\"email\", epochms())    AS last_channel_activities    IF eq(tolower(action), \"open\") OR eq(tolower(action), \"click\")    SHORTDESC \"Last Activity By Channel\"    KIND map[string]time\n```\nThe example above is for when you only want to map the activity event in the case of a click or open. This definition will vary from stream to stream.\nWhen it comes to which keys to use, we recommend following these standards for common channels:\n- email\n- ad\n- web\n- mobile\n- support\n\n## Unique identifiers\nHighlights the identifiers that have been used to materialize this particular user's profile.\n\n## Event chart\nThe event chart shows a user’s activity by hour and day of the week. The top right of the chart highlights when a user is most active, for example Tuesdays at 10am.\n\n## Audience Membership\nThis tab displays a list of all the current Audiences a user belongs to and the total size of each audience. Audiences include factual information such as “Has Email Address” and “Known Location” along with Lytics score-driven characteristics such as “Deeply Engaged” or “Binge User”.\n\n## Profile Details\nThe details tab gives an under-the-hood display of the exact user fields contributing to a user’s behavioral data and their audiences. Unique identifiers are shown first, which are essential for enabling cross-channel mapping. For all user fields, the associated stream and value is provided.\n\n## Profile Picture\nSome profiles may include a profile picture when viewed in the user interface. This image comes fromGravatar. If the profile in question has an email address, Lytics converts it to an MD5 hash. That hash is then used to look up the corresponding image on Gravatar. This image is only displayed in the Lytics UI and is not part of the profile itself.\nUpdatedalmost 2 years ago",
    "url": "https://docs.lytics.com/docs/understanding-user-profiles"
  },
  {
    "title": "Audiences",
    "content": "## Introduction\nAudiences are central to creating personalized marketing using Lytics. It is how groups of users get targeted and defines how cross-channel user data is used in campaigns. Lytics offers audiences as a tool that operates on user fields as well as other audiences. This provides the ability to craft audiences that target one user, every user, or any number in between.\nLytics audiences are automatically kept up to date. As time passes, an audience that once targeted 500 users may grow to target 10,000. This is great if your audience is targeting engaged users who have shown interest in your upcoming product, but not so great if your audience targets users with outstanding support tickets. Lytics makes it easy to find these insights so your campaign strategies can be adjusted accordingly.\nAudiences can be used in Lytics Experiences, third-party ad campaigns, and tools like Google BigQuery for advanced reporting. When all of that isn’t enough, the Lytics APIs provide deep integrations with the Lytics platform.\n\n## 📘\nAccess the audience builder from Lytics navigation menu by expanding theAudiencestab and clickingAudiences. Once on the Audiences page, click on the+ Create New Audiencebutton.\n\n## Creating Audiences\nBuilding new audiences allows you to target specific groups of your users. Why send the same email to your entire audience? Instead, send emails to distinct audiences with content that you know those users enjoy. Lytics gives you the ability to create audiences based on cross channel user data, behaviors and interests.\nAudiences can be built using existing audiences, user content affinity, your personalization campaigns, or by custom rules utilizing any user fields in your Lytics account. Create rulesets by combining multiple audiences and boolean logic to target users with as much or as little granularity as you require.\nLytics updates your audiences automatically. Once an audience is built, users will join or leave whenever they match (or fail to match) the rules you have set. Export your audiences, often in real-time, to your integrated marketing tools giving you the power of Lytics however you engage with your users.\n\n## 📘\nAccess the audience builder from Lytics navigation menu by expanding theAudiencestab and clickingAudiences. Once on the Audiences page, click on the+ Create New Audiencebutton.\n\n## Building Audiences: Existing Audiences\nTheExisting Audiencestab in the audience builder contains a list of all existing audiences and their size categorized by audience type such as characteristic. Characteristics are pre-built audiences pertaining to single user attributes such as location or behavior.\nKeep in mind that the audience sizes you see in this list arenotreal-time. They are updated every few hours for performance reasons. When creating or editing an audience, however, you will always see real-time numbers so that you can make precise decisions based on accurate data.\nYou can use theFilter by Audience Typedrop-down to filter the list or use theSearchbox to quickly find an audience by name.\nSelect an audience or characteristic to add it to the definition of the audience you are building or editing.\n\n## Building Audiences: Content Affinity\nTheContent Affinitytab in the audience builder is used to add Affinity-based rules to your audience. SinceAffinitiesare agroup of related Topics, this allows you to effectively target users interested in several subjects or products.\nIn the example above, we created a \"Lavender\" Affinity for an online beauty store, which includes 6 Topics such as \"lavender\", \"lavender lotion\", and \"lavender luxury.\" Instead of creating an audience with 6 rules (one per Topic), we just select our Lavender Affinity that contains those 6 Topics.\nOnce you choose an Affinity for your audience, you will be able to select the range of affinity values. The histogram displays the distribution of user interest for the selected Affinity and is helpful to build an audience that has the desired size. By default, users withAny Affinityare selected. You can choose a built-in range by clicking any of theAffinitybuttons or, to set a custom range, use the slider to refine the range of users to target. As you change the range, the total number of users that fit the range is shown in the right column.\nAs soon as you create an Affinity, Lytics start scoring users against it as they interact with your content or products. For active users, you can expect this number to start populating within a few days. For inactive users, it can take up to 2 weeks for them to be scored against an Affinity. So it's recommended that you create Affinities in advance of the audience needed for an Affinity-based campaign.\n\n## Topic-Based Audiences\nUnder theCustom Ruletab in the Audience Builder, you can find the existing audiences based on Topics in your content taxonomy. If you want to create new audiences based on a single Topic, you can do so as follows:\n- Search for \"Topics\" in the Custom Rule tab of the Audience Builder\n- Select the Topic of interest.\n- Set the threshold according to the desired users' level of interest in that Topic.\nOnce you hit \"Add Condition\", the custom rule for a Topic will look like this:\nAlthough Topics are still supported in the Audience Builder, we strongly recommend you use Affinities to build audiences for a more efficient workflow and more effective targeting.\n\n## Inferred Content Affinity\nSome users may find a field namedInferred Content Affinitywhen trying to build affinity or topic based audiences. This field contains topics that a user could be interested in even though they may not have interacted with the topics directly. To learn more about how these inferrences are made, you can read about ourcontent taxonomy process. Note that topic affinity already includes this information, but this field contains only inferred affinity. We would also recommend not using this field to build audiences as it is not a wholistic view of a user's affinity.\n\n```\nInferred Content Affinity\n```\n\n## Building Audiences: Custom Rules\nTheCustom Rulestab in the audience builder is used to add any rule based on auser fieldto the audience being built or edited.\nCustom rules allow for ultimate access of all data that is aggregated in user fields. Custom rules are simple statements that can be combined to create very precise audiences. Using them correctly requires a thorough understanding of the data being used, but there is no replacement for this level of segmentation.\n\n## 🚧Audiences Field Value Limits\nAudiences Field Value Limits\nAudiences can have a maximum of 1,000 field values. \"Values\" in this context apply to a single evaluation against a user field.\nWhen exceeded, the error message \"Audience too large! Remove values to save this audience\" will be displayed. For example, the following scenarios would trigger the alert:\n- An audience with a single rule that supports multiple values ( e.g. contains one of) with 1001+ values.\n- An audience with 1001+ user field rules each with a single evaluation (e.g. exists).\n- Any variation in between such as two rules each containing over 500 evaluations, etc.\nThe user field list displays all the fields in your account. TheSourcedrop-down can be used to filter on the data stream the user field came from. TheIncludesdrop-down can be used to filter user fields on the percentage of users that have a field. Use theSearchinput to search for a user field by name.\nGenerally, to add a Custom Rule to an audience definition:\n- Choose a User Field\n- Choose an operator (e.g., text contains, value is less than)\n- Choose a value\nThere are variations to this general procedure based on thetypeof the user field and the operator chosen.\n\n## User Field Types\nHow you work with user fields in the Custom Rules tab will depend on way the field is mapped in on the user profile.\nNumeric user fields are most commonly used for data that is counted. For instance, the number of times a visitor has been to a website or the number of times a subscriber has opened an email. Exact values can be matched, but more commonly, inequalities are expressed.\nExamples:\n- Total Number of Visits must equal 5:Any user who has visited 4 times, 6 times, or any number of times other than 5 will not be matched by this rule.\n- Total Number of Visits must be less than 3:Any user who has visited 0, 1, or 2 times will be matched by this rule.\nText User fields are commonly used for words and miscellaneous information. For instance, a user’s first name. Since there is no mathematical relationship between two text values, the operations used are generally exact match or partial match.\nThere are 5 operator options when making audiences with text user fields:\n- Equal: The value for the field you want the audience to have. Format and character spacing for the value must match exactly what is in the data stream. You can select the value by interacting with the visualization or be promoted with available values by typing into the search bar.\n- Contain: The text entered (case sensitive and exact order) appears within a value for the field.\n- Be Like: Use the wildcard character*along with text to decide the parts of values you want to match. E.g.,testwill only match on the exact string test, whiletest*will match strings starting with test, such as \"testing\", and*test*will match any string that has test in it, such as \"my test case\".\n\n```\n*\n```\n\n```\ntest\n```\n\n```\ntest*\n```\n\n```\n*test*\n```\n- Equal one of: Add each, exact value you want included individually. A new search bar will appear after each selection. You can remove values from the list using the “x” to the left of the value. The logic for each of these rules follows the logic from “Equal”.\n- Exist: Excludes everyone that does not have a value for the field.\nExamples\n- First Name must equal Ash:Only users named Ash will be matched.\n- First name must contain Ash:Any user named Ash will be matched. Additionally, anyone named Ashley, Ashton, or any other name that has the letters \"Ash\" next to each other will be matched. Dash or Natasha will NOT be matched - as these do not have an “A.” To make an audience that includes these, create a second rule set for “First name must contain ash.”\nDate user fields are commonly used for any data that represents a point in time. For instance, the last time a user visited a website. Most commonly, a date is chosen to divide the people who fall before or after that date. You will need to select both your starting point and a directionin timefor your custom rule.\nYour starting point could be a fixed point in time (useful for milestone events, like product launches) or a relative point in time (useful for scheduled follow ups).\nSince each rule only handles going forward or backward from a single point in time, you may need to create two rules that work together to bound a range of time. One rule will capture all dates after the first point in time, and a second rule will capture all dates before a later point in time.\nSome date fields have a natural boundary, such as Last Visits, which will never include a date in the future. If you want all Last Visits from a point in time up until now, you would only need to create one rule.\nExamples\n- Last Visit must be Before June 22, 2016:Created by selectingSpecific Dateand the directionBefore. This rule includes only users who have not visited since the 22nd of June.\n- Last Visit must be After 3 days in the past:Created by selectingRelative Date, entering 3 daysIn the pastand selecting the directionAfter. This rule includes only users who have visited in the last three days.\n- Subscription End Date must be within the next 30 days:Created by building two rules: one to set the start date to always be the current date and the other to set the end date to 30 days in the future relative to the current date.Create the first rule by selectingRelative Date,After, entering0 Days, selectingIn the past, and clickingAdd Condition.Create the second rule by selectingRelative Date,Before,30 Days,In the future, and clickingAdd Condition.This audience will now include all users who have a subscription ending in the next 30 days beginning with the current date.\n- Create the first rule by selectingRelative Date,After, entering0 Days, selectingIn the past, and clickingAdd Condition.\n- Create the second rule by selectingRelative Date,Before,30 Days,In the future, and clickingAdd Condition.\n- This audience will now include all users who have a subscription ending in the next 30 days beginning with the current date.\nSet user fields are commonly used for collecting related data over time. For instance, all the URLs a user has visited. These fields are generally used much like text user fields, even though the data is structured differently.\nExamples\n- All URL Paths Ever must contain one of/blog,/products, or/about:Any user who has visited any one of these three paths will be matched.\n\n```\n/blog\n```\n\n```\n/products\n```\n\n```\n/about\n```\n- Followed Sports must contain Baseball:Any user who follows Baseball will be matched. This is true whether they only follow Baseball or follow Baseball in addition to Football, Hockey, and Bowling.\nMap user fields are used to add hierarchy to a dynamic domain of data. For instance,Events By Deviceis a count of all events, but grouped by each device. So instead of building a rule by only specifying the count, the rule is built by first specifying the device, then the count. The device could be thought of as an additional, dynamic user field that is nested under the map user field.\n- Selecting a KeyWhen using a map user field, the first step is selecting the dynamic user field to build a rule with, called akey. Using theURLs Visitedexample, thekeyscould include any numeric value. Since thesekeysare dynamic,  counts will be updated automatically.\nSelecting a Key\n- When using a map user field, the first step is selecting the dynamic user field to build a rule with, called akey. Using theURLs Visitedexample, thekeyscould include any numeric value. Since thesekeysare dynamic,  counts will be updated automatically.\n- Building the ConditionOnce a key is selected a condition is built. Thetypeof the nested user field is called thevalue type. In the case ofURLs Visited, thevalue typeis numeric. When building audiences with nested fields, the visualization chart will not display for mapped fields to minimize page load times.\nBuilding the Condition\n- Once a key is selected a condition is built. Thetypeof the nested user field is called thevalue type. In the case ofURLs Visited, thevalue typeis numeric. When building audiences with nested fields, the visualization chart will not display for mapped fields to minimize page load times.\nExamples\n- Events By Device (Desktop) must be greater than 5:Only users who have visited the website more than 5 times on a desktop will be matched. If a user has visited more than 5 times on the mobile web, they will not be matched.\n- Signup Date for Event (Personalization Webinar) must be within the last 7 days:Only the users who signed up for the Personalization Webinar in the last week will be matched. Users who signed up more than 7 days ago will not be matched. Users who signed up for a different event in the last 7 days will also not be matched.\n\n## Out of the Box Custom Rules\nSome user fields are mapped by default and populated through the use of the Lytics Javascript tag and Experiences. These out of the box fields can be incredibly useful when building audiences using Custom Rules.\nAssuming that you have not made changes to the 'default' webLQLfile that is automatically created when theLytics Javascript Tagis installed, the following custom rules are available to you for use when building audiences.\n\n```\nvisit_city\n```\n\n```\nvisit_country\n```\n\n```\nvisit_region\n```\nThere are a variety of use cases that involve targeting users who have engaged with previous marketing campaigns. For example, if a user converted on anIterable Experienceemail, and you want to follow up with an SMS message. The steps below will walk you through how to create an audience to target users who were reached by or clicked on anExperience.\n- Navigate toExperiencesand search for the one you would like to use.\n- You will need to get an ID for the Experience, which differs depending on the Experience type:ForLytics Web Personalization Experiences: Look up the URL for this Experience and locate the long string of numbers of letters as highlighted below. Save this to your clipboard.Forall other Experience types: open developer tools and navigate to the “Network” tab. Refresh the page and filter the requests by “experience”. Find the response that looks similar to the example below, and save theexternal_idvalue (nested undervehicle) to your clipboard.Note:You can also use the Experience API to fetch the current Experience by ID to get the full payload, including the Experience'sexternal_id.\n- ForLytics Web Personalization Experiences: Look up the URL for this Experience and locate the long string of numbers of letters as highlighted below. Save this to your clipboard.\n- Forall other Experience types: open developer tools and navigate to the “Network” tab. Refresh the page and filter the requests by “experience”. Find the response that looks similar to the example below, and save theexternal_idvalue (nested undervehicle) to your clipboard.Note:You can also use the Experience API to fetch the current Experience by ID to get the full payload, including the Experience'sexternal_id.\n\n```\nexternal_id\n```\n\n```\nvehicle\n```\n\n```\nexternal_id\n```\n- In your Lytics account, navigate toAudiences>Create New Audience.\n- In the audience builder, selectCustom Ruleand search for the provider of the Experience you would like to segment on.\n- After you enter a provider, you should see a field for conversions and reach on those Experience types. Select the action you wish to segment off of.\n- Copy and paste the ID you copied from step 2 into the text box.\n- ChooseExistas your operator and add the condition to your audience.\n- SelectAdd Condition. You now have an audience based on past interactions with an Experience. You can save the audience as is, or continue to add rules based on your use case.\n\n## Building Audiences: Multiple Rules and Rule Sets\nAll audience definitions are comprised of rules based onexisting audiences,content affinity,campaigns, andcustom rules. You may have noticed that after you add your first rule in the audience builder you have the option toAdd New RuleorAdd New Rule Set. Adding new rules and rulesets, and setting the conditions for their interaction, gives you the ability to refine which users your audiences target.\n\n## Working With Multiple Rules\nThis audience has a single rule: included all users with the characteristicBehavior: Perusers. This will select all users with anintensity scoreof 20 or less but with afrequency scoreof 20 or greater. These are users who interact often but not on a deep level. You can refine this rule further by clickingAdd New Rule.\nThis audience now also includes a rule for users who have a low content affinity forTechnologycontent. Now that it has been added, there are three numbers of interest. The first number, 87,650, is the number of users with the characteristicBehavior: Perusers. The second number, 466,730, is the number of users who have low affinity forTechnologycontent. The third number, 11,514, are the users who meetbothof these conditions.\nClicking theAnd/Ortoggle, will switch the way the two rules intereact. The audience now includes all 542,921 users whoeitherhave the characteristicBehavior: Perusersor have low afffinity forTechnologycontent.\n\n## Excluding Rules\nIn addition to theAnd/Ortoggle, there is theIncluded/Excludedtoggle. This toggleinvertsa condition.\nThis audience contains a rule that targets the 159,084 users with the characteristicBrowser / OS: Mobileor users who have used a mobile devices.\nClicking theInclude/Excludetoggle the audience will now target the 705,166 users whodo nothave the characteristicBrowser / OS: Mobile.\nThe sum of the two numbers will be the total audience size that meets those rule(s).\nThis is especially apparent when using a rule such asCreated Timestamp Exists. Every user in Lytics will have a timestamp of when they were created. Therefore, the number of users whodo notmeet the condition of having a created timestamp will always be 0.\n\n## Working With Rule Sets\nWhen building elaborate audiences, having a single set of rules that are evaluated using either anANDor anORis not enough. A ruleset is a set of rules that itself can be used as a rule for an even larger set of rules that is again evaluated using anANDor anOR.\nThis audience has two rulesets. The first ruleset has one rule: all users who have the characteristicEmail Capture Status: Known Email. The second ruleset has two rules: all users have some affinity forMarketingORAdvertisingcontent. Combining these two rulesets with theANDoperator produces an audience that targets users with an email address that have some interest in either marketing or advertising. This audience could be used to email a special newsletter or promotion about a product or trending topic that is related to marketing or advertising.\n\n## Excluding Rule Sets\nRulesets, just like rules, can be excluded. Clicking theInclude/Excludetoogle on the second ruleset will result in the audience targeting all users with an email address who do not have some interest in either marketing or advertising. It could be used to send a different email to the remainder of your users with email addresses.\n\n## Building Audiences: Configuration Options\nConfigure your Lytics audiences with the following options to execute your use cases.\n\n## Enabling API Access\nBy default, newly created Lytics audiences are not enabled for API access and thus will not be available to public APIs. Enabling API access is necessary when integrating with other client-side tags/ pixels,Pathfora, or the Lyticspersonalization APIendpoints.\nSelect theAPI Accessiblecheckbox to enable access.\n\n## Generate Insights\nLytics Insightsprovide visibility into the performance of your audiences and campaigns as users interact with your brand. Insights are generated out-of-the-box for Lytics Behavioral and Engagement audiences. You can also request up to10 custom audiencesto be prioritized as candidates for generating Insights.\nWhen creating a new audience or editing an existing one, select theGenerate Insightscheckbox to make that audience a candidate for Insights (shown in the screenshot above).\nLytics prioritizes Insights based on the statistical significance of the data and the most frequently used audiences for your account. Therefore, even if you select the \"Generate Insights\" option for a particular audience, it is not guaranteed to show up in your Insights drawer.\n\n## Managing Audiences\nManaging audiences becomes important as an account develops and your user base grows. Audiences are critical to both targeted campaigns as well as discovering insights about your users.\nTheAudiencessection of Lytics houses all of your account’s audiences. You can view, create, and manage audiences from this section.\nAudiences are listed alphabetically by default. Click any column header to change the sort property. Common sort options areLast ModifiedandSize(the number of users in the audience).\n\n## Naming Your Audiences\nFor better targeting, Lytics encourages the creation of many audiences. They’re easy and free to make. When working with a large library of audiences, naming conventions become important.\nName your audiences by purpose and include any categorization in the name. Giving them a common prefix (e.g., Holiday Promo: Tech lovers, Holiday Promo: Loyal Shoppers) will help you to keep everything related next to each other in the user interface.\nAudiences appear throughout the Lytics platform. Make sure your naming convention works in any context to avoid confusion.\n\n## Finding Audiences\nThe easiest way to find an audience is to use theSearchbox. As you enter your search term the audience list will display any matching audiences.\n\n## 📘\nFuzzy matching is used to search for audiences so the results will not be an exact match to the search term.\n\n## Editing Audiences\nOccasionally you will want to return to previously created audiences and update the logic used to create the segment.\n- Find the audienceyou would like to edit\n- Click on the audience to navigate to the overview of the audience\n- Click theEditbutton to enter the audience builder\n- Make your desired changes within the audience builder\n- ClickSave\n\n## 🚧\nWhen editing audiences that are in an active triggered workflow, it is recommended that you reconfigure the job after the audience changes have been made.\n\n## Duplicating Audiences\n- Find the audienceyou would like to duplicate\n- Click on the audience to navigate to the overview of the audience\n- Click the...button to enter the audience builder. The audience builder will be pre-populated with all of the criteria of the audience you duplicated.\n- Make any desired changes\n- ClickSave\n\n## 🚧\nAudiences created by duplication will retain the name and slug of the duplicated audience, but with have \"duplicate\" appended at the end. It is recommended that you update both the name and manually input a unique slug name for clarity sake.\n\n## Deleting Audiences\nDeleting audiences is an integral part to keeping a tidy workspace in Lytics. Audiences can be deleted in one of two ways: individually or in batch.\nNote: Deleting an audience does not delete the users associated with that audience.\n\n## Deleting an Individual Audience\n- From theBrowse Audienceslist, select the name of the audience you wish to delete.\n- From the options menu, selectDelete.\n- ClickDelete.\n- ClickAcceptto confirm.\n\n## Deleting Multiple Audiences\n- From theBrowse Audienceslist, select the checkboxes of the audiences you wish to delete.NOTE:Audience selection persists when changing pages allowing you to select audiences from multiple pages.\n- ClickDelete Selected Audiences.\n- ClickDelete.NOTE:Lytics will check to see if the audiences you selected are safe to delete. Audiences are considered safe if they are not used in an ongoing export, campaign, or another audience's definition. You will be prompted to delete dependant audiences, clickYesto delete the selected audience and any dependants listed orSkipcancel deletion of the selected audience.\n- ClickAcceptto confirm.\n\n## Maintaining Audiences\n\n## 📘\nFrom theAudiencespage, click any audience in the list to view all of its details.\nAn audience's landing page contains a lot of valuable information about your users and the audience itself. At the top of the audience page, you will find the following information...\n- Audience name\n- ID\n- Slug\n- Created by\n- Created on date\n- Last updated date\n- API access configuration\nBelow this information you will find multiple tabs where you can access additional information about the audience.\n\n## Audience Summary\nThe audience summary page is designed to provide insights into the current state of an audience as well as how the audience has changed over time. When first navigating to an audience landing page, this tab will be selected by default.\nThe Summary tab includes the following sections:\n- General MetricsThe total number of users in this audienceThe total percentage of this audience as compared to the total number of profiles in your accountThe percentage change in audience size over the last 7 and last 30 days\n- The total number of users in this audience\n- The total percentage of this audience as compared to the total number of profiles in your account\n- The percentage change in audience size over the last 7 and last 30 days\n- Activity trend (graph of audience size over the defined date range)\n\n## Activity Graph\nAfter creating a new audience, the audience size graph will begin to populate within a day. Depending on the date range you specify, the activity graph can be viewed using following intervals:\n- Hourly\n- Daily\n- Weekly\n- Monthly\nAudience Size Trends\n\n## 📘\nThe statistics for audience size start from the creation date of the audience.\nKeep in mind that audiences are real-time. This makes them quite different from the user lists in other marketing tools which are frozen in time and only change when you update the list. Audiences are filters applied to the total audience and will change whenever a user's behavior changes in a way that will add or remove them from the audience definition. In this way, tracking audience size over time is a powerful reporting tool.\nFor example, you create an audience that contains users who have visited the international news section of your website. Upon creation the audience contains 120,000 users. You then run a marketing campaign promoting your international news section. After one week, the audience has grown from 120,000 to 400,000 users with most of the growth occurring in the 24 hours after the campaign was launched. This is clear evidence that the campaign was effective, and most effective in the first 24 hours, at driving users to your international news section.s\n\n## Audience Details\nSelect theDetailstab to view the following sections:\n- Exports: This section outlines what exports (if any) are using this audience\n- Recent Users: This section allows you to view a sample of users in this audience who have been active recently (by clicking theViewbutton)\n\n## Audience Characteristics\nSelect theCharacteristicstab to view the characteristics of users in this audience. Characteristics include:\n- Behavior\n- Web Activity\n- Content Affinity\n- Campaign Referral Interactions\n\n## Audience Logs\nSelect theLogstab to view recent events relating to this audience. Activity such as creation, updating and syncing can all be found here.\n\n## Activating Audiences\n\n## Activating Audiences in Experiences\nCreating a Lytics Experience is one of the easiest and most common ways to activate Lytics Audiences. Learn more aboutLytics Experiencesto find out how you can engage your audiences on site.\n\n## Accessing Audiences Using the Public Entity API\nThe Lytics Experience Editor is a great way to get started with website personalization, but through the use of the Lytics API, there is much more that can be done.\nThe Lytics Experience editor is powered by the Pathfora SDK which is in turn powered by the Lytics Entity API. The Lytics Entity API is how to find out what audiences the current user belongs to as well as what traits the user has. Using the Lytics Entity API it's possible to create completely custom personalized experiences on your site.\n\n## 📘\nPersonalizing a site using the Public Entity API requires making code changes to the host website.\nTo read more about the Entity API,check out the API documentation.\n\n## Exporting Audiences to Other Tools\nA core benefit of Lytics is exporting your smart audiences to the other tools in your marketing tech stack. That way, the campaigns run on your channels are enriched with thebehavioral dataandcontent affinitiespowered by data science on Lytics.\nFrom the audience overview page, click theExportbutton to create a new export job . TheExportmenu lists built in exports such asEmail CSVand any out of the box Integrations. Specific instructions for exporting can be found in the Integrations section (under the desired tool) of our documentation.\nUpdated5 months ago",
    "url": "https://docs.lytics.com/docs/audiences"
  },
  {
    "title": "Reports",
    "content": "With  Lytics' Audience Reporting, you can quickly create powerful dashboards with your customer data. This documentation explores the capabilities of Lytics' reporting system and how it can be customized to meet your unique business needs. The following links provide technical details for creating custom reports and how they can be used to gain deeper insights into your customer data.\nWhat are Reports?\nComponents\nManaging Reports\nDashboard Report\nUpdatedover 1 year ago",
    "url": "https://docs.lytics.com/docs/getting-started-with-reports"
  },
  {
    "title": "Leveraging User Profiles",
    "content": "Welcome to the Leveraging User Profiles section, where we will explore how to use Lytics user profiles to gain a deeper understanding of your customers and deliver personalized experiences. This section will cover how to define and segment audiences, personalize experiences, and track user behavior using user profiles. Whether you are a marketer, developer, or data analyst, this section will provide you with the essential knowledge needed to leverage Lytics user profiles and gain insights into customer behaviors and preferences.\nUpdatedalmost 2 years ago",
    "url": "https://docs.lytics.com/docs/leveraging-user-profiles"
  },
  {
    "title": "Data Collection & Onboarding",
    "content": "Welcome to the Data Collection and Onboarding section, where we will explore the process of collecting and onboarding data into the Lytics platform. This section covers how to ensure data quality and accuracy, including how to integrate with various data sources and best practices for data management. Whether you are a developer, system administrator, or data analyst, this section will provide you with the essential knowledge needed to gain deeper insights into customer behavior and preferences within the Lytics platform.\nUpdatedalmost 2 years ago",
    "url": "https://docs.lytics.com/docs/data-collection-onboarding"
  },
  {
    "title": "Data Management",
    "content": "Welcome to the Data Management section, where we will explore the various tools and techniques available within the Lytics platform for managing and organizing your customer data. This section covers how to ensure data accuracy and completeness, including data validation, deduplication, and transformation. Whether you are a data analyst, developer, or system administrator, this section will provide you with the essential knowledge needed to manage your customer data and gain valuable insights into customer behavior and preferences.\nUpdatedalmost 2 years ago",
    "url": "https://docs.lytics.com/docs/data-management"
  },
  {
    "title": "Web",
    "content": "Welcome to the Lytics JavaScript SDK documentation, where we will explore the capabilities and features of the Lytics JavaScript SDK. This SDK enables website owners and developers to integrate Lytics' powerful customer data platform directly into their websites and web applications.\nWith Lytics JavaScript SDK, you can easily collect data from website visitors and enrich their profiles with valuable insights, including behavior, preferences, and interests. By leveraging the Lytics JavaScript SDK, you can better understand your customers and deliver personalized experiences that drive engagement, retention, and revenue.\nIn this documentation, we will cover how to install and configure the Lytics JavaScript SDK and how to use it to identify users, manage consent, track events, and personalize experiences. We will also examine integrating Lytics JavaScript SDK with other third-party analytics and marketing platforms to create a complete web data strategy.\nWhether you are a website owner, developer, or marketer, this documentation will provide you with the essential knowledge needed to leverage the Lytics JavaScript SDK to build better web experiences and gain deeper insights into your customers' behaviors and preferences.\nUpdatedalmost 2 years ago",
    "url": "https://docs.lytics.com/docs/sdks-web"
  },
  {
    "title": "Mobile",
    "content": "Welcome to the Lytics Mobile SDK documentation, where we will explore the native mobile SDKs for both Android and iOS platforms. In this section, we will delve into the capabilities and features of these SDKs, which enable app developers to integrate Lytics' powerful customer data platform directly into their mobile applications.\nLytics Mobile SDKs provide a simple way to collect data from mobile apps and enrich user profiles with valuable insights, including user behavior, preferences, and interests. By integrating Lytics Mobile SDKs into your mobile app, you can better understand your customers and deliver personalized experiences that drive engagement, retention, and revenue.\nIn this documentation, we will cover how to install and configure Lytics Mobile SDKs and use them to identify users, manage consent, track events, and personalize experiences.\nWhether you are a mobile app developer or a marketer, this documentation will provide you with the essential knowledge needed to leverage Lytics Mobile SDKs to build better mobile experiences and gain deeper insights into your customers' behaviors and preferences.\nUpdatedalmost 2 years ago",
    "url": "https://docs.lytics.com/docs/sdks-mobile"
  },
  {
    "title": "Chrome Extension",
    "content": "## Lytics Dev Tools Chrome Extension\n\n## Overview\nThe Lytics Dev Tools Chrome extension is a comprehensive tool designed to simplify validation, debugging, and exploration of Lytics' client-side capabilities as facilitated by our core and personalization SDKs. With this extension, users can easily:\n- Validate that Lytics is connected to your site.\n- Debug and validate that the data collected by Lytics, be it automatic or custom, is behaving as expected.\n- Explore the current visitor's full profile to validate:If the profile is available for personalization.The events collected are having the expected impact on attributes and segment membership.\n- If the profile is available for personalization.\n- The events collected are having the expected impact on attributes and segment membership.\n- Explore \"Experiences\" currently active on your site and could be surfaced to visitors.\n\n## Installation\n\n## Install Now\n- Install Extension:This extension is installed directly into your Chrome browser. To install, visit theprimary extension pageand follow the instructions.\nInstall Extension:This extension is installed directly into your Chrome browser. To install, visit theprimary extension pageand follow the instructions.\n- Pin Extension to Nav Bar:Once installed, we recommend pining the extension to your top bar for easy access.\nPin Extension to Nav Bar:Once installed, we recommend pining the extension to your top bar for easy access.\n\n## Getting Started\nOnce the extension is installed, you can visit any website where Lytics is or should be installed and begin debugging.\n- Enable the extension: To activate the Lytics Dev Tools extension, open the extension and toggle the slider at the top right of the extension to either \"Enable\" or \"Disable.\"\n- Verify Installation:The extension will verify that the Lytics tag has been installed successfully before further debugging. This is confirmed by the \"Lytics JavaScript SDK Installed\" alert displayed on the dashboard of the extension.\n- Navigation:Once enabled, you'll access three key sections: Debugger, Profile, and Personalization, each offering specific functionalities tailored to streamline your debugging and exploration process.\n\n## Debugger\nThe debugger section of the extension serves multiple purposes. Firstly, as we did previously, it allows you to validate installation, ensuring that the Lytics tag is successfully implemented. Additionally, it provides access to the full active configuration of the JavaScript SDK through the configuration tab. Moreover, it includes a live event debugger that monitors and displays comprehensive details of any calls made to the Lytics APIs in real time. This feature is particularly valuable for reviewing data sent viajstag.sendcalls, offering insights into the interaction between your website and Lytics APIs.\n\n```\njstag.send\n```\n\n## Profile\nIn the \"Profile\" section of the extension, users gain a live look at the current visitor's profile, providing valuable insights into their browsing behavior and demographic information. This section offers a snapshot of key details, such as the visitor's unique identifier and behavioral scores, allowing for a quick assessment of their engagement level. Additionally, users can access a detailed view of all information available to the browser, including demographic data, past interactions, and any custom attributes stored in the visitor's profile. This comprehensive overview enables users to tailor their strategies and personalize experiences based on individual visitors' specific characteristics and preferences.\n\n## Personalization\nIn the \"Personalization\" section of the extension, users gain access to a log of all active Lytics experiences and campaigns, along with their associated details. This feature proves invaluable when debugging the configuration of experiences or ensuring that overrides have produced the expected results. Users can easily track the performance and behavior of each personalized element on their website by providing a comprehensive overview of active campaigns and experiences, including their parameters and settings. This functionality streamlines debugging and empowers users to fine-tune their personalization strategies for optimal effectiveness.\nUpdatedabout 1 year ago",
    "url": "https://docs.lytics.com/docs/chrome-extension"
  },
  {
    "title": "Lytics Integration Options",
    "content": "## Lytics Integration Options\nIf you don’t see your ads or marketing tool in our integrations list we offer the following options to connect with other platforms. With our Integration Options we enable flexibility across the various channels where your data exists and tools to build customized integrations. Lytics Integration Options include:\n- Webhooks\n- Lytics File Service integrations for server-to-server file transfer\n- Javascript Tag\n- Mobile SDK\n- Data Warehouse Integrations\nRead on for details on each option. If you have questions about any of these options or would like to further explore an integration with a specific platform reach out to your Lytics contact.\n\n## Webhooks\nWebhooks offer one of the simplest and most flexible options for enabling applications to share data. They’re broadly used in the cloud computing world for integrations that can be stood up quickly with a minimal amount of code. The Lytics Webhook integration supports triggered delivery of audience membership (enters and exits) to a destination url where another application can pick it up. See ourWebhook documentationfor full details.\nInterested to understand how a Webhook integration might be applied? Look at thisMobile Messaging use casefor a simple Lytics Webhook integration to support one-to-one personalized messaging with Twilio.\n\n## Server-to-Server File Transfer\nServer-to-server file transfer is a very common mechanism for data sharing. Lytics File Service options enable Lytics to pull or push user data from an SFTP (secure file transfer protocol) using a CSV (comma-separated values) or JSON file. If you have another platform that also enables integrations via SFTP, this integration path helps to automate the process of passing data between your system and Lytics. Check out theLytics File Service documentationto learn about setting up the file transfer job.\nIn addition to SFTP, Amazon S3 is a very commonly used medium for server-to-server file transfer. Refer to ourAmazon S3 documentationfor data import and export options.\n\n## Javascript Layer/JS Tag\nThe Lytics JS Tag is the default option for client-side (website) data sharing with Lytics. The JS Tag supports the delivery of user behavior attributes from your website into Lytics and can also return back to the website user profile data such as audience members or content recommendations from Lytics for real time personalization. Refer to our JS Tag Documentation for full details.\n\n## Mobile SDK\nThe Lytics Mobile SDK facilitates in-app data sharing with iOS and Android. Similar to the JS Tag, the Mobile SDK supports user behavior-based data delivery to Lytics and profile data to the app for real-time personalization. See ourMobile SDK Documentationfor more details.\n\n## Using Your Data Warehouse\nIf you already use a data warehouse to manage your data this is a great option for data import and export with Lytics. Lytics integrates with\n- Google Big Query\n- Amazon Redshift\n- Microsoft Azure\n- Snowflake\n- Databricks\nEach of these providers offers options for importing data into databases which can then be imported into Lytics using Cloud Connect or our Data Import integrations. Lytics can also export data into each of these data warehouses.\nUpdated10 months ago",
    "url": "https://docs.lytics.com/docs/lytics-integration-options"
  },
  {
    "title": "Acoustic",
    "content": "## Overview\nAcoustic(previously known as Silverpop) is a marketing platform that enables email, SMS, and mobile campaigns, among other marketing analytics and automation solutions.\nIntegrating Lytics with Acoustic allows you to import users and their activity data to build behavioral audiences and gain Insights in Lytics. You can then export Lytics audiences back to Acoustic to refine your targeting and deliver personalized messaging.\n\n## Authorization\nIf you have not done so already, you will need to set up an Acoustic account before you begin the process described below. Your Acoustic account user must have permission to createApplication Accessvia the API.\n- SelectAcousticfrom the list of providers.\n- Select theFull Authmethod for authorization.\n- Enter aLabelto identify your authorization.\n- (Optional) Enter aDescriptionfor further context on your authorization.\n- Enter yourClient IDfor the application that you have created in your Acoustic account. For more information, please refer toAcoustic Documentation.\n- Enter theClient Secretfor your entered Client ID.\n- Enter thePodnumber of your Acoustic Campaign. You can find the Pod information in Account Setting page of yourAcousticaccount. For example, if it isPod 2then just enter2.\n- EnterRefresh Tokenthat you have created to grant Lytics access. For more information, please refer toAcoustic Documentation.\n- Enter yourSFTP Usernamefor the Acoustic Account.\n- Enter yourSFTP Passwordfor the above SFTP User. You can use your own credentials here, or create a new user for this integration.\n- ClickSave Authorization.\n\n## 📘\nFor this integration, it is recommended to create a new Acoustic User specific for Lytics with the optionDo not enforce password expiration policies for this userselected so the authentication is long lasting, and can be revoked on an account by account basis.\n\n```\nDo not enforce password expiration policies for this user\n```\n\n## Import Audiences & Activity\nImport Acoustic users and their activity information into Lytics so you can leverage that data to build behavioral audiences and gain Insights powered by Lytics data science.\n\n## Integration Details\n- Implementation Type:Server-side Integration.\n- Implementation Technique: XMLAPI Integrationto download CSV formatted data.\n- Frequency:  Data is imported as aBatch Integration; imported once, or every 8 hours on a continuous basis.\n- Resulting Data: Full Lytics user profiles for all Acoustic users complete with activity data.\nThis integration utilizes theAcoustic XML APIto import Acoustic users and their activity to Lytics. Each run of the job will proceed as follows:\n- Exportsusers from the selected Acoustic Database as a CSV file to an Acoustic-manged SFTP server. The CSV files are then read and imported to thesilverpop_usersstream in Lytics.\n\n```\nsilverpop_users\n```\n- Exportsemail activity from users in the selected Acoustic Database as a CSV file to an Acoustic-manged SFTP server. The CSV files are then read and imported to thesilverpop_activitystream in Lytics.\n\n```\nsilverpop_activity\n```\n- After successful completion, the job will import new/updated users with their updated activity every 8 hours ifconfiguredto run continuously.\n\n## Fields\nThe following fields are included in the default mapping for thesilverpop_usersstream. Note this integration was formerly named Silverpop, hence the data stream name, but this job will receive your current Acoustic data.\n\n```\nsilverpop_users\n```\n\n```\nunique_id\n```\n\n```\nOpted Out\n```\n\n```\nOpted Out Date\n```\n\n```\nOpt In Date\n```\n\n```\nOpt In Details\n```\nSimilarly, the following fields are included in the default mapping for thesilverpop_activitystream:\n\n```\nsilverpop_activity\n```\n\n```\nunique id\n```\n\n## Configuration\nFollow these steps to set up an Import Audiences and Activity Data job for Acoustic.\n- SelectAcousticfrom the list of providers.\n- Select theImport Audiences and Activity Datajob type from the list.\n- Select the Authorization you would like to use orcreate a new one.\n- Enter aLabelto identify this job you are creating in Lytics.\n- (Optional) Enter aDescriptionfor further context on your job.\n- From theTypedropdown, select the Acoustic source type: database, list, or query.\n- From theSourcedropdown, select the Acoustic source to import user data from.\n- Click on theShow Advanced Optionstab to expand the advanced configuration.\n- Check theKeep Updatedcheckbox to update the list every 8 hours.\n- In theActivity Startfield, enter the date to import activity from. The default is to retrieve one year of activity.\n- ClickStart Import.\n\n## Export Audiences\nSend Lytics user profiles and audience membership to your Acoustic Database to refine your targeting and deliver personalized messaging across channels. All existing users and new users of the selected Lytics audiences are exported.\n\n## Integration Details\n- Implementation Type:Server-side Integration.\n- Implementation Technique:API Integration,Audience Trigger Integration.\n- Frequency:Real-time Integration.\n- Resulting data: Lytics users are exported toAcoustic Database.\nThis integration utilizes the AcousticImport List APIto export user data from Lytics to the Acoustic Database. Once the export is started, the job:\n- Creates the column mapping file according to the fields selected duringconfigurationand uploads to the Acoustic Campaign SFTP server.\n- Writes the users that are part of selected Lytics audiences to the CSV file and initiates the CSV Import job in Acoustic.\n- The updates will be sent to Acoustic every 8 minute or a batch of 10000 users, whichever occurs first.\n\n## Fields\nYou can export any Lytics user fields to Acoustic Database columns that are present in the selected Acoustic Database. Lytics allows you to map user fields with the corresponding Acoustic Database columns as part of the job configuration described below.\nTo export using the Acoustic Recipient ID as the sync field use theAcoustic Export Audience with Recipient ID export.\n\n## Configuration\nFollow these steps to set up an Export Audiences job for Acoustic.\n- SelectAcousticfrom the list of providers.\n- Select theExport Audiencesjob type from the list.\n- Select the Authorization you would like to use or create a new onecreate a new one.\n- Enter aLabelto identify this job you are creating in Lytics.\n- (Optional) Enter aDescriptionfor further context on your job.\n- From theAcoustic Databasedropdown, select the Acoustic database to populate with Lytics users.\n- Using theAudiencelist, select the Lytics audiences to export. As users enter or exit the selected audience(s) their record will be sent to Acoustic.\n- From theSync Fieldsmapping, choose the sync fields that are used to match and identify users like unique ID or email. At least one sync field must be specified.\n- From theAdditional Map Fields, map additional fields that you would like to send from Lytics to Acoustic by selecting the Lytics field on the left, and its Acoustic destination on the right.\n- FromFields to Trigger, select up to 75 user fields to trigger user change events. For any user in the exported audience, if any of the selected field values change, then the user will be updated in Acoustic.\n- Check theCreate New Contactscheckbox to create new contacts in Acoustic if they do not already exist.\n- Check theUpdate Contactscheckbox to update fields of existing contacts in Acoustic.\n- In theSingle Audience Fieldtext field, select a field or enter a name to create a field to write the additional Lytics audiences to. If the field is left empty, a Yes/No field is created for each selected Lytics audience.\n- (Optional) In theSingle Audience File Empty Stringtext field, specify this to a value like \"null\" to represent an empty audience. Otherwise, an empty string is sent by default.\n- Check theKeep Updatedcheckbox to continuously export users as they enter the audience.\n- From theTime of Daydropdown, select a time of day to complete export each day. Export will sync every hour if left empty.\n- From theTimezonedropdown, select the timezone for time of day specified above.\n- ClickStart Export.\n\n## Export Audiences with Recipient ID\nSend Lytics user profiles and audience membership to your Acoustic Database to refine your targeting and deliver personalized messaging across channels. All existing users and new users of the selected Lytics audiences are exported.\n\n## 📘\nThis export is specifically used for exporting using the Acoustic Recipient ID as the sync field. It will only update users already in Acoustic with a Recipient ID. In order to add users to Acoustic or if you would like to use other sync fields use the standardAcoustic Export Audience export.\n\n## Integration Details\n- Implementation Type:Server-side Integration.\n- Implementation Technique:API Integration,Audience Trigger Integration.\n- Frequency:Real-time Integration.\n- Resulting data: Lytics users are exported toAcoustic Database.\nThis integration utilizes the AcousticImport List APIto export user data from Lytics to the Acoustic Database. Once the export is started, the job:\n- Creates the column mapping file according to the fields selected duringconfigurationand uploads to the Acoustic Campaign SFTP server.\n- Writes the users that are part of selected Lytics audiences to the CSV file and initiates the CSV Import job in Acoustic.\n- The updates will be sent to Acoustic every 5 minutes or a batch of 10000 users, whichever occurs first.\n\n## Fields\nYou can export any Lytics user fields to Acoustic Database columns that are present in the selected Acoustic Database. Lytics allows you to map user fields with the corresponding Acoustic Database columns as part of the job configuration described below.\n\n## Configuration\nFollow these steps to set up an Export Audiences job for Acoustic.\n- SelectAcousticfrom the list of providers.\n- Select theExport Audiencesjob type from the list.\n- Select the Authorization you would like to use orcreate a new one.\n- Enter aLabelto identify this job you are creating in Lytics.\n- (Optional) Enter aDescriptionfor further context on your job.\n- From theAcoustic Databasedropdown, select the Acoustic database to populate with Lytics users.\n- Using theAudiencelist, select the Lytics audiences to export. As users enter or exit the selected audience(s) their record will be sent to Acoustic.\n- From theRecipient IDfield, choose the field that contains the Acoustic Recipient ID in Lytics.\n- From theAdditional Map Fields, map additional fields that you would like to send from Lytics to Acoustic by selecting the Lytics field on the left, and its Acoustic destination on the right.\n- FromFields to Trigger, select up to 75 user fields to trigger user change events. For any user in the exported audience, if any of the selected field values change, then the user will be updated in Acoustic.\n- In theSingle Audience Fieldtext field, select a field or enter a name to create a field to write the additional Lytics audiences to. If the field is left empty, a Yes/No field is created for each selected Lytics audience.\n- (Optional) In theSingle Audience File Empty Stringtext field, specify this to a value like \"null\" to represent an empty audience. Otherwise, an empty string is sent by default.\n- Check theKeep Updatedcheckbox to continuously export users as they enter the audience.\n- From theTime of Daydropdown, select a time of day to complete export each day. Export will sync every hour if left empty.\n- From theTimezonedropdown, select the timezone for time of day specified above.\n- ClickStart Export.\n\n## Export Audiences to Relational Tables\nSend Lytics user profile data and audience membership to your Acoustic Relational tables.  All existing and new users of the selected audience are exported in real-time.\n\n## Integration Details\n- Implementation Type:Server-side Integration.\n- Implementation Technique:API Integration,Audience Trigger Integration.\n- Frequency:Real-time Integration.\n- Resulting data: Lytics users are exported toAcoustic Relational Table.\nThis integration utilizes the AcousticRelational Table Management apito export user data from Lytics to the Acoustic Relational Table. Once the export is started, the job:\n- Creates or writes to the following tables depending on the configuration of the job (see theexamplebelow for a visual example),User table - the user identifier plus all scalar fields will be written to this table.Audience table - the user identifier plus a boolean (Yes/No) column for each Lytics audience exported. Users that belong to the audience will havetrueas value in the respective audience column, and similarly, will havefalseif the user does not belong to the audience.Non-scalar tables - for each non-scalar field exported a separate table will be created.For sets, the table will have a column for the user identifier plus a column calledlytics_valuewith a row written for each value in the set.For maps, the table will have a column for the user identifier plus two columns,lytics_keyandlytics_valuewith a row written for each key/value pair in the map.\n- User table - the user identifier plus all scalar fields will be written to this table.\n- Audience table - the user identifier plus a boolean (Yes/No) column for each Lytics audience exported. Users that belong to the audience will havetrueas value in the respective audience column, and similarly, will havefalseif the user does not belong to the audience.\n\n```\ntrue\n```\n\n```\nfalse\n```\n- Non-scalar tables - for each non-scalar field exported a separate table will be created.For sets, the table will have a column for the user identifier plus a column calledlytics_valuewith a row written for each value in the set.For maps, the table will have a column for the user identifier plus two columns,lytics_keyandlytics_valuewith a row written for each key/value pair in the map.\n- For sets, the table will have a column for the user identifier plus a column calledlytics_valuewith a row written for each value in the set.\n\n```\nlytics_value\n```\n- For maps, the table will have a column for the user identifier plus two columns,lytics_keyandlytics_valuewith a row written for each key/value pair in the map.\n\n```\nlytics_key\n```\n\n```\nlytics_value\n```\n- As users enter or exit the audience, rows will added or updated in the tables above\n- The updates will be sent to Acoustic every 5 minutes or a batch of 1000 users, whichever occurs first.\n\n## Fields\nYou can export any Lytics user fields to Acoustic Relational Table. Lytics allows you to map user fields with the corresponding table columns as part of job configuration. The job also has option to create column in Acoustic table for Lytics user field.\n\n## Configuration\nFollow these steps to set up an Export Audiences job for Acoustic.\n- SelectAcousticfrom the list of providers.\n- Select theExport Audience to Acoustic Relational Tablejob type from the list.\n- Select the Authorization you would like to use orcreate a new one.\n- Enter aLabelto identify this job you are creating in Lytics.\n- (Optional) Enter aDescriptionfor further context on your job.\n- Using theAudienceslist, select the Lytics audiences to export. As users enter or exit the selected audience(s) their record will be sent to Acoustic.\n- From theAcoustic User Tabledropdown, select the Acoustic relational table to populate with user profile data. SelectCreate New Tableto create new user table with namelytics_user_table_{timestamp}.{timestamp}is replaced with current timestamp in formatYYYYMMDDHHmmss.\n\n```\nCreate New Table\n```\n\n```\nlytics_user_table_{timestamp}\n```\n\n```\n{timestamp}\n```\n\n```\nYYYYMMDDHHmmss\n```\n- IfCreate New Tableis selected, from theUser Table Key Fielddropdown, select the Lytics user field to be used as primary key for new user table. Should be left blank if writing to an existing table.\n\n```\nCreate New Table\n```\n- If writing to an existing table, from theAcoustic User Table Mapping, map Lytics user fields that you would like to send from Lytics to corresponding Acoustic field.NOTE:All the key column for the selected Acoustic user table must be mapped.\n- For either exporting to a new table or writing an existing table, from theExtra Fieldslist, select the additional Lytics user fields to export. These are extra scalar fields to be sent to Acoustic user table. Each field will be added as a separate column in the table.\n- From theAcoustic Audience Membership Tabledropdown, either select the Acoustic relational table to populate with audience information or selectCreate New Table. If the creation of a new audience table is selected, a table will be created with the namelytics_audiences_table_{timestamp}.{timestamp}is replaced with current timestamp in formatYYYYMMDDHHmmss.\n\n```\nCreate New Table\n```\n\n```\nlytics_audiences_table_{timestamp}\n```\n\n```\n{timestamp}\n```\n\n```\nYYYYMMDDHHmmss\n```\n- IfCreate New Tableis selected for the Acoustic audience membership table, in theAudience Membership Table Key Fielddropdown, select the Lytics user field to be used as primary key for new audience membership table. Should be left blank if writing to an existing table.\n\n```\nCreate New Table\n```\n- If writing to an existing audience table, from theAcoustic Audience Membership Table Key Mapping, map the keys from Lytics to the key columns in Acoustic. The primary key in Acoustic must be mapped.\n- Using theNon-Scalar User Fieldslist, select any Lytics non-scalar user field to export. An Acoustic relational table with namelytics_{field-name}_table_{timestamp}will be created for each selected non-scalar field.\n\n```\nlytics_{field-name}_table_{timestamp}\n```\n- If exporting non-scalar fields, from theNon-Scalar Field Table Key Fielddropdown, select Lytics user field to be used as primary key for all new non-scalar field table.\n- SelectExisting Usersto send users currently in the Lytics audience to Acoustic.\n- ClickCompleteto create the job.\n\n## Example\nBelow is an example of a user exported and how they may look in Acoustic.\n\n```\nSample User\n{\n  \"email\": \"[email protected]\",\n  \"first_name\": \"James\",\n  \"last_name\": \"McDermott\",\n  \"channels\": [ \"web\", \"email\" ],\n  \"hourly\": {\n    \"17\": 1,\n    \"21\": 1,\n    \"23\": 2\n  },\n  \"segments\": {\n    \"all\",\n    \"highly_engaged\"\n  }\n}\n```\n\n```\nSample User\n{\n  \"email\": \"[email protected]\",\n  \"first_name\": \"James\",\n  \"last_name\": \"McDermott\",\n  \"channels\": [ \"web\", \"email\" ],\n  \"hourly\": {\n    \"17\": 1,\n    \"21\": 1,\n    \"23\": 2\n  },\n  \"segments\": {\n    \"all\",\n    \"highly_engaged\"\n  }\n}\n```\nUser Table: lytics_user_table_20240408220715\nAudience Table: lytics_audiences_table_20240408220715\nNon-scalar table for channels: lytics_channels_table_20240408220715\nNon-scalar table for hourly: lytics_hourly_table_20240408220715\nUpdated27 days ago",
    "url": "https://docs.lytics.com/docs/acoustic"
  },
  {
    "title": "Adobe",
    "content": "## Overview\nThis guide offers an overview of options for leveraging Lytics standard integration capabilities to connect with Adobe’s ads products.\nThe decisioning capabilities of Lytics can be combined with the personalized activation proficiency of the Adobe products:\n- Adobe Campaign\n- Adobe Analytics\n- Adobe Target\n- Adobe Ad Cloud\n- Adobe Audience Manager\n\n## Options for sending data from Lytics to Adobe:\n- Sending file based data directly to Adobe using aLytics File Servce\n- Sending data in near real time from Lytics to one of our supported data warehouse integrations (Google BigQuery,Microsoft Azure,Snowflake,Amazon Web Services (AWS) Redshift).Then from the data warehouse, send the data to Adobe Cloud\n- Client Side - Lytics surfaces data in Web Layer via the Lytics JavaScript Tag. Learn how you can via the Lytics taghere.\n\n## Options for sending data from Adobe to Lytics:\n- From Adobe send data to a Lytics Supported data warehouse  (Google BigQuery,Microsoft Azure,Snowflake,Amazon Web Services (AWS) Redshift). The data from the data warehouse can be imported into Lytics. In many cases this is the recommended approach to avoid duplication of processes and data storage.\n- Sending file based data from Adobe to Lytics using aLytics File Service\n- Client Side - Using the Lytics JavaScript Tag [link] to pass Information to Lytics from the website / data layer\n\n## Further details on integrating with Adobe products\nAdobe Campaign\nLytics can export file based data to Adobe Campaign via hourly/daily CSV file export to an SFTP location. Adobe Campaign can import CSV files from its own secure location. This is more of a limitation on the Adobe Campaign side regarding limited API access.\n\n## Adobe Analytics\nThere are many ways to get data into Lytics from Adobe Analytics. One common method is to use the Lytics Javascript tag (jstag.send) function to send eVars directly from the data layer into Lytics on page load. This method will simplify the onboarding process and minimize the need to do a data transfer from Adobe Analytics on a regular basis.\nAs part of onboarding, we can help identify which data you would like to pull in for activation and identify the right mechanisms for ingestion. Lytics provides ways to ingest this data from scheduled SFTP pickups to Bulk API imports or transactional APIs.\n\n## Adobe Target\nOur Javascript Tag will communicate user audience membership to Adobe Target, which will respond with the appropriate site personalizations.  This Lytics data will be returned from our platform on page load and the Users Profile, segmentation information and content recommendations will be placed in the web page data layer.\nYou can pass this information simply by leveraging the lio.data.segments object that is loaded onto every page where the Lytics JS tag is deployed.\n\n## Adobe Ad Cloud\nSimilar to other Adobe products, Adobe Ad Cloud supports the consumption of user audiences via SFTP, Json file upload, API (Lytics can create a webhook to stream data - but more conversation with Adobe will be needed) as well as direct from other Adobe products like Adobe Audience Manager.\nLytics can also directly send audiences from Lytics into ad platforms (e.g. Facebook, Google, Linkedin, Twitter, Snapchat, Instagram, LiveRamp.  With our Google partnership, Lytics has early access to Google’s API-based integration for custom audiences within DV360.\n\n## Adobe Audience Manager\nWe can deliver audiences into Audience Manager via SFTP or Data Warehouse integration, similar to how the above integrations have been documented.\nUpdated2 months ago",
    "url": "https://docs.lytics.com/docs/adobe"
  },
  {
    "title": "Partner Types",
    "content": "Our partners are trusted collaborators who work directly with our customers to ensure successful implementation and ongoing success. They work directly with Lytics customers on implementations and provide post-implementation technical and strategic support. Through their expertise and commitment, our partners help to streamline processes, enhance customer satisfaction, and drive the effective utilization of our solutions.\n\n## Types of partners:\n- Subcontractor Implementations- A partner who implements a Lytics customer that has been acquired directly by Lytics.\n- Subcontract Technical Account Management- A partner who helps aid a Lytics-acquired customer with technical management and strategy components as an extension of professional services.\n- Referral Partner (Enterprise or Mid-Market)- Under a reseller agreement partners can bring their customers to Lytics to be supported by licensing and provide implementation or technical account management services at their discretion. Partners interested in becoming resellers and who do not have an agreement with Lytics can contact the Lytics commercial team to create one.\nUpdated4 months ago",
    "url": "https://docs.lytics.com/docs/partner-types"
  },
  {
    "title": "Lytics Communication",
    "content": "There are many reasons why Lytics and partners need to communicate across different tools, here are some best practices on how to get the most out of your communication with Lytics staff. Please note, that this is not an exhaustive list of scenarios, the following should be considered a guideline.\nCommunity- Lytics has a community section on their docs site where users of Lytics can ask general questions about Lytics, how to use Lytics, and what’s possible with Lytics. Think of this community area as your Lytics Stackoverflow. The Lytics Community can be found here.Some examples of community-type questions are:\n- “Regarding the NLP engine, are you able to scrape all the contents of, apply topics to, and associate topic scores to users on PDFs?”\n- “Can one set up alerts for jobs failing and/or being deleted like you can set up alerts for event overages?”\n- “Is there an endpoint I can hit to see hidden streams?”\nCustomer-specific questions or questions that regard Solution Architecture (complex) for a customer are not suitable for the Community section and should be asked in Zendesk.\nZendesk- All customers and partners working on behalf of customers can use the Lytics Support Portal for the following:\n- Report technical issues with the Lytics platform, e.g. Bug reports\n- Feature Requests\n- Solution architecture questions that require discretion with customer needs\n- Assistance with features that may not be accessible by a partner or customer\nPartners can contact the Lytics support team through support.lytics.com or[email protected], which will create a Zendesk ticket.\nSlack & Email- Partners are encouraged to communicate directly with the Lytics team for other partnership needs. Please prioritize Community and Zendesk for any customer CDP-related questions.\nSome examples of Email and Slack communications are:\n- Contract questions, billing invoices, or other administrative needs\n- Partnership questions\n- Lytics Training\n- Customer status check-ins\n- Meeting coordination\n- Customer-specific issues that are not appropriate in the Lytics public Community forum\nUpdated4 months ago",
    "url": "https://docs.lytics.com/docs/lytics-communication"
  },
  {
    "title": "Insights",
    "content": "## Introduction\nLytics Insights provide visibility into how your audiences and campaigns perform and recommend how you may improve engagement, drive conversions, and increase marketing ROI.\nYou can think of Lytics Insights as a way to connect thedatayou have with thedecisionsyou are making for marketing campaigns. Defined in a few words, Lytics Insights are:\n- Actionable: Direct knowledge to your marketing initiatives.\n- Contextual: Provide actions that are relevant to the Lytics user consuming them.\n- Explanatory: Describe phenomena in terms of your business processes or outcomes.\n- Novel: Offer a new understanding of your customers and campaigns.\nInsights serve as a key ingredient to achieve marketing personalization. To effectively leverage customer data, you must apply it throughout your campaign planning and execution process. Unlike metrics that remain on a BI dashboard or report, Lytics Insights are designed beimmediately activatedin your segmentation and campaign strategies.\nIf your account package includes Insights, you can access Insights from anywhere in the Lytics UI.\n\n## How Insights Work\nInsights surface meaningful data and recommended action, enabling you to make better, data-driven decisions during your campaign planning and execution. The core idea behind Insights is simple. Insights are a combination of facts and actions:\n- Fact: Observable, data-driven information providing demonstrable value. This is a unique set of raw metrics, such as the number of users or the amount of lift.\n- Action: Suggested behavior based on user role, data source, activation channels, industry, etc. This is the contextualization of a fact into something to be done.\nInsights are made possible thanks to the data science capabilities built into Lytics. The heavy lift of processing and interpreting data is automatically handled by machine learning models under-the-hood.\nThis is a prime example of how machine learning can augment (not replace) a marketer’s role. Machines efficiently and accurately sift through lots of data, allowing people to then make use of the important information in the most relevant context. For example, a model can predict which users are most likely to churn, and a marketer can then target those at-risk users with a win-back campaign on Facebook.\n\n## Insight Cards\nInsights are presented asInsight Cardsthat are available throughout the entire app.Simply navigate to the left-hand side of the Lytics UI to open theInsights Drawer, which contains a list ofInsight Cardsunique to your account.\nBelow is an example of an Insight card and what it's comprised of:\n- Creation date: When the Insight was generated.\n- Expiration date: When the Insight will be removed from the drawer. Insights expire after 2 weeks.\n- Insight statement: The explanation or comparison of noteworthy data will depend on the type of Insight. You can click on an audience name to view its summary report.\n- Recommended action: Lytics will suggest how you can apply this Insight to your targeting along with a related use case.\n- Expanded definition: View more details by clicking the arrow. This example explains the Lytics score or other data field being calculated.\nInsights are generated and refreshed on aweekly basisto ensure you are viewing the most recent user data. Insights expire after 2 weeks, so you only target and activate an audience and campaigns during a relevant time frame.\nThe Insights Drawer will display a maximum of 25 cards at a time. Insights will be created for up to10 custom audiences, in addition to Lytic's out-of-the-box engagement audiences. Lytics will prioritize Insights based on the statistical significance of the data and the most frequently used audiences.\n\n## Compositional Insights\nCompositional Insights help you understand the makeup of your audiences. This information can answer, “what makes an audience unique?” and “How should I target these users differently?”\nCompositional Insights make it easier for you to create effective segmentation strategies. They compare data fields within audiences to surface which attributes drive user behavior. Compositional Insights currently include the following:\n\n## Audience Pairs\nThis Insight compares high-value audiences on their levels of engagement. This can take the form of comparing Lytic's out-of-the-box audiences on a particular behavioral score or a custom audience.\nAs a bite-size piece of information, this Insight Card has provided:\n- An easy way to leverage Lytics audiences and scores that are derived from data science.\n- A suggested next step of what to do with this information. For example, you may target these at-risk users with a win-back campaign.\n\n## Field Candidates\nThis Insight compares the prevalence of specific data fields within two audiences. Candidates included arefields used in audience definitionsand fields from thePromoted Schema Fieldsin yourAccount Settings.\nHaving a granular understanding of your audiences allows you to make more strategic targeting decisions. For example, there may be a data field that your organization is paying to collect. If you discover through an Insight Card that this field is not performing as expected in your campaigns, you could save marketing spend by eliminating that field and using others that are shown to be more predictive of user behavior.\n\n## Experience Insights\nExperience Insights help you track and understand campaign performance. This information can answer, “Which campaigns are resonating with my users?” and “Are my marketing tactics driving engagement or conversions?”\nExperience Insights allow you to refine campaigns based on current metrics proactively. Since Lytics Insights are generated and refreshed every week, you can take action to improve a campaign while it’s running.\nExperience Insights include the following types:\n\n## Experience Management\nThis Insight will surface when an experience is missing UTM parameters, which enable Lytics to track conversions from downstream tools such as Facebook.\nWhile this Insight is more straightforward than the other types Lytics offers, it helps you quickly identify when an Experience configuration is incomplete, affecting your ability to track performance and target users who have previously engaged in future campaigns.\n\n## Experience Performance\nThis Insight appears when a significant spike up or down in campaign performance exists. Awareness of such incidents allows you to make the necessary changes to improve campaign ROI.\nFor example, if conversion rates have rapidly declined for a particular campaign in the last week, you may need to reevaluate and consider changes such as refining your audience, messaging, or campaign tactics.\n\n## Activating Insights\nTaking action based on your Insights is the most important part of the process. As the introduction explains, Lytics Insights are designed to be actionable. By understanding how users interact with your brand at a granular level, you can iterate campaigns to improve their performance and deliver better user experiences.\n\n## Activating against Lytics Behavioral Scores\nUser engagement is a crucial component of personalization. Each Lytics Score (quantity, frequency, recency, intensity, momentum, propensity) indicates a different aspect of user behavior,  but overall, higher scores indicate high engagement, while lower scores indicate low engagement.\nBelow are some everyday use cases you might consider, depending on whether the target audience hashigherbehavioral scores (anything above 50) orlowerbehavioral scores (anything below 50).\n\n## Targeting Users with Low Engagement\nThere are two main approaches to reaching unengaged users. The first is to drive engagement using a variety of tactics, such as messaging on different channels, targeting based on content affinities, etc. The second approach is to increase marketing efficiency by suppressing these users, thus improving your conversions.\n\n## Targeting Users with High Engagement\nWhen creating strategies around your most active users, you will want to keep them engaged by delivering relevant content and establishing a first-party relationship that increases their Lifetime Value (LTV). You can find more users who are similar to your best customers using lookalike audiences.\nYou can also learn more about what makes these engaged users different, which can inform your overall targeting strategies.\n- View the Audience summary by clicking the audience name on your Insight Card to see the history of this audience and its characteristics.\n\n## Activating against Lytics Content Affinity\nGiving your users more of what they love is a great tactic to consider to either drive engagement for less active users or to keep currently active users engaged.\nUpdatedalmost 2 years ago",
    "url": "https://docs.lytics.com/docs/insights"
  },
  {
    "title": "Importing External Experiences",
    "content": "## Importing External Experiences\nYou can import existing marketing initiatives currently managed by your channel providers, which enables you to quickly gain insights about the campaigns you’re already running. You can then take action by connecting these Experiences to your Lytics audiences.\nWhile you can monitor Experiences and activate audiences for them within Lytics, the management of external Experiences still happens inside your channel tools. If you want to stop, delete, or edit the execution of an Experience, you need to do so within the provider. If you choose to delete an Experience in Lytics that still has a matching campaign in your channel tool, it will show up on the import list and can be re-imported.\n\n## Centralize cross-channel reporting\nLytics serves as a central hub to monitor your cross-channel marketing, making it easier to understand and improve the performance of  your campaigns. For example, instead of logging into Facebook to check your ad campaign metrics and Iterable to check your email newsletter open rates, you can monitor the performance of both tools within your Lytics dashboard.\nTo start monitoring external Experiences on Lytics, follow the batch import steps.\n\n## Monitor Experiences via batch import\nOn your Lytics dashboard, navigate toExperiences, and selectAdd Experiences > Import.\n\n## Select your provider\nThe Lytics Canvas connects out-of-the-box with select channel providers. Over time, more providers will be added to this list. If you want to use a provider that is not currently available, you can use the \"Generic Experience\" workflow to export Lytics audiences to any of your integrated providers.\n\n## Authorize\nNext, you will be prompted to select an authorization for your chosen provider. Existing authorizations will be shown. If you have multiple accounts within a particular channel such as Facebook, you will choose which account to import from. If you don’t have an authorization, you will be prompted to add one before continuing. For Facebook, there is a second step for authorizing Ad Set ID after you’ve selected your account ID.\n\n## Import Experiences\nFinally, select the Experiences you want to import into Lytics (up to 10 at a time). The total number of Experiences you can bring into Lytics is only limited by the amount in your connected provider. However, to have meaningful and accurate reporting, it's recommended to only import Experiences that will add value to your use cases.\nCompleted experiences, such as an Ad Set that previously \"ended\", will not show on the list of importable Experiences. But if you have Ad Sets in Facebook that are saved as drafts, paused, or currently running, those will be available to import.\n\n## Connect Experiences with Lytics audiences\nOnce you start monitoring external Experiences, you can activate them by adding a Lytics audience. This lets you enrich your existing campaigns with Lytics behavioral audiences, content affinities, and delivery optimization.An example use case is to conserve Facebook ad spend by only targeting “Currently Engaged” users who have a high affinity for the content of a particular campaign. Leveraging data science under the hood, Lytics audiences can bring immediate value to your existing marketing campaigns.\nIf you have already imported an external Experience, you can activate it from the Experience summary view by clickingEditin the top right.\nIf you want to activate an Experience that you haven't imported yet, follow the single import steps below, which will guide you through the Experience editor.\n\n## Activate Experiences via single import\nTo activate an Experience that you haven't imported yet, you will follow the workflow of creating a new Experience in Lytics. From the Experiences list view, clickAdd Experiences>New.\nSelect your chosen provider and thenImportthe campaign, ad set, or journey. This example will continue with importing a SendGrid campaign.\nNext you will select an Authorization for your chosen provider as described above.\nThen you will select the campaign or ad set to import. Note that here you can only import one Experience at a time. ClickImport 1 Experienceto continue.\n\n## Complete the Experience Editor steps\nFinally, you will complete the following Experience Editor steps:\n- Target: configure your target audience for this Experience.\n- Configure provider: choose how the audience for your Experience will be exported to the third-party tool.\n- Configure delivery: option to automatically determine when to deliver messages to individual users on the third-party tool.\nUpon completion, your Experience will be ready to publish.\nUpdatedalmost 2 years ago",
    "url": "https://docs.lytics.com/docs/importing-external-experiences"
  },
  {
    "title": "IDP-initiated SSO (legacy)",
    "content": "## IDP-initiated SSO (Legacy)\n\n## 🚧\nThis document describes a legacy implementation that Lytics is actively deprecating. If you're looking for details on the current SSO implementation, check out thenew documentation.\nLytics supports enterprise Single Sign-On (SSO) by usingAuth0as a service provider usingSAML protocol. Lytics integrates with Identity Providers (IdPs) in such a way that the IdP initiates SSO. That is, when your end user logs in to their IdP, they will use a global portal for your organization. Users can then click a link or button that will log them into Lytics seamlessly.\nBehind the scenes, the IdP will be contacting the Lytics Auth0 service provider to verify the user and redirect them to a logged-in instance of the Lytics app. This document describes the process for integrating with a new IdP that uses SAML.\n\n## Service Provider Configuration\nTo configure SAML for the Lytics service provider some information is required about your IdP. If you have a metadata file that contains SAML provider information this may be appropriate, just make sure that the following information is provided toLytics Support:\n- Sign In URL\n- X509 Signing Certificate (The identity provider public key - if possible encoded in a separate PEM or CER formatted file)\n- Sign Out URL\nFurther configuration details such as mappings may need to be provided. Once this information has been received, Lytics can configure the SAML connection in Auth0.\n\n## IdP Configuration\nAfter Lytics configures the SAML connection on the service provider,Lytics Supportwill provide a metadata XML file with the following information in order to complete the IdP configuration. The key fields in this metadata are:\n- Connection Name\n- Assertion Consumer Service (ACS) URL (aka post-back or callback URL)\n- Entity ID of the Service Provider\nWith this information, your IdP connection can be configured to complete the SSO integration.\n\n## Testing SSO\nOnce all the information has been configured in both the IdP and the Lytics service provider, you can test and verify that the SSO implementation works as expected. If you are using SSO as your only sign-in method, please disable any password restriction or expiration settings that may have been enabled in the UI.\nDuring the testing process, Lytics can be configured to allow both SSO logins and regular username and password (or Google OAuth) login through the app. This allows users to test SSO without disrupting the day-to-day usage of the app.\nIf requested, once the SSO implementation has been tested and verified, Lytics can disable the use of other logins for an account.\n\n## Troubleshooting SSO\nIf it's known that SSO is going to be added to an account, then the user email addresses added to the account should match the email address present within the IdP. If the email address doesn’t match, then the login will fail as Lytics will not be able to verify that there is a user with that email address.\nFor instance, if the email listed in the IdP isabc@123, and within Lytics it’sdef@456, then the user will have successfully been verified by their IdP, but the login within Lytics would fail as the authenticated user email would not match the user within Lytics. You would need to create a new user within Lytics with the email addressabc@123for the SSO login to be successful.\n\n```\nabc@123\n```\n\n```\ndef@456\n```\n\n```\nabc@123\n```\nIt should also be noted that primary accounts are decided as the first account that a user was added to.  Due to this,  users from a single group/organization will often have different primary accounts. This is important for SSO as it will also be the account that the user is logged into at the start of their session. If SSO is enabled as the only means of login on one account and a user attempts to log-in using Google OAuth or their username and password, the login session will fail. The following options are possible solutions:\n- Add that user to your IdP.\n- Other methods of logging in would need to be added (Google OAuth, username/password).\n- Remove user from all accounts and then add them back with the first account being the account that you want to be their primary account.\nLytics Supportcan assist in the troubleshooting process. When testing for the first time Lytics can enable logging to help troubleshoot any issues you may encounter. If you are receiving the error message shown below after being redirected to the app, that means there is an issue on the application side.\nTheLytics Supportteam can help debug this if you provide information on the login attempt such as the time of the login and the user and account.\nIf you’re encountering an error earlier in the login process, such as before you are redirected to the Lytics app, this may be an issue with the SAML configuration either on the IdP or Service provider side. Lytics’ support team can review these issues and coordinate a fix, just contact us with the details of the issue.\nUpdatedalmost 2 years ago",
    "url": "https://docs.lytics.com/docs/idp-initiated-sso-legacy"
  },
  {
    "title": "Developer Quickstart",
    "content": "## Introduction\nWelcome to the Lytics developer tier! This guide will walk you through the steps to get started with Lytics and leverage its powerful personalization capabilities for your website.\n\n## Before You Begin\nBefore diving into the setup process, make sure you have the following:\n- Site Access / Management Permission: To install Lytics, you need permission to install JavaScript either via a tag manager or directly onto your website. Alternatively, you can install Lytics via aDrupal module.\n- Active Lytics Account: Verify that you can access an active Lytics account. If you don't have one yet, you canclaim your free developer account.\n- Lytics Dev Tools Chrome Extension: Install ourdeveloper toolsChrome extension to streamline the development and installation process.\n\n## Getting Started Checklist\nGetting started with Lytics is quick and easy! In just a few minutes, you'll be able to set up Lytics and start personalizing your website. We've focused this guide on the 3 essential steps to ensure a positive experience for you and your customers:\n- 1. Install the Lytics tag on your site.\n- 2. Ensuring site content and Lytics are syncing.\n- 3. Create your first personalized message.\n\n## Digging Deeper\nAfter completing the initial checklist outlined above, it's time to explore further avenues for enhancing and utilizing your profiles to their fullest potential. We've broken additional guides into two core focuses:\n\n## Building Profiles\nHere, we'll gain a comprehensive understanding of all available out-of-the-box attributes. Discover how to tag your site and integrate other sources to create robust and comprehensive profiles. This section is divided into:\n\n## Default Attributes & Segments:\n- Profile Attributes\n- Audience Segments\n- Content Collections\n\n## Site Activity & Conversion Tagging:\n- Capturing Website Activity (coming soon)\n- Capture Website Conversion Activity (coming soon)\n\n## Using Profiles\nHere, we'll explore leveraging out-of-the-box personalization SDKs and APIs to deliver optimal user experiences. Discover how to harness Lytics' tools and integrations to create tailored experiences that resonate with your audience. This section covers:\n\n## Guides & Inspiration\n- Surface a lead capture form only to unknown visitors.\n- Surface content recommendations based on interests.\n- Surface a promotional message to high-momentum visitors. (coming soon)\n- Sync profiles & audiences to GA4 or meta. (coming soon)\n- Personalize your site based on behaviors and stored attributes. (coming soon)\n\n## SDK Documentation\n- WebJavaScript SDKPersonalization SDK\n- JavaScript SDK\n- Personalization SDK\n- MobileiOS SDKAndroid SDKReact Native SDK\n- iOS SDK\n- Android SDK\n- React Native SDK\nUpdated6 months ago\n- 1. Account Setup",
    "url": "https://docs.lytics.com/docs/developer-quickstart#introduction"
  },
  {
    "title": "Developer Quickstart",
    "content": "## Introduction\nWelcome to the Lytics developer tier! This guide will walk you through the steps to get started with Lytics and leverage its powerful personalization capabilities for your website.\n\n## Before You Begin\nBefore diving into the setup process, make sure you have the following:\n- Site Access / Management Permission: To install Lytics, you need permission to install JavaScript either via a tag manager or directly onto your website. Alternatively, you can install Lytics via aDrupal module.\n- Active Lytics Account: Verify that you can access an active Lytics account. If you don't have one yet, you canclaim your free developer account.\n- Lytics Dev Tools Chrome Extension: Install ourdeveloper toolsChrome extension to streamline the development and installation process.\n\n## Getting Started Checklist\nGetting started with Lytics is quick and easy! In just a few minutes, you'll be able to set up Lytics and start personalizing your website. We've focused this guide on the 3 essential steps to ensure a positive experience for you and your customers:\n- 1. Install the Lytics tag on your site.\n- 2. Ensuring site content and Lytics are syncing.\n- 3. Create your first personalized message.\n\n## Digging Deeper\nAfter completing the initial checklist outlined above, it's time to explore further avenues for enhancing and utilizing your profiles to their fullest potential. We've broken additional guides into two core focuses:\n\n## Building Profiles\nHere, we'll gain a comprehensive understanding of all available out-of-the-box attributes. Discover how to tag your site and integrate other sources to create robust and comprehensive profiles. This section is divided into:\n\n## Default Attributes & Segments:\n- Profile Attributes\n- Audience Segments\n- Content Collections\n\n## Site Activity & Conversion Tagging:\n- Capturing Website Activity (coming soon)\n- Capture Website Conversion Activity (coming soon)\n\n## Using Profiles\nHere, we'll explore leveraging out-of-the-box personalization SDKs and APIs to deliver optimal user experiences. Discover how to harness Lytics' tools and integrations to create tailored experiences that resonate with your audience. This section covers:\n\n## Guides & Inspiration\n- Surface a lead capture form only to unknown visitors.\n- Surface content recommendations based on interests.\n- Surface a promotional message to high-momentum visitors. (coming soon)\n- Sync profiles & audiences to GA4 or meta. (coming soon)\n- Personalize your site based on behaviors and stored attributes. (coming soon)\n\n## SDK Documentation\n- WebJavaScript SDKPersonalization SDK\n- JavaScript SDK\n- Personalization SDK\n- MobileiOS SDKAndroid SDKReact Native SDK\n- iOS SDK\n- Android SDK\n- React Native SDK\nUpdated6 months ago\n- 1. Account Setup",
    "url": "https://docs.lytics.com/docs/developer-quickstart#before-you-begin"
  },
  {
    "title": "Developer Quickstart",
    "content": "## Introduction\nWelcome to the Lytics developer tier! This guide will walk you through the steps to get started with Lytics and leverage its powerful personalization capabilities for your website.\n\n## Before You Begin\nBefore diving into the setup process, make sure you have the following:\n- Site Access / Management Permission: To install Lytics, you need permission to install JavaScript either via a tag manager or directly onto your website. Alternatively, you can install Lytics via aDrupal module.\n- Active Lytics Account: Verify that you can access an active Lytics account. If you don't have one yet, you canclaim your free developer account.\n- Lytics Dev Tools Chrome Extension: Install ourdeveloper toolsChrome extension to streamline the development and installation process.\n\n## Getting Started Checklist\nGetting started with Lytics is quick and easy! In just a few minutes, you'll be able to set up Lytics and start personalizing your website. We've focused this guide on the 3 essential steps to ensure a positive experience for you and your customers:\n- 1. Install the Lytics tag on your site.\n- 2. Ensuring site content and Lytics are syncing.\n- 3. Create your first personalized message.\n\n## Digging Deeper\nAfter completing the initial checklist outlined above, it's time to explore further avenues for enhancing and utilizing your profiles to their fullest potential. We've broken additional guides into two core focuses:\n\n## Building Profiles\nHere, we'll gain a comprehensive understanding of all available out-of-the-box attributes. Discover how to tag your site and integrate other sources to create robust and comprehensive profiles. This section is divided into:\n\n## Default Attributes & Segments:\n- Profile Attributes\n- Audience Segments\n- Content Collections\n\n## Site Activity & Conversion Tagging:\n- Capturing Website Activity (coming soon)\n- Capture Website Conversion Activity (coming soon)\n\n## Using Profiles\nHere, we'll explore leveraging out-of-the-box personalization SDKs and APIs to deliver optimal user experiences. Discover how to harness Lytics' tools and integrations to create tailored experiences that resonate with your audience. This section covers:\n\n## Guides & Inspiration\n- Surface a lead capture form only to unknown visitors.\n- Surface content recommendations based on interests.\n- Surface a promotional message to high-momentum visitors. (coming soon)\n- Sync profiles & audiences to GA4 or meta. (coming soon)\n- Personalize your site based on behaviors and stored attributes. (coming soon)\n\n## SDK Documentation\n- WebJavaScript SDKPersonalization SDK\n- JavaScript SDK\n- Personalization SDK\n- MobileiOS SDKAndroid SDKReact Native SDK\n- iOS SDK\n- Android SDK\n- React Native SDK\nUpdated6 months ago\n- 1. Account Setup",
    "url": "https://docs.lytics.com/docs/developer-quickstart#getting-started-checklist"
  },
  {
    "title": "1. Install the Lytics Tag",
    "content": "## Installing the Tag\nIn the Web SDK, Lytics provides a tag that can be placed on your site to collect behavioral data and surface the materialized profile back to your browser in real time. Manual installation instructions are available from within the app atData Pipeline>SDK>Web SDK.\nIf your site is aDrupalorWordpresssite, or you useGoogle Tag Managerwe recommend using one of these turnkey methods to install the Lytics Tag:\n- Visit theConfigurationpage either from the module details in theExtendsection of Drupal or directly from theConfigurationsection (/en/admin/config/system/lytics).\nVisit theConfigurationpage either from the module details in theExtendsection of Drupal or directly from theConfigurationsection (/en/admin/config/system/lytics).\n\n```\n/en/admin/config/system/lytics\n```\n- Add a valid API Token for your Lytics account. Be sure to give that tokenadminprivileges, as that will unlock account verification and direct access to all Lytics systems responsible for surfacing and managing profiles and personalization. This token should also have no expiration, as it will need continued access to your Lytics account. For more information visit ourAccess Token documentation.\nAdd a valid API Token for your Lytics account. Be sure to give that tokenadminprivileges, as that will unlock account verification and direct access to all Lytics systems responsible for surfacing and managing profiles and personalization. This token should also have no expiration, as it will need continued access to your Lytics account. For more information visit ourAccess Token documentation.\n- With your token entered. Ensure theEnable Tabsetting is selected. This will automatically place the Lytics JavaScript SDK onto all public pages of your site.\nWith your token entered. Ensure theEnable Tabsetting is selected. This will automatically place the Lytics JavaScript SDK onto all public pages of your site.\n- Uponsaving configuration, your account details will be surfaced. Be sure to verify that your token is for the Lytics account you are currently configuring.\nUponsaving configuration, your account details will be surfaced. Be sure to verify that your token is for the Lytics account you are currently configuring.\n- That's it!\nThat's it!\n- From the left-hand navigation to selectData Pipeline>SDK>Web SDK.\n- Setup and installGoogle Tag Manager.\n- Create a newCustom HTMLtag and place the Lytics JavaScript snippet into the text box.\n- Ensure the tag is triggered on the pages you desire. We recommend using theAll Pagesdefault trigger to start.\n- Submit andpublishyour Google Tag Manager version.\n\n## Testing the Lytics Tag Installation\nOnce the tag has been installed, validate a successful installation via one of the three following methods:\nThe Lytics Dev Tools Chrome Extension makes validation and exploration simple. Once you've installed the extension as outlined above:\n- Open the extension and ensure it has been activated.\nOpen the extension and ensure it has been activated.\n- The interface will display a message to confirm the correct installation of the Lytics tag and relevant configuration details.\nThe interface will display a message to confirm the correct installation of the Lytics tag and relevant configuration details.\nWe've built a simple tool to validate that data flows into your Lytics account. Please note that the collected events may take a few minutes to reflect in the UI.\n- SelectVaultusing the product switcher at the top left.\n- Use the left-hand navigation to selectSetup>JavaScript Tag\n- At the bottom of the page\n- Setup click therefreshbutton to validate installation if it does not already stateSuccessfully installed.\nIf you prefer to verify the installation manually, you can do so by opening the Chrome developer console and ensuringjstagis accessible. In addition, by viewing the network tab, you can monitor data collection requests being sent tolytics.io/cand personalization requests being loaded fromlytics.io/api/personalize\n\n```\njstag\n```\n\n```\nlytics.io/c\n```\n\n```\nlytics.io/api/personalize\n```\n\n## Testing the Current Visitor's Profile via JavaScript SDK\nThe final step to verify installation is ensuring you can access your visitor profile. This profile is built and delivered in real-time as you engage with content.\nThe Lytics Dev Tools Chrome Extension makes validation and exploration simple. Once you've installed the extension as outlined above:\n- Open the extension and ensure it has been activated.\nOpen the extension and ensure it has been activated.\n- AccessProfilefrom the bottom menu in the Chrome extension.\nAccessProfilefrom the bottom menu in the Chrome extension.\n- This section of the extension profiles two views into your profile.The first is theSummaryshowcasing available attributes and affinities.The second is theDetails, which profiles a raw JSON dump of all available attributes and insights accessible via the Personalization Engine web SDK.\nThis section of the extension profiles two views into your profile.\n- The first is theSummaryshowcasing available attributes and affinities.\nThe first is theSummaryshowcasing available attributes and affinities.\n- The second is theDetails, which profiles a raw JSON dump of all available attributes and insights accessible via the Personalization Engine web SDK.\nThe second is theDetails, which profiles a raw JSON dump of all available attributes and insights accessible via the Personalization Engine web SDK.\nIf you prefer to verify the installation manually, you can do so by opening the Chrome developer console and ensuringjstagis accessible. In addition, by viewing the network tab, you can monitor data collection requests being sent tolytics.io/cand personalization requests being loaded fromlytics.io/api/personalize\n\n```\njstag\n```\n\n```\nlytics.io/c\n```\n\n```\nlytics.io/api/personalize\n```\nUpdated5 months ago\n- 2. Content Setup",
    "url": "https://docs.lytics.com/docs/developer-quickstart-3-install-lytics"
  },
  {
    "title": "2. Content Setup",
    "content": "Lytics' Interest Engines effectively analyze your content with minimal effort required. However, to guarantee that the classification results align with your expectations, conducting a quick test is advisable, as poor metadata can sometimes lead to less-than-optimal outcomes. The most reliable method to ensure comprehensive and satisfactory content classification is to classify a selection of your URLs manually.\n- Use the left-hand navigation to selectContent>Classification.\n- Click on the section labeledClassify, then paste a URL from your website and pressClassify.\n- After a moment or two, a set of preliminary classification details will come back. Most notably, ensure theTitle,Primary Image, andTopicscome back with content. If they do not, please refer to ourfull documentationfor configuring content and meta tags.\nUpdated5 months ago\n- 3. Surface Personalized Message",
    "url": "https://docs.lytics.com/docs/developer-quickstart-2-content-setup"
  },
  {
    "title": "3. Surface Personalized Message",
    "content": "The Lytics Personalization Engine profiles real-time access to a comprehensive visitor profile. Before we jump into the weeds of how you can fully build and leverage this profile, let's create our first experience.\n\n## Surface a Simple Message\nLytics comes with our Personalization SDK called Pathfora. Pathfora allows you to easily surface simple lead capture and messaging modals or content directly inline. Fulldocumentationfor Pathfora is available, but initially, let's surface a welcome message to ouranonymous visitoraudience.\n\n```\n// jstag profiles a helper function to ensure that the Pathfora library\n// has been loaded before triggering the experience.\njstag.on('pathfora.publish.done', function(topic, event){\n  // here we initialize a new Pathfora \"Message\" experience\n  var module = new pathfora.Message({\n    id: 'sample-message-campaign', // this value will be collected along side all interactions and used in reporting\n    layout: 'slideout', // for layout we'll use a small slide out\n    position: 'bottom-left', // the model will enter and sit at the bottom left\n    theme: 'dark', // css can be customized to brand but we'll use the default dark theme\n    headline: 'Hello world!', // this will be the headline of our message\n    msg: 'Congratulations on setting up your first targetted campaign using the Lytics Personalization Engine!', // the body of the message\n  });\n\n  var modules = {\n    target: [{\n      segment: \"anonymous_profiles\", // target only visitors with the anonymous_profile attribute\n      widgets: [module]\n    }]\n  };\n\n  pathfora.initializeWidgets(modules); // initialize the campaign\n});\n```\n\n```\n// jstag profiles a helper function to ensure that the Pathfora library\n// has been loaded before triggering the experience.\njstag.on('pathfora.publish.done', function(topic, event){\n  // here we initialize a new Pathfora \"Message\" experience\n  var module = new pathfora.Message({\n    id: 'sample-message-campaign', // this value will be collected along side all interactions and used in reporting\n    layout: 'slideout', // for layout we'll use a small slide out\n    position: 'bottom-left', // the model will enter and sit at the bottom left\n    theme: 'dark', // css can be customized to brand but we'll use the default dark theme\n    headline: 'Hello world!', // this will be the headline of our message\n    msg: 'Congratulations on setting up your first targetted campaign using the Lytics Personalization Engine!', // the body of the message\n  });\n\n  var modules = {\n    target: [{\n      segment: \"anonymous_profiles\", // target only visitors with the anonymous_profile attribute\n      widgets: [module]\n    }]\n  };\n\n  pathfora.initializeWidgets(modules); // initialize the campaign\n});\n```\n- Alter the Pathfora configuration to your liking.\nAlter the Pathfora configuration to your liking.\n- Install the Pathfora configuration onto your site via your preferred tag management method.\nInstall the Pathfora configuration onto your site via your preferred tag management method.\n- Refresh the page and be greeted with your new welcome message targeted at anonymous visitors!\nRefresh the page and be greeted with your new welcome message targeted at anonymous visitors!\nLytics and Pathfora provide a great deal of flexibility. If you are ready to dive deeper, please explore some of our other popular use cases:\n- Surface a Promotional Message to High Momentum Visitors (coming soon)\n- Surface a Lead Capture form Only to Unknown Visitors\n- Surface Content Recommendations Based on Interests (coming soon)\n- Sync Profiles & Audiences to GA4 or Meta (coming soon)\n- Personalize Your Site Based on Behaviors and Stored Attributes (coming soon)\nUpdated6 months ago\n- Building Profiles",
    "url": "https://docs.lytics.com/docs/developer-quickstart-4-personalized-message"
  },
  {
    "title": "Developer Quickstart",
    "content": "## Introduction\nWelcome to the Lytics developer tier! This guide will walk you through the steps to get started with Lytics and leverage its powerful personalization capabilities for your website.\n\n## Before You Begin\nBefore diving into the setup process, make sure you have the following:\n- Site Access / Management Permission: To install Lytics, you need permission to install JavaScript either via a tag manager or directly onto your website. Alternatively, you can install Lytics via aDrupal module.\n- Active Lytics Account: Verify that you can access an active Lytics account. If you don't have one yet, you canclaim your free developer account.\n- Lytics Dev Tools Chrome Extension: Install ourdeveloper toolsChrome extension to streamline the development and installation process.\n\n## Getting Started Checklist\nGetting started with Lytics is quick and easy! In just a few minutes, you'll be able to set up Lytics and start personalizing your website. We've focused this guide on the 3 essential steps to ensure a positive experience for you and your customers:\n- 1. Install the Lytics tag on your site.\n- 2. Ensuring site content and Lytics are syncing.\n- 3. Create your first personalized message.\n\n## Digging Deeper\nAfter completing the initial checklist outlined above, it's time to explore further avenues for enhancing and utilizing your profiles to their fullest potential. We've broken additional guides into two core focuses:\n\n## Building Profiles\nHere, we'll gain a comprehensive understanding of all available out-of-the-box attributes. Discover how to tag your site and integrate other sources to create robust and comprehensive profiles. This section is divided into:\n\n## Default Attributes & Segments:\n- Profile Attributes\n- Audience Segments\n- Content Collections\n\n## Site Activity & Conversion Tagging:\n- Capturing Website Activity (coming soon)\n- Capture Website Conversion Activity (coming soon)\n\n## Using Profiles\nHere, we'll explore leveraging out-of-the-box personalization SDKs and APIs to deliver optimal user experiences. Discover how to harness Lytics' tools and integrations to create tailored experiences that resonate with your audience. This section covers:\n\n## Guides & Inspiration\n- Surface a lead capture form only to unknown visitors.\n- Surface content recommendations based on interests.\n- Surface a promotional message to high-momentum visitors. (coming soon)\n- Sync profiles & audiences to GA4 or meta. (coming soon)\n- Personalize your site based on behaviors and stored attributes. (coming soon)\n\n## SDK Documentation\n- WebJavaScript SDKPersonalization SDK\n- JavaScript SDK\n- Personalization SDK\n- MobileiOS SDKAndroid SDKReact Native SDK\n- iOS SDK\n- Android SDK\n- React Native SDK\nUpdated6 months ago\n- 1. Account Setup",
    "url": "https://docs.lytics.com/docs/developer-quickstart#digging-deeper"
  },
  {
    "title": "Developer Quickstart",
    "content": "## Introduction\nWelcome to the Lytics developer tier! This guide will walk you through the steps to get started with Lytics and leverage its powerful personalization capabilities for your website.\n\n## Before You Begin\nBefore diving into the setup process, make sure you have the following:\n- Site Access / Management Permission: To install Lytics, you need permission to install JavaScript either via a tag manager or directly onto your website. Alternatively, you can install Lytics via aDrupal module.\n- Active Lytics Account: Verify that you can access an active Lytics account. If you don't have one yet, you canclaim your free developer account.\n- Lytics Dev Tools Chrome Extension: Install ourdeveloper toolsChrome extension to streamline the development and installation process.\n\n## Getting Started Checklist\nGetting started with Lytics is quick and easy! In just a few minutes, you'll be able to set up Lytics and start personalizing your website. We've focused this guide on the 3 essential steps to ensure a positive experience for you and your customers:\n- 1. Install the Lytics tag on your site.\n- 2. Ensuring site content and Lytics are syncing.\n- 3. Create your first personalized message.\n\n## Digging Deeper\nAfter completing the initial checklist outlined above, it's time to explore further avenues for enhancing and utilizing your profiles to their fullest potential. We've broken additional guides into two core focuses:\n\n## Building Profiles\nHere, we'll gain a comprehensive understanding of all available out-of-the-box attributes. Discover how to tag your site and integrate other sources to create robust and comprehensive profiles. This section is divided into:\n\n## Default Attributes & Segments:\n- Profile Attributes\n- Audience Segments\n- Content Collections\n\n## Site Activity & Conversion Tagging:\n- Capturing Website Activity (coming soon)\n- Capture Website Conversion Activity (coming soon)\n\n## Using Profiles\nHere, we'll explore leveraging out-of-the-box personalization SDKs and APIs to deliver optimal user experiences. Discover how to harness Lytics' tools and integrations to create tailored experiences that resonate with your audience. This section covers:\n\n## Guides & Inspiration\n- Surface a lead capture form only to unknown visitors.\n- Surface content recommendations based on interests.\n- Surface a promotional message to high-momentum visitors. (coming soon)\n- Sync profiles & audiences to GA4 or meta. (coming soon)\n- Personalize your site based on behaviors and stored attributes. (coming soon)\n\n## SDK Documentation\n- WebJavaScript SDKPersonalization SDK\n- JavaScript SDK\n- Personalization SDK\n- MobileiOS SDKAndroid SDKReact Native SDK\n- iOS SDK\n- Android SDK\n- React Native SDK\nUpdated6 months ago\n- 1. Account Setup",
    "url": "https://docs.lytics.com/docs/developer-quickstart#building-profiles"
  },
  {
    "title": "Developer Quickstart",
    "content": "## Introduction\nWelcome to the Lytics developer tier! This guide will walk you through the steps to get started with Lytics and leverage its powerful personalization capabilities for your website.\n\n## Before You Begin\nBefore diving into the setup process, make sure you have the following:\n- Site Access / Management Permission: To install Lytics, you need permission to install JavaScript either via a tag manager or directly onto your website. Alternatively, you can install Lytics via aDrupal module.\n- Active Lytics Account: Verify that you can access an active Lytics account. If you don't have one yet, you canclaim your free developer account.\n- Lytics Dev Tools Chrome Extension: Install ourdeveloper toolsChrome extension to streamline the development and installation process.\n\n## Getting Started Checklist\nGetting started with Lytics is quick and easy! In just a few minutes, you'll be able to set up Lytics and start personalizing your website. We've focused this guide on the 3 essential steps to ensure a positive experience for you and your customers:\n- 1. Install the Lytics tag on your site.\n- 2. Ensuring site content and Lytics are syncing.\n- 3. Create your first personalized message.\n\n## Digging Deeper\nAfter completing the initial checklist outlined above, it's time to explore further avenues for enhancing and utilizing your profiles to their fullest potential. We've broken additional guides into two core focuses:\n\n## Building Profiles\nHere, we'll gain a comprehensive understanding of all available out-of-the-box attributes. Discover how to tag your site and integrate other sources to create robust and comprehensive profiles. This section is divided into:\n\n## Default Attributes & Segments:\n- Profile Attributes\n- Audience Segments\n- Content Collections\n\n## Site Activity & Conversion Tagging:\n- Capturing Website Activity (coming soon)\n- Capture Website Conversion Activity (coming soon)\n\n## Using Profiles\nHere, we'll explore leveraging out-of-the-box personalization SDKs and APIs to deliver optimal user experiences. Discover how to harness Lytics' tools and integrations to create tailored experiences that resonate with your audience. This section covers:\n\n## Guides & Inspiration\n- Surface a lead capture form only to unknown visitors.\n- Surface content recommendations based on interests.\n- Surface a promotional message to high-momentum visitors. (coming soon)\n- Sync profiles & audiences to GA4 or meta. (coming soon)\n- Personalize your site based on behaviors and stored attributes. (coming soon)\n\n## SDK Documentation\n- WebJavaScript SDKPersonalization SDK\n- JavaScript SDK\n- Personalization SDK\n- MobileiOS SDKAndroid SDKReact Native SDK\n- iOS SDK\n- Android SDK\n- React Native SDK\nUpdated6 months ago\n- 1. Account Setup",
    "url": "https://docs.lytics.com/docs/developer-quickstart#default-attributes--segments"
  },
  {
    "title": "Default Attributes",
    "content": "Lytics offers a wide range of pre-packaged user attributes, including automatically generated and customizable ones. Additionally, Lytics employs predictive modeling and machine learning algorithms to provide insights and scores, allowing users to gain a deeper understanding of their audience. The guide below provides an overview of all available attributes and examples to enhance your profiling efforts.\n\n## 👍\nIf you haven't already reviewed ourdocumentation on collecting eventsvia our JavaScript SDK, we highly recommend doing so first. This will give you a better understanding of how data collection works at a high level before delving into the specifics of what can be collected.\n\n## Available Attributes\nThe following attributes are all available out of the box with no customization necessary in all Lytics pricing tiers. Do note that any attributes flagged asComputedcan not be edited directly but are computed based on various factors, including other non-computed attributes.\n\n## 📘\nFor a more comprehensive example of how any of the following attributes can be collected and used for your visitors click thenameof the identifier to access the code examples below.\n\n## Identifiers\nDefault attributes that are used to stitch profiles together. For instance, if you pass anemailalong with the_uid, all events that have only been associated with either identifier will be merged into a single comprehensive profile.\n\n```\n_id\n```\n\n```\n_uid\n```\n\n```\n_uids\n```\n\n```\nemail\n```\n\n```\n[email protected]\n```\n\n```\nuuid\n```\n\n## Details\nDetails encompass all default attributes related to user demographics and general information, including name, phone number, status, etc. It serves as a catch-all for attributes not specifically tied to interactions or behaviors.\n\n```\nname\n```\n\n```\nfirst_name\n```\n\n```\nlast_name\n```\n\n```\ntitle\n```\n\n```\nphone\n```\n\n```\ncell\n```\n\n```\norigin\n```\n\n```\nlanguage\n```\n\n```\nage\n```\n\n```\ncompanies\n```\n\n```\ngender\n```\n\n```\nstatus\n```\n\n```\nuser_attributes\n```\n\n```\ntimezone\n```\n\n```\ncity\n```\n\n```\ncountry\n```\n\n```\nstate\n```\n\n## Meta\nMeta encompasses all system-level information that provides insights into the health and breadth of the profile. This includes data such as creation date, last update timestamp, source information, and other metadata associated with the profile's management and maintenance. Metadata offers a behind-the-scenes view of the profile's overall status and administration.\n\n```\n_created\n```\n\n```\n_last_scored\n```\n\n```\n_modified\n```\n\n```\n_num_aliases\n```\n\n```\n_num_days\n```\n\n```\n_num_events\n```\n\n```\n_num_streams\n```\n\n```\n_streamnames\n```\n\n```\nis_bot\n```\n\n## Behavior\nBehavioral attributes typically cannot be directly managed but represent a set of insights derived from a user's behavior over time. These insights are invaluable when personalizing experiences based on changes in behavior or behaviors indicative of high likelihood. For instance, you might want to present a premium offer to users exhibiting higher momentum than usual. Behavioral attributes enable targeted and timely interventions tailored to user actions and patterns.\n\n```\nscore_consistency\n```\n\n```\nscore_frequency\n```\n\n```\nscore_intensity\n```\n\n```\nscore_maturity\n```\n\n```\nscore_momentum\n```\n\n```\nscore_propensity\n```\n\n```\nscore_quantity\n```\n\n```\nscore_recency\n```\n\n```\nscore_volatility\n```\n\n## Interests\nInterests entail understanding the topics a user is interested in based on their interactions, cross-referenced by deep programmatic analysis of their online activities. This allows for tailored content recommendations and targeted messaging aligned with the user's preferences and engagement history.\n\n```\nlytics_content\n```\n\n## Intelligence\nAttributes classified as intelligence encompass diverse, highly valuable information to facilitate relevant and high-value personalized experiences. Within this category, you'll discover real-time segment membership, values crucial for split testing and experimentation, and direct correlation to our real-time machine learning modeling. These attributes empower dynamic and data-driven decision-making, enhancing the efficacy of personalized marketing strategies.\n\n```\n_segments\n```\n\n```\n_split\n```\n\n```\n_split2\n```\n\n```\nneeds_message\n```\n\n```\nnext_event\n```\n\n```\nsegment_prediction\n```\n\n```\nsegment_prediction_percentile\n```\n\n## Activity\nActivity encompasses the user's engagement across different channels and campaigns, including clicks and conversions. It provides valuable insights into recent interactions, aiding campaign optimization and channel effectiveness assessment.\n\n## General\n\n```\nevent_first_seen\n```\n\n```\nevent_last_seen\n```\n\n```\nchannels\n```\n\n```\ndevices\n```\n\n```\nhourly\n```\n\n```\nhourofweek\n```\n\n```\nlast_active_ts\n```\n\n```\nlast_channel_activities\n```\n\n## Web\n\n```\ndomains\n```\n\n```\nfirstvisit_ts\n```\n\n```\nlastvisit_ts\n```\n\n```\npageviewct\n```\n\n```\nrefdomain\n```\n\n```\nuser_agent\n```\n\n```\nvisitct\n```\n\n```\nvisit_city\n```\n\n```\nvisit_country\n```\n\n```\nvisit_region\n```\n\n```\nform_data\n```\n\n```\nforms_submitted\n```\n\n```\nutm_campaign_last\n```\n\n```\nutm_campaigns\n```\n\n```\nutm_content_last\n```\n\n```\nutm_contents\n```\n\n```\nutm_medium_last\n```\n\n```\nutm_mediums\n```\n\n```\nutm_source_last\n```\n\n```\nutm_sources\n```\n\n```\nutm_term_last\n```\n\n```\nutm_terms\n```\n\n## Campaign\n\n```\nly_hover\n```\n\n```\nly_impressions\n```\n\n```\nly_closes\n```\n\n```\nly_conversions\n```\n\n```\nly_milestones\n```\n\n```\nly_goals\n```\n\n## Examples\n\n## Identifiers\n\n## Lytics ID (_id)\n\n```\n_id\n```\nThis is an automatically generated canonical ID managed by Lytics. It refers to the materialized profile and cannot be customized or overridden.\n\n## Current Lytics Cookie (_uid) and All Lytics Cookies (_uids)\n\n```\n_uid\n```\n\n```\n_uids\n```\n_uid represents the Lytics anonymous 1st party cookie. This value is automatically captured with everyjstag.send()call from the JavaScript tag. The only way to customize this value is to explicitly set the value of _uid, which we do not recommend.\n\n```\njstag.send()\n```\n\n```\njstag.setid(\"somecustomvalue\");\njstag.send();\n```\n\n```\njstag.setid(\"somecustomvalue\");\njstag.send();\n```\n\n## Email (email)\n\n```\nemail\n```\n\n```\njstag.send({\n  email:\"[email protected]\"\n});\n```\n\n```\njstag.send({\n  email:\"[email protected]\"\n});\n```\n\n## Unique User ID (uuid)\n\n```\nuuid\n```\n\n```\njstag.send({\n  uuid:\"someuniqueuserid\"\n});\n```\n\n```\njstag.send({\n  uuid:\"someuniqueuserid\"\n});\n```\n\n## Details\n\n## First Name (first_name)\n\n```\nfirst_name\n```\n\n```\njstag.send({\n  first_name:\"John\",\n});\n```\n\n```\njstag.send({\n  first_name:\"John\",\n});\n```\n\n## Last Name (last_name)\n\n```\nlast_name\n```\n\n```\njstag.send({\n  last_name:\"Doe\",\n});\n```\n\n```\njstag.send({\n  last_name:\"Doe\",\n});\n```\n\n## Title (title)\n\n```\ntitle\n```\n\n```\njstag.send({\n  title:\"President\",\n});\n```\n\n```\njstag.send({\n  title:\"President\",\n});\n```\n\n## Phone (phone)\n\n```\nphone\n```\n\n```\njstag.send({\n  phone:\"555-555-5555\",\n});\n```\n\n```\njstag.send({\n  phone:\"555-555-5555\",\n});\n```\n\n## Cell (cell)\n\n```\ncell\n```\n\n```\njstag.send({\n  cell:\"555-555-5555\",\n});\n```\n\n```\njstag.send({\n  cell:\"555-555-5555\",\n});\n```\n\n## Origin (origin)\n\n```\norigin\n```\n\n```\njstag.send({\n  origin:\"loyalty_2022\",\n});\n```\n\n```\njstag.send({\n  origin:\"loyalty_2022\",\n});\n```\n\n## Language (language)\n\n```\nlanguage\n```\nBy default, the Lytics JavaScript SDK will collect language information based on the browser, but this can be overridden.\n\n```\njstag.send({\n  _ul:\"en-us\",\n});\n```\n\n```\njstag.send({\n  _ul:\"en-us\",\n});\n```\n\n## Age (age)\n\n```\nage\n```\n\n```\njstag.send({\n  age:25,\n});\n```\n\n```\njstag.send({\n  age:25,\n});\n```\n\n## Companies (companies)\n\n```\ncompanies\n```\n\n```\njstag.send({\n  companies:[\"Lytics\", \"Pantheon\"],\n});\n```\n\n```\njstag.send({\n  companies:[\"Lytics\", \"Pantheon\"],\n});\n```\n\n## Gender (gender)\n\n```\ngender\n```\n\n```\njstag.send({\n  gender: \"N/A\",\n})\n```\n\n```\njstag.send({\n  gender: \"N/A\",\n})\n```\n\n## Meta\n\n## Created (_created)\n\n```\n_created\n```\nLytics automatically generate this and represents the oldest event associated with the user.\n\n## Modified (_modified)\n\n```\n_modified\n```\nThis is automatically generated by Lytics and represents the last time the user was modified.\n\n## Last Scored (_last_scored)\n\n```\n_last_scored\n```\nThis is automatically generated by Lytics and represents the last time the users scores were updated.\n\n## Number of Aliases (_num_aliases)\n\n```\n_num_aliases\n```\nThis is automatically generated by Lytics and represents the number of aliases associated with the user.\n\n## Number of Days (_num_days)\n\n```\n_num_days\n```\nThis is automatically generated by Lytics and represents the number of days the user has existed.\n\n## Number of Events (_num_events)\n\n```\n_num_events\n```\nThis is automatically generated by Lytics and represents the number of events associated with the user.\n\n## Number of Streams (_num_streams)\n\n```\n_num_streams\n```\nThis is automatically generated by Lytics and represents the number of streams associated with the user.\n\n## Stream Names (_streamnames)\n\n```\n_streamnames\n```\nThis is automatically generated by Lytics and represents the names of the streams associated with the user.\n\n## User is Bot (is_bot)\n\n```\nis_bot\n```\nThis is automatically generated by Lytics and represents whether the user has been flagged as a bot or not.\n\n## Behavior\nThe following attributes are all computed in real-time as the profile evolves. Each of the behavioral attributes are surfaced as a score between 0 and 100. These scores represent an aggregate summary of the user's behavior across various dimensions: Consistency, Frequency, Intensity, Maturity, Momentum, Propensity, Quantity, Recency, and Volatility.\n\n## Interests\n\n## Lytics Content (lytics_content)\n\n```\nlytics_content\n```\nThe interest attributes are computed in real-time and represent the user's interest in various topics. These topics are generated as a result of the analysis done by the Lytics Interest Engine and then associated with the user based upon their interaction with content on your site.\n\n## Intelligence\n\n## Segment Membership (_segments)\n\n```\n_segments\n```\nThis attribute displays an array of all segments the user is currently a member of. It updates in real-time based on various audience definitions. Lytics offers a range of useful segments out of the box, requiring no additional setup. For detailed information on these audiences, refer to our Developer Tier > Audiences documentation.\n\n## Split & Split2 (_split&_split2)\n\n```\n_split\n```\n\n```\n_split2\n```\nThese attributes are automatically generated by Lytics and represent a random value evenly distributed across users. They are useful for split testing and experimentation.\n\n## Needs Message (needs_message)\n\n```\nneeds_message\n```\nThis attribute is computed in real-time and represents the relative distance between now and the next predicted event. It is stream specific and is useful for understanding when a user is likely to engage again.\n\n## Next Event (next_event)\n\n```\nnext_event\n```\nThis attribute is computed in real-time and represents the next expected event. It is stream specific and is useful for understanding when a user is likely to engage again.\n\n## Lookalike Model Predictions & Lookalike Model Percentiles (segment_prediction&segment_prediction_percentile)\n\n```\nsegment_prediction\n```\n\n```\nsegment_prediction_percentile\n```\nThis attribute is computed in real-time and represents the scores resulting from Lytics Lookalike and SegmentML models. Out-of-the-box, Lytics offers a range of useful models, requiring no additional setup. For detailed information on these models, refer to our Developer Tier > Models documentation.\n\n## Activity\n\n## General\n\n## First Seen & Last Seen (event_first_seen&event_last_seen)\n\n```\nevent_first_seen\n```\n\n```\nevent_last_seen\n```\nBoth of these attributes are automatically populated based upon the_evalue in thejstag.sendpayload. By default Lytics will collect apvevent for each page view and this will automatically populate thefirst_seenandlast_seenattributes. Below is an example of collecting a custom event that would populate these attributes as well.\n\n```\n_e\n```\n\n```\njstag.send\n```\n\n```\npv\n```\n\n```\nfirst_seen\n```\n\n```\nlast_seen\n```\n\n```\njstag.send({\n  _e:\"custom_event\"\n});```\n```\n\n```\njstag.send({\n  _e:\"custom_event\"\n});```\n```\n\n## Channels (channels) [needs update]\n\n```\nchannels\n```\n\n```\njstag.send({\n  _channel:\"web\",\n});\n```\n\n```\njstag.send({\n  _channel:\"web\",\n});\n```\n\n## Devices (devices)\n\n```\ndevices\n```\n\n```\njstag.send({\n  _device:\"desktop\",\n});\n```\n\n```\njstag.send({\n  _device:\"desktop\",\n});\n```\n\n## Hourly (hourly)\n\n```\nhourly\n```\nThis attribute is automatically populated with a count of events per hour for the user.\n\n## Hour of Week (hourofweek)\n\n```\nhourofweek\n```\nThis attribute is automatically populated with a count of events per hour of the week for the user.\n\n## Last Active Timestamp (last_active_ts)\n\n```\nlast_active_ts\n```\nThis attribute is automatically populated with the last time an event was received in any stream for the user.\n\n## Last Channel Activities (last_channel_activities) [needs update]\n\n```\nlast_channel_activities\n```\n\n```\njstag.send({\n  _channel:\"web\",\n});\n```\n\n```\njstag.send({\n  _channel:\"web\",\n});\n```\n\n## Web\n\n## Domains (domains)\n\n```\ndomains\n```\nThis attribute is automatically populated with the domains the user has been active on.\n\n## First Visit Timestamp (firstvisit_ts)\n\n```\nfirstvisit_ts\n```\nThis attribute is automatically populated with the first time the user visited the site and sends data to thedefaultstream.\n\n```\ndefault\n```\n\n## Last Visit Timestamp (lastvisit_ts)\n\n```\nlastvisit_ts\n```\nThis attribute is automatically populated with the last time the user visited the site and sends data to thedefaultstream.\n\n```\ndefault\n```\n\n## Pageview Count (pageviewct)\n\n```\npageviewct\n```\nThis attribute is automatically populated with the number of_pvevents recieved for the user.\n\n```\n_pv\n```\n\n```\njstag.send({\n  _e:\"pv\"\n});\n```\n\n```\njstag.send({\n  _e:\"pv\"\n});\n```\n\n## Referring Domain (refdomain)\n\n```\nrefdomain\n```\nThis attribute is automatically populated with the referring domain for the user.\n\n```\njstag.send({\n  _ref:\"umami.lytics.com\",\n});\n```\n\n```\njstag.send({\n  _ref:\"umami.lytics.com\",\n});\n```\n\n## User Agent (user_agent)\n\n```\nuser_agent\n```\nThis attribute is automatically populated based on the user agent of the browser. This attribute must be turned on in your Lytics account to be collected.\n\n## Visit Count (visitct)\n\n```\nvisitct\n```\nThis attribute is automatically populated with the number of visits the user has had based on presence of the_sesstartkey in an event.\n\n```\n_sesstart\n```\n\n```\njstag.send({\n  _sesstart:1\n});\n```\n\n```\njstag.send({\n  _sesstart:1\n});\n```\n\n## Visit City (visit_city)\n\n```\nvisit_city\n```\nThis attribute is automatically populated with the city the user visited from based upon GeoIP.\n\n## Visit Country (visit_country)\n\n```\nvisit_country\n```\nThis attribute is automatically populated with the country the user visited from based upon GeoIP.\n\n## Visit Region (visit_region)\n\n```\nvisit_region\n```\nThis attribute is automatically populated with the region the user visited from based upon GeoIP.\n\n## Form Data (form_data)\n\n```\nform_data\n```\nForm data is a wildcard attribute that allows you to pass a number of key value pairs that all get stored under theform_dataattribute. This is useful for capturing form submissions.\n\n```\nform_data\n```\n\n```\njstag.send({\n  formdata_fn:\"John\",\n  formdata_ln:\"Doe\",\n  formdata_someotherkey:\"somevalue\"\n});\n```\n\n```\njstag.send({\n  formdata_fn:\"John\",\n  formdata_ln:\"Doe\",\n  formdata_someotherkey:\"somevalue\"\n});\n```\n\n## Forms Submitted (forms_submitted)\n\n```\nforms_submitted\n```\n\n```\njstag.send({\n  form_name:\"newsletter\"\n});\n```\n\n```\njstag.send({\n  form_name:\"newsletter\"\n});\n```\n\n## UTM Campaign Last (utm_campaign_last)\n\n```\nutm_campaign_last\n```\n\n```\njstag.send({\n  utm_campaign:\"holiday\"\n});\n```\n\n```\njstag.send({\n  utm_campaign:\"holiday\"\n});\n```\n\n## UTM Campaigns (utm_campaigns)\n\n```\nutm_campaigns\n```\n\n```\njstag.send({\n  utm_campaign:\"holiday\"\n});\n```\n\n```\njstag.send({\n  utm_campaign:\"holiday\"\n});\n```\n\n## UTM Content Last (utm_content_last)\n\n```\nutm_content_last\n```\n\n```\njstag.send({\n  utm_content:\"recipe-1\"\n});\n```\n\n```\njstag.send({\n  utm_content:\"recipe-1\"\n});\n```\n\n## UTM Contents (utm_contents)\n\n```\nutm_contents\n```\n\n```\njstag.send({\n  utm_content:\"recipe-1\"\n});\n```\n\n```\njstag.send({\n  utm_content:\"recipe-1\"\n});\n```\n\n## UTM Medium Last (utm_medium_last)\n\n```\nutm_medium_last\n```\n\n```\njstag.send({\n  utm_medium:\"article\"\n});\n```\n\n```\njstag.send({\n  utm_medium:\"article\"\n});\n```\n\n## UTM Mediums (utm_mediums)\n\n```\nutm_mediums\n```\n\n```\njstag.send({\n  utm_medium:\"article\"\n});\n```\n\n```\njstag.send({\n  utm_medium:\"article\"\n});\n```\n\n## UTM Source Last (utm_source_last)\n\n```\nutm_source_last\n```\n\n```\njstag.send({\n  utm_source:\"google_ads\"\n});\n```\n\n```\njstag.send({\n  utm_source:\"google_ads\"\n});\n```\n\n## UTM Sources (utm_sources)\n\n```\nutm_sources\n```\n\n```\njstag.send({\n  utm_source:\"google_ads\"\n});\n```\n\n```\njstag.send({\n  utm_source:\"google_ads\"\n});\n```\n\n## UTM Term Last (utm_term_last)\n\n```\nutm_term_last\n```\n\n```\njstag.send({\n  utm_term:\"example\"\n});\n```\n\n```\njstag.send({\n  utm_term:\"example\"\n});\n```\n\n## UTM Terms (utm_terms)\n\n```\nutm_terms\n```\n\n```\njstag.send({\n  utm_term:\"example\"\n});\n```\n\n```\njstag.send({\n  utm_term:\"example\"\n});\n```\n\n## Campaign\n\n## Hover (ly_hover) [needs update]\n\n```\nly_hover\n```\n\n```\njstag.send({\n  pf_widget_id: \"content-rec-modal\",\n  pf-widget-event: \"hover\"\n});\n```\n\n```\njstag.send({\n  pf_widget_id: \"content-rec-modal\",\n  pf-widget-event: \"hover\"\n});\n```\n\n## Impressions (ly_impressions) [needs update]\n\n```\nly_impressions\n```\n\n```\njstag.send({\n  pf_widget_id: \"content-rec-modal\",\n  pf-widget-event: \"show\"\n});\n```\n\n```\njstag.send({\n  pf_widget_id: \"content-rec-modal\",\n  pf-widget-event: \"show\"\n});\n```\n\n## Closes (ly_closes) [needs update]\n\n```\nly_closes\n```\n\n```\njstag.send({\n  pf_widget_id: \"content-rec-modal\",\n  pf-widget-event: \"close\"\n});\n```\n\n```\njstag.send({\n  pf_widget_id: \"content-rec-modal\",\n  pf-widget-event: \"close\"\n});\n```\n\n## Conversions (ly_conversions) [needs update]\n\n```\nly_conversions\n```\n\n```\njstag.send({\n  pf_widget_id: \"content-rec-modal\",\n  pf-widget-event: \"conversion\"\n});\n```\n\n```\njstag.send({\n  pf_widget_id: \"content-rec-modal\",\n  pf-widget-event: \"conversion\"\n});\n```\n\n## Milestones (ly_milestones) [needs update]\n\n```\nly_milestones\n```\n\n```\njstag.send({\n  pf_widget_id: \"engaged-donation-page\",\n  pf-widget-event: \"milestone\"\n});\n```\n\n```\njstag.send({\n  pf_widget_id: \"engaged-donation-page\",\n  pf-widget-event: \"milestone\"\n});\n```\n\n## Goals (ly_goals) [needs update]\n\n```\nly_goals\n```\n\n```\njstag.send({\n  pf_widget_id: \"made-donation\",\n  pf-widget-event: \"goal\"\n});\n```\n\n```\njstag.send({\n  pf_widget_id: \"made-donation\",\n  pf-widget-event: \"goal\"\n});\n```\nUpdated12 months ago\n- Default Segments",
    "url": "https://docs.lytics.com/docs/developer-attributes"
  },
  {
    "title": "Default Segments",
    "content": "Categorizing users based on their behaviors and characteristics is pivotal for effective audience targeting and personalization strategies. Lytics audience segmentation offers a powerful tool for organizing users into meaningful groups based on shared attributes or behaviors. This section provides a comprehensive overview of all audience segments that are provided out-of-the-box.\n\n## Available Segments (Audiences)\n\n## 👍\nLytics audience segments apply predefined rules to each user profile as they update. Membership in these segments is maintained in real-time and can trigger subsequent actions when users enter or exit the segment.\nThe following audience segments are all available out of the box, with no customization necessary in all Lytics pricing tiers.\n\n```\nall\n```\n\n```\nFILTER *\n```\n\n```\nanonymous_profiles_30_days\n```\n\n```\nFILTER AND ( _modified <= \"now-30d\", _num_aliases = 1, EXISTS '_uids' ) FROM user ALIAS anonymous_profiles_30_days\n```\n\n```\nanonymous_profiles_60_days\n```\n\n```\nFILTER AND ( _modified <= \"now-60d\", _num_aliases = 1, EXISTS '_uids' ) FROM user ALIAS anonymous_profiles_60_days\n```\n\n```\nanonymous_profiles_90_days\n```\n\n```\nFILTER AND ( _modified <= \"now-90d\", _num_aliases = 1, EXISTS '_uids' ) FROM user ALIAS anonymous_profiles_90_days\n```\n\n```\nanonymous_profiles\n```\n\n```\nFILTER AND ( _num_aliases = 1, EXISTS '_uids' ) FROM user ALIAS default_anon_seg\n```\n\n```\nconnected_customer_segment\n```\n\n```\nFILTER _forceinvalidsegmentfield = 1 FROM user ALIAS connected_customer_segment\n```\n\n```\ndefault_unhealthy_profiles\n```\n\n```\nFILTER _profile_processing_failure = true FROM user ALIAS default_unhealthy_profiles\n```\n\n```\nly_at_risk\n```\n\n```\nFILTER AND (score_momentum >= 10, score_momentum <= 30)\n```\n\n```\nly_binge_user\n```\n\n```\nFILTER AND (score_frequency <= 20, score_intensity >= 50)\n```\n\n```\nly_casual_visitor\n```\n\n```\nFILTER score_intensity < 25\n```\n\n```\nly_deeply_engaged_users\n```\n\n```\nFILTER score_intensity > 75\n```\n\n```\nly_first_time_visitor\n```\n\n```\nFILTER visitct = 1\n```\n\n```\nly_frequent_user\n```\n\n```\nFILTER score_frequency > 65\n```\n\n```\nly_from_email\n```\n\n```\nFILTER utm_mediums INTERSECTS ( \"email\" )\n```\n\n```\nly_from_paid\n```\n\n```\nFILTER utm_mediums INTERSECTS ( \"cpc\", \"ppc\" )\n```\n\n```\nly_from_social\n```\n\n```\nFILTER utm_mediums INTERSECTS ( \"social\", \"twitter\", \"facebook\", \"pinterest\", \"instagram\" )\n```\n\n```\nly_has_visited_mobile_web\n```\n\n```\nFILTER EXISTS is_mobile\n```\n\n```\nly_has_visited_web\n```\n\n```\nFILTER channels INTERSECTS ( \"web\" )\n```\n\n```\nly_infrequent_user\n```\n\n```\nFILTER score_frequency < 35\n```\n\n```\nly_international_visitor\n```\n\n```\nFILTER AND ( EXISTS visit_country, visit_country NOT IN (\"US\") )\n```\n\n```\nly_known_email\n```\n\n```\nFILTER EXISTS email\n```\n\n```\nly_moderately_engaged_visitor\n```\n\n```\nFILTER AND (score_intensity > 24, score_intensity < 76)\n```\n\n```\nly_moderately_frequent_user\n```\n\n```\nFILTER AND (score_frequency > 34, score_frequency < 76)\n```\n\n```\nly_multi_session_visitor\n```\n\n```\nFILTER visitct > 1\n```\n\n```\nly_peruser\n```\n\n```\nFILTER AND (score_frequency >= 70, score_intensity <= 20)\n```\n\n```\nly_repeat_visitor\n```\n\n```\nFILTER visitct > 1\n```\n\n```\nly_reporting_casual_visitors\n```\n\n```\nFILTER score_intensity < 25\n```\n\n```\nly_reporting_deeply_engaged_users\n```\n\n```\nFILTER score_intensity > 75\n```\n\n```\nly_reporting_frequent_users\n```\n\n```\nFILTER score_frequency > 65\n```\n\n```\nly_reporting_from_email\n```\n\n```\nFILTER utm_mediums intersects ( \"email\" )\n```\n\n```\nly_reporting_from_facebook\n```\n\n```\nFILTER utm_sources intersects (\"Facebook\", \"facebook\")\n```\n\n```\nly_reporting_from_google\n```\n\n```\nFILTER utm_sources intersects (\"Google\", \"Google Search\", \"Google Ads\", \"gads\", \"google\", \"google-search\")\n```\n\n```\nly_reporting_from_paid\n```\n\n```\nFILTER utm_mediums intersects ( \"cpc\", \"ppc\" )\n```\n\n```\nly_reporting_from_social\n```\n\n```\nFILTER utm_mediums intersects ( \"social\", \"twitter\", \"facebook\", \"pinterest\", \"instagram\" )\n```\n\n```\nly_reporting_has_visited_mobile_web\n```\n\n```\nFILTER EXISTS is_mobile\n```\n\n```\nly_reporting_has_visited_web\n```\n\n```\nFILTER channels INTERSECTS ( \"web\" )\n```\n\n```\nly_reporting_infrequent_users\n```\n\n```\nFILTER score_frequency < 35\n```\n\n```\nly_reporting_last_visit_within_3_months\n```\n\n```\nFILTER lastvisit_ts > \"now-3M\"\n```\n\n```\nly_reporting_last_visit_within_day\n```\n\n```\nFILTER lastvisit_ts > \"now-1d\"\n```\n\n```\nly_reporting_last_visit_within_month\n```\n\n```\nFILTER lastvisit_ts > \"now-1M\"\n```\n\n```\nly_reporting_last_visit_within_week\n```\n\n```\nFILTER lastvisit_ts > \"now-1w\"\n```\n\n```\nly_reporting_multi_session_visitor\n```\n\n```\nFILTER visitct > 1\n```\n\n```\nly_reporting_single_page_visitor\n```\n\n```\nFILTER pageviewct = 1\n```\n\n```\nly_single_page_visitor\n```\n\n```\nFILTER pageviewct = 1\n```\n\n```\nly_unknown_email\n```\n\n```\nFILTER NOT EXISTS email\n```\n\n```\nly_us_visitor\n```\n\n```\nFILTER visit_country IN (\"US\")\n```\n\n```\nly_uses_android\n```\n\n```\nFILTER devices INTERSECTS ( \"Android\" )\n```\n\n```\nly_uses_desktop\n```\n\n```\nFILTER devices INTERSECTS ( \"desktop\" )\n```\n\n```\nly_uses_ios\n```\n\n```\nFILTER devices INTERSECTS ( \"IOS\" )\n```\n\n```\nly_uses_mobile\n```\n\n```\nFILTER devices INTERSECTS ( \"Android\", \"Blackberry\", \"IOS\", \"WinMobile\" )\n```\n\n```\nly_uses_other\n```\n\n```\nFILTER devices INTERSECTS ( \"Blackberry\", \"WinMobile\", \"other\" )\n```\n\n```\nsmt_active\n```\n\n```\nFILTER AND ( score_momentum > 10, EXISTS score_momentum,\n```\n\n```\n< \"now-1w\", NOT AND ( score_frequency <= 5, score_intensity == 0, score_momentum == 0, score_quantity <= 3 ), NOT AND ( score_quantity >= 50, score_frequency >= 50, score_intensity >= 25, score_momentum >= 40 ) ) FROM user\n```\n\n```\nsmt_dormant\n```\n\n```\nFILTER AND ( AND ( score_frequency <= 5, score_intensity == 0, score_momentum == 0, score_quantity <= 3 ), EXISTS score_momentum,\n```\n\n```\n< \"now-1w\" ) FROM user\n```\n\n```\nsmt_inactive\n```\n\n```\nFILTER AND ( score_momentum <= 10, EXISTS score_momentum,\n```\n\n```\n< \"now-1w\", NOT AND ( score_frequency <= 5, score_intensity == 0, score_momentum == 0, score_quantity <= 3 ) ) FROM user\n```\n\n```\nsmt_new\n```\n\n```\nFILTER\n```\n\n```\n>= \"now-1w\" FROM user\n```\n\n```\nsmt_power\n```\n\n```\nFILTER AND ( AND ( score_quantity >= 50, score_frequency >= 50, score_intensity >= 25, score_momentum >= 40 ), EXISTS score_momentum,\n```\n\n```\n< \"now-1w\", NOT AND ( score_frequency <= 5, score_intensity == 0, score_momentum == 0, score_quantity <= 3 ), score_momentum > 10 ) FROM user\n```\n\n```\nsmt_unscored\n```\n\n```\nFILTER AND ( NOT EXISTS score_momentum, _created < \"now-1w\" )\n```\nUpdated7 months ago",
    "url": "https://docs.lytics.com/docs/developer-segments"
  }
]