{
  "title": " Engage Introduction | Segment Documentation",
  "content": "- Home\n- /\n- Engage Introduction\n\n## Engage Introduction\nEngage Foundations requires a Business tier account and includes Unify.See theavailable plans, orcontact Support.\nOn this page\n- What can you do with Engage?\n- Market to customers with Engage Premier and Channels\nPowered by real-time data, Twilio Engage is a customizable personalization platform with which you can build, enrich, and activate Audiences.\nEngage Channels builds on top of these Audiences, helping you connect with and market to your customers through email, SMS, and WhatsApp campaigns.\n\n## What can you do with Engage?\n\n## Create unified customer profiles\nEngage usesSegment Identity Resolutionto take event data from across devices and channels and intelligently merge it into complete user- or account-level profiles. This gives your organization a single view of your customer base. To learn more, read theIdentity Resolution documentation.\n\n## Personalizing customer interactions\nSupport teams rely on Segment's unified profiles to make real-time and informed decisions about customers when answering tickets or taking support calls. Read about how the support team at Frame.io reduced ticket response time by 80%.\n\n## Enrich profiles with new traits\nAdd detail to user profiles with new traits and use them to power personalized marketing campaigns. You can add new traits to your user or account profiles in Engage using:\n- Computed Traits:Use the Engage drag-and-drop interface to build per-user (B2C) or per-account (B2B) metrics on user profiles (for example, “lifetime value” or “lead score”).\n- SQL Traits:Run custom queries on your data warehouse using the Engage SQL editor, and import the results into Segment. With SQL Traits, you can pull rich, uncaptured user data back into Segment.\n- Predictions:Predict the likelihood that users will perform custom events tracked in Segment, like LTV, churn, and purchase.\n\n## Build Audiences\nCreate lists of users or accounts that match specific criteria. For example, after creating aninactive accountsaudience that lists paid accounts with no logins in 60 days, you can push the audience to your analytics tools or send an SMS, email, or WhatsApp campaign with Engage Channels. Learn more aboutEngage audiences.\n\n```\ninactive accounts\n```\n\n## Sync audiences to downstream tools\nOnce you create your Computed Traits and Audiences, Engage sends them to your Segment Destinations in just a few clicks. You can use these Traits and Audiences to personalize messages across channels, optimize ad spend, and improve targeting. You can also use theProfile APIto build in-app and onsite personalization. Learn more aboutusing Engage dataand theProfile API.\n\n## Personalizing marketing campaigns\nMarketing teams use Engage to run real-time multi-channel marketing campaigns based off specific user attributes they've computed in Engage. Read about how Drift used Engage to increase prospect engagement by 150% in two months.\n\n## Market to customers with Engage Premier and Channels\nTo send email, SMS, and WhatsApp campaigns with Engage Channels, you’ll connect aTwilio messaging service,SendGrid subuser account, andWhatsApp messaging serviceto your Segment Engage space. Use existing accounts, or create new ones.\nView theonboarding stepsfor more on how to connect Twilio and SendGrid accounts.\n\n## Send email, SMS, and WhatsApp messages in Journeys\nUse Engage to build email, SMS, and WhatsApp campaigns withinJourneys. Send campaigns tosubscribed usersbased on event behavior and profile traits. Withmessage analytics, you can track the performance of your campaigns.\n- Send Email:Build email campaignswith existing templates, or create a new email template within Journeys. Before you send the email, test the template and setconversion goals.\nSend Email:Build email campaignswith existing templates, or create a new email template within Journeys. Before you send the email, test the template and setconversion goals.\n- Send SMS messages:Build SMS campaignsto message users in real-time as a step in a Journey. For example, create an abandoned cart campaign that texts users a reminder to complete their purchase, along with a promo code. Addmerge tagsand set conversion goals.\nSend SMS messages:Build SMS campaignsto message users in real-time as a step in a Journey. For example, create an abandoned cart campaign that texts users a reminder to complete their purchase, along with a promo code. Addmerge tagsand set conversion goals.\n- Send WhatsApp messages:Build WhatsApp campaignsthat deliver messages to your customers on the world’s most used messaging app.\nSend WhatsApp messages:Build WhatsApp campaignsthat deliver messages to your customers on the world’s most used messaging app.\nTo learn more, visit theCSV Uploaderdocumentation.\n\n## Build Email, SMS, and WhatsApp message templates\nBuild personalizedemail,SMS, andWhatsApptemplates in Twilio Engage for use in your campaigns. Design email templates with a WYSIWYGDrag and Drop Editoror theHTML Editor. Engage saves the templates for you to preview, edit, and reuse throughout Journeys.\n\n## Personalize with merge tags\nInsert real-time user profile traits from merge tags to personalize each message. For example, address recipients by name or highlight new products from a user’s favorite brand.\n\n## CSV Uploader\nUse the CSV uploader to add or update user profiles andsubscription states. To learn more, visit theCSV Uploaderdocumentation.\n\n## User subscriptions\nSet user subscription states in two ways:\n- Upload a CSV filewith lists of users along with their phone, email, and WhatsApp subscription states.\n- Programmatically with Segment’sPublic API\nUse Engage to add subscription states to user email addresses and phone numbers. Subscription states help determine which users you can send campaigns to in Engage. You can set user subscription states with aCSV file upload, or programmatically with Segment’sPublic API.\n\n## Message Analytics\nWith analytics in Engage, you can monitor real-time conversion data. Track message performance and customer interaction beyond clicks and opens. Use campaign dashboards to view events such asEmail Delivered,Unsubscribed,Spam Reported, and more.\n\n```\nEmail Delivered\n```\n\n```\nUnsubscribed\n```\n\n```\nSpam Reported\n```\n\n## Conversion Goals\nFor each message step in a Journey, you can set conversion conditions with events and properties in your Segment space. Then, define a duration after message delivery to track goals.\nFor example, track users who perform the eventOrder Completedwith a promo code that you send them.\nVisitMessage Analyticsto learn more.\nThis page was last modified: 23 Aug 2023\n\n## Need support?\nQuestions? Problems? Need more info? Contact Segment Support for assistance!\n\n## Help improve these docs!\n\n## Was this page helpful?\nThanks for your feedback!\nCan we improve this doc?Send us feedback!\n\n## Get started with Segment",
  "url": "https://segment.com/docs/engage/"
}