{
  "title": " Spec Overview | Segment Documentation",
  "content": "- Home\n- /\n- Connections\n- /\n- Spec Overview\n\n## Spec Overview\nThe Segment Spec provides guidance on meaningful data to capture, and the best format for it, across all of Segment’s libraries and APIs. If you implement Segment using these formats, it’s simple to translate your data to downstream tools.\n\n## Segment University: The Segment Methods\nCheck out our high-level overview of these APIs in Segment University. (Must be logged in to access.)\nEvent and Product Limits\nEvents ingested by Segment are subject to definedProduct Limits.\nThe Segment Spec has three components.\nFirst, itoutlines the semantic definition of the customer data Segment captures across all libraries and APIs.  There are six API calls in the Spec. They each represent a distinct type of semantic information about a customer. Every call shares the samecommon fields.\n- APIsIdentify: who is the customer?Track: what are they doing?Page: what web page are they on?Screen: what app screen are they on?Group: what account or organization are they part of?Alias: what was their past identity?\n- Identify: who is the customer?\n- Track: what are they doing?\n- Page: what web page are they on?\n- Screen: what app screen are they on?\n- Group: what account or organization are they part of?\n- Alias: what was their past identity?\nSecond, itdetails the event data Segment captures across some cloud sources and destinations.\n- Cloud Sources and DestinationsEmailLive ChatA/B Testing\n- Email\n- Live Chat\n- A/B Testing\nThird, itshares the events Segment recommends you track for a particular industry based on experience working with thousands of customers. When you respect these specs, Segment maps these events to particular features within end destinations like Google Analytics and Facebook Ads.\n- Industry SpecsMobileE-CommerceVideoB2B SaaSAI Copilot\n- Mobile\n- E-Commerce\n- Video\n- B2B SaaS\n- AI Copilot\nThis page was last modified: 18 Apr 2024\n\n## Need support?\nQuestions? Problems? Need more info? Contact Segment Support for assistance!\n\n## Help improve these docs!\n\n## Was this page helpful?\nThanks for your feedback!\nCan we improve this doc?Send us feedback!\n\n## Get started with Segment",
  "url": "https://segment.com/docs/connections/spec/"
}