{
  "title": " How Segment Works | Segment Documentation",
  "content": "- Home\n- /\n- Getting started\n- /\n- How Segment Works\n\n## How Segment Works\nOn this page\n- Overview\n- Sources for collecting data\n- How you can track data\n- The Segment Methods\n- Where you can send data\nIn a nutshell, the Segment libraries (Sources) generate messages about what’s happening in your site or app, and send them to the Segment servers. Segment then translates the content of those messages into different formats for use by other tools (which Segment callsDestinations), and sends the translated messages to those tools. The Segment servers also archive a copy of the data, and cansend data to your storage systems(such as databases, warehouses, or bulk-storage buckets).\n\n## Overview\nSegment Spec methodsare how you collect interaction data from your interfaces, and theSourcesare what you package with your interfaces to collect and route the data.\nOnce you’ve collected your interaction data, there are several different actions you can take:\n- Send it toDestinations, which receive the data from any number of sources in real time\n- Send it toWarehousesand other bulk storage tools, which hold your raw event schemas and update on regular intervals\n- Enrich the customer data you collect byconnecting data from your other tools, and then collect it in a warehouse to monitor performance, inform decision-making processes, and create uniquely customized user experiences.\n- UseEngage, Twilio’s marketing automation tool, to build marketing campaigns personalized to your audience.\n\n## Sources for collecting data\nYou can collect data by implementing Segment’s tracking libraries as your Sources:\n- Analytics.js, the Segment JavaScript source, is the most powerful way to track customer data from a website. Segment recommends it as the default installation for any website.\n- The Segment Mobile SDKsare the best way to simplify tracking in your iOS, Android, and Xamarin apps. Segment recommends them over server-side sources as the default installation for any mobile app.\n- Server-side sourceslet you send analytics data directly from your servers when client-side tracking doesn’t work, or when you’re sending mission-critical data like revenues.\n\n## Sources for unique cases\nSegment also offers these other source libraries to cover less straightforward cases:\n- Use theHTTP Tracking APIif Segment doesn’t offer a library for your specific environment yet.\n- ThePixel Tracking APIlets you track events from environments where you can’t execute code - for example, tracking when an email was opened.\n- TheQuerystring APIlets you use querystrings to load API methods when a user first visits a Segment-enabled site. Use this API for tracking events like email clicks and identifying users associated with those clicks on the destination page.\n\n## Cloud App Sources\nSegment also offersCloud App Sourcesto integrate data from your third-party tools:\n- Object Cloud Sourcescan import third party tool data directly into your Segment warehouse, but can’t stream that data into your other Segment destinations. Make sure you enable a Segment warehouse before you enable an object cloud source.\n- Event Cloud Sourcesdon’t just import third party tool data into your Segment warehouse, they also send event data in real-time to your other Segment destinations. You don’t need to set up a data warehouse to send Event Cloud Source data to your destinations.\n\n## How you can track data\nSegment supports several ways to implement tracking. The two most common are to usedevice-basedorserver-basedlibraries. You can use Segment’s device-based libraries, such as JavaScript, iOS, and Android, to make calls on users’ browsers or mobile devices. You can also track data with Segment’s server-based libraries, such as Node, Python, or PHP, where the calls are triggered on your own servers and then sent to the Segment servers.\nWhen you collect data using device-based libraries, you can choose between these two different connection modes:\n- Cloud-modeis where the library sends the data directly to the Segment servers which then translate and forward it.\n- Device-modeis where the library sends the data both directly to the Segment servers, and also to the servers for the destination tool. Device-mode sometimes requires someadditional set-up steps, but can unlock rich device data.\nAlthough there are some tradeoffs between the two approaches, neither is better than the other, and Segment recommends that you implement a mix of both. In general, more direct interaction data is available using a device-based library, but server-based collection is more secure, reliable, and can’t be blocked by ad blockers.\n\n## The Segment Methods\nThe Segment libraries generate messages about what happens on your interface, translate those messages into different formats for use by destinations, and transmit the messages to those tools.\nThere are severaltracking API methods, that you can call to generate messages. The four most important methods are:\n- Identify: Who is the user?\n- PageandScreen: What web page or app screen are they on?\n- Track: What are they doing?\nEvery call shares the samecommon fields. When you use these methodsas intended, it allows Segment to detect a specific type of data and correctly translate it to send it on to downstream destinations.\n\n## Where you can send data\nSegment maintains a catalog of destinations where you can send your data.\n\n## backGetting Started Overview\n\n## nextA simple Segment installation\nWalk through a disposable, demo implementation.\nThis page was last modified: 21 Apr 2023\n\n## Need support?\nQuestions? Problems? Need more info? Contact Segment Support for assistance!\n\n## Help improve these docs!\n\n## Was this page helpful?\nThanks for your feedback!\nCan we improve this doc?Send us feedback!\n\n## Get started with Segment",
  "url": "https://segment.com/docs/getting-started/01-what-is-segment/"
}