{
  "title": " Connections Overview | Segment Documentation",
  "content": "- Home\n- /\n- Connections Overview\n\n## Connections Overview\nOn this page\n- Sources\n- Destinations\n- Warehouses\n- Information on sources and destinations pages\n- FAQs\nConnections is Segment’s core product offering: you can collect event data from your mobile apps, websites, and servers with one API, then pull in contextual data from cloud apps like your CRM, payment systems, and internal databases to build a unified picture of your customers.\n\n## Sources\nIn Segment, you create a source (or more than one!) for each website or app you want to track. Wehighly recommendcreating a Source for each unique source of data (each site, app, or server), though this isn’t required.\nSources belong to a workspace, and the URL for a source looks something like this:https://segment.com/<my-workspace>/sources/<my-source-name>/\n\n```\nhttps://segment.com/<my-workspace>/sources/<my-source-name>/\n```\nYou can create new sources using the button in the workspace view. Each source you create has a write key, which is used to send data to that source. For example, to loadanalytics.js, the Segment JavaScript libraryon your page, the snippet on theQuickstart Guideincludes:\n\n```\nanalytics.js\n```\n\n```\nanalytics.load(\"YOUR_WRITE_KEY\");\n```\n\n```\nanalytics.load(\"YOUR_WRITE_KEY\");\n```\nLearn more about sources from thesources overview page.\n\n## Destinations\nDestinations are business tools or apps that you can connect to the data flowing through Segment. Some of Segment’s most popular destinations are Google Analytics, Mixpanel, Kissmetrics, Customer.io, Intercom, and KeenIO.\nAll of these tools run on the same data: who are your customers and what are they doing? But each tool requires that you send that data in a slightly different format, which means that you’d have to write code to track all of this information, again and again, for each tool, on each page of your app or website.\nEnter Segment. Do it once.\nSegment eliminates this process by introducing an abstraction layer. You send your data to Segment, and Segment understands how to translate it so we can send it along to any destination. You enable destinations from the catalog in the Segment App, and user data immediately starts flowing into those tools. No extra code required!\nSegment supports many categories of destinations, from advertising to marketing, email to customer support, CRM to user testing, and even data warehouses. You can view a complete list of availabledestinationsor check out thedestination pagefor a searchable list broken down by category.\n\n## Warehouses\nA warehouse is a central repository of data collected from one or more sources. This is what commonly comes to mind when you think about a relational database: structured data that fits neatly into rows and columns.\nIn Segment, a Warehouse is a special type of destination. Instead of streaming data to the destination all the time, we load data to them in bulk at regular intervals. When we load data, we insert and update events and objects, and automatically adjust their schema to fit the data you’ve sent to Segment.\n\n## Reverse ETL\nWithReverse ETL, your data warehouse acts as your source, enabling you to send data from your warehouse to your destinations.\n\n## Information on sources and destinations pages\nThe Sources and Destinations pages allow each user to decide what information appears in their personal view for each page.\nOn both pages, you can click the stack icon in the upper right-hand corner of the table to see and select Source properties to show. You can select up to five columns of properties.\nThe following information is available for Sources:\n- Status\n- Environment\n- Destinations\n- Type\n- Category\n- Created At\n- Created By\nOn the Destinations page, you can choose among the following properties:\n- Status\n- Created At\n- Type\n- Sources\n- Category\nYou can then sort or filter each column to just the values you care about, by clicking on the arrow next to each displayed column.\n\n## FAQs\n\n## My source was disabled and it wasn’t done by anyone in my workspace\nSources without any enabled destinations are auto-disabled after 14 days. However, the workspace owner is notified by email before Segment disables the source. Data that flows into Segment but does not flow to any downstream tools is not valuable to you and unnecessarily takes up space.\nSegment understands there may be cases to keep a source active. If you’d like to add your sources to an exception list, you can do so by filling out thisAirtable form.\n\n## Can I request Segment add an integration tool?\nYes, you are able to submit an integration request here https://segment.com/requests/integrations/.\nThis page was last modified: 29 Feb 2024\n\n## Need support?\nQuestions? Problems? Need more info? Contact Segment Support for assistance!\n\n## Help improve these docs!\n\n## Was this page helpful?\nThanks for your feedback!\nCan we improve this doc?Send us feedback!\n\n## Get started with Segment",
  "url": "https://segment.com/docs/connections/#sources"
}