{
  "title": " Sources Overview | Segment Documentation",
  "content": "- Home\n- /\n- Connections\n- /\n- Sources Overview\n\n## Sources Overview\nOn this page\n- What is a source?\n- Types of sources\n- Event streams sources\n- Cloud app sources\n- Reverse ETL sources\n- Create a source\n- Library tiers\nRelated content\n- Sources Catalog\n\n## What is a source?\nA source is a website, server library, mobile SDK, or cloud application which can send data into Segment. It’s where your data originates. Add a source to collect data to understand who your customers are and how they’re using your product. Create a source for each website or app you want to track. While it’s not required that you have a single source for each server, site, or app, you should create a source for each unique source of data.\nEach source you create has a write key, which is used to send data to that source. For example, to loadanalytics.js, the Segment JavaScript libraryon your page, the snippet on theQuickstart Guideincludes:\n\n```\nanalytics.js\n```\n\n```\nanalytics.identify('user_123',{email:'jane.kim@example.com',name:'Jane Kim'});\n```\n\n```\nanalytics.identify('user_123',{email:'jane.kim@example.com',name:'Jane Kim'});\n```\nIf you don't see the source you're looking for in our catalog\nIf a tool is not listed as a supported source in Segment’scatalog, then it is not possible to incorporate the integration out-of-the-box within a Segment workspace. However, as an alternative, you can use theHTTP APIsource to collect data from the tool’s API. You can also useFunctionsto send or receive data from other tools.\n\n## Types of sources\nSegment has three types of sources:\n- Event streams\n- Cloud app sources\n- Reverse ETL\n\n## Event streams sources\nEvent streams sources collect data from your website or app to monitor user actions. These sources includewebsite libraries,mobile, andserver sources.\n\n## Source Overview\nThe Source Overview page for an event stream source shows you apipeline viewof all events Segment receives from your source, events that failed on ingest, events that are filtered at the source level, and “eligible events”, which are the events that will flow into your destinations. If you select one of the steps in the pipeline view, you can see a line chart that reflects the fluctuations in volume alongside abreakdown tablethat has more details about the events impacted by the selected step.\n\n## Pipeline view\nThe pipeline view shows each of the four steps Segment encounters when processing data from your source:\n- Events successfully received: All events that Segment received from your source.\n- Failed on ingest: Events that failed at the Tracking API level. For more information about errors that might cause events to fail on ingest, see Delivery Overview’sTroubleshootingdocumentation.\n- Filtered at source: Events that were filtered out by source schema controls, Tracking Plans, or a common JSON schema.\n- Eligible events: Eligible events are the events that flow downstream to your Segment destinations. This value is read-only, but you can see the events that flow downstream to a particular destination usingDelivery Overview.\nYou can use the time picker located on the Source Overview page to specify a time period (last 10 minutes, 1 hour, 24 hours, 7 days, 2 weeks, or a custom date range over the last two weeks) for which you’d like to see data. Segment sets the time picker to show data for the last 24 hours by default.\n\n## Breakdown table\nThe breakdown table displays three tabs,Event type,Event name, andApp version.\n- Event type: The Segment Spec event type (Track call vs. Identify call, for example).This tab also contains a “% change” metric, which displays how the event counts differ from the last comparable time range, represented as a percentage.\n- Event name: The event name, provided by you or the source.\n- App version: The app/release version, provided by you or the source.\nEach of these tabs displays an event count, which is the total number of events that Segment received in a particular step.\nThe Unnamed or batched events under theEvent Nametab is a collection of all identify and page/screen calls in the source.\n\n## Website libraries\nAnalytics.js, the JavaScript library, is the most powerful way to track customer data from your website. If you’re just starting out, Segment recommends it over server-side libraries as the simplest installation for any website.\n\n## The Analytics Quickstart Guide\nAnalytics and data collection is a very broad topic and it can be quite overwhelming. How do you get started?\n\n## Mobile\nSegment’s Mobile SDKs are the best way to simplify your iOS, Android, and Xamarin app tracking. Try them over server-side sources as the default installation for any mobile app.\n- AMP\n- Android\n- Android Wear\n- iOS\n- Kotlin\n- React Native\n- Swift\n- Xamarin\nAnalytics-Flutter library\nThe Analytics-Flutter library is currently only available in pilot phase and is governed by Segment’sFirst Access and Beta Preview Terms. If you’d like to try out this library, access theAnalytics-Flutter GitHub repository.\n\n## Server\nSegment’s server-side sources let you send analytics data directly from your servers. Segment recommends tracking from your servers when device-mode tracking (tracking on the client) doesn’t work. Check out theguide on server-side trackingif you’re not sure whether it makes sense for your use case.\n- Clojure\n- Go\n- Java\n- Node.js\n- PHP\n- Python\n- Ruby\n- .NET\nCloud-mode tracking\nServer-side data management is when tag sends data to the Segment servers, which then passes that data to the destination system.\n\n## Cloud app sources\nCloud app sources empower you to pull together data from all of your different third-party tools into a Segment warehouse or to your other enabled integrated tools. They send data about your users from your connected web apps. There are two types of Cloud Apps:Object cloud sourcesandEvent cloud sources.\n\n## Comparing Cloud Sources\nWondering which cloud-apps send which types of data? Check out the Cloud Sources comparison.\n\n## Object Cloud Sources\nThese Cloud App Sources can export data from its third party tool and import it directly into your Segment warehouse. Make sure you have a Segment warehouse enabled before you enable any of the following sources:\n- Facebook Ads\nFacebook Ads\n- Google Ads\nGoogle Ads\n- HubSpot\nHubSpot\n- Intercom\nIntercom\n- Mailchimp\nMailchimp\n- Mandrill\nMandrill\n- Marketo\nMarketo\n- Salesforce\nSalesforce\n- Salesforce Marketing Cloud\nSalesforce Marketing Cloud\n- SendGrid\nSendGrid\n- Stripe\nStripe\n- Twilio\nTwilio\n- Zendesk\nZendesk\n\n## Event Cloud Sources\nThese Cloud App Sources can not only export data into your Segment warehouse, but they canalsofederate the exported data into your other enabled Segment integrations:\n- ActiveCampaign\nActiveCampaign\n- Aircall\nAircall\n- Airship\nAirship\n- Alloy Flow\nAlloy Flow\n- Amazon S3\nAmazon S3\n- Amplitude Cohorts\nAmplitude Cohorts\n- Antavo\nAntavo\n- Authvia\nAuthvia\n- AutopilotHQ\nAutopilotHQ\n- Beamer\nBeamer\n- Blip\nBlip\n- Bluedot\nBluedot\n- Blueshift\nBlueshift\n- Braze\nBraze\n- Candu\nCandu\n- Chatlio\nChatlio\n- CleverTap\nCleverTap\n- CommandBar\nCommandBar\n- ConfigCat\nConfigCat\n- Customer.io\nCustomer.io\n- Delighted\nDelighted\n- Drip\nDrip\n- Dub\nDub\n- Elastic Path\nElastic Path\n- Elastic Path CX Studio\nElastic Path CX Studio\n- Facebook Lead Ads\nFacebook Lead Ads\n- Factual Engine\nFactual Engine\n- Foursquare Movement\nFoursquare Movement\n- Freshchat\nFreshchat\n- Friendbuy\nFriendbuy\n- Gladly\nGladly\n- GWEN Webhooks\nGWEN Webhooks\n- Herow\nHerow\n- IBM Watson Assistant\nIBM Watson Assistant\n- Inflection\nInflection\n- Insider\nInsider\n- Iterable\nIterable\n- Jebbit\nJebbit\n- Klaviyo\nKlaviyo\n- Klenty\nKlenty\n- LaunchDarkly\nLaunchDarkly\n- Leanplum\nLeanplum\n- Listrak\nListrak\n- LiveLike (Source)\nLiveLike (Source)\n- Looker\nLooker\n- Mailjet\nMailjet\n- Mailmodo\nMailmodo\n- Mixpanel Cohorts\nMixpanel Cohorts\n- MoEngage (Source)\nMoEngage (Source)\n- Moesif API Analytics\nMoesif API Analytics\n- Navattic\nNavattic\n- Nudgespot\nNudgespot\n- One Creation\nOne Creation\n- OneSignal\nOneSignal\n- OneTrust\nOneTrust\n- Paytronix\nPaytronix\n- Pendo\nPendo\n- ProveSource\nProveSource\n- Pushwoosh Source\nPushwoosh Source\n- Qualtrics\nQualtrics\n- Quin AI\nQuin AI\n- Radar\nRadar\n- Refiner\nRefiner\n- Selligent Marketing Cloud\nSelligent Marketing Cloud\n- SendGrid Marketing Campaigns\nSendGrid Marketing Campaigns\n- Shopify (by Littledata)\nShopify (by Littledata)\n- Shopify - Powered by Fueled\nShopify - Powered by Fueled\n- Statsig\nStatsig\n- Synap\nSynap\n- Upollo\nUpollo\n- UserGuiding\nUserGuiding\n- Vero\nVero\n- Voucherify\nVoucherify\n- White Label Loyalty\nWhite Label Loyalty\n- WorkRamp\nWorkRamp\n- Yotpo\nYotpo\n\n## HTTP\nIf Segment doesn’t have a library for your environment, you can send your data directly to theHTTP Tracking API. All of Segment’s other sources and platforms use the HTTP API to work their magic behind the scenes.\n\n## Pixel\nSegment’sPixel Tracking APIlets you track events from environments where you can’t execute code, like tracking email opens.\n\n## Reverse ETL sources\nReverse ETL sources are data warehouses that enable you to useReverse ETLto send data from your warehouse source to your destinations.\nReverse ETL supports these sources:\n- BigQuery\n- Databricks\n- Postgres\n- Redshift\n- Snowflake\nSegment is actively working on adding more sources. If you’d like to request Segment to add a particular source, please note it on thefeedback form.\n\n## Create a source\nTo create a source:\n- Navigate toConnectionsand clickAdd Source.\n- Click the Source you’d like to add.Note:More than 80% of workspaces start by adding their JavaScript website.\n- ClickAdd Source.\n- Enter a name for your source as well as any information on the setup page.\n- ClickAdd Source.\nOnce you’ve created a source, the source is automatically enabled and can immediately receive events. You can review your new events in that source’sDebuggertab.\nSources not connected to an enabled destination are disabled after 14 days\nIf your source is not connected to any destinations or is only connected to disabled destinations, Segment automatically disables this source after 14 days, even if the source is receiving events. Disabled sources will no longer receive data. \nYou can view when Segment disables your destination in your workspace’sAudit TrailasEvent : Source DisabledwithActor : Segment.\nWorkspace members receive an email notification before Segment disables your source so that your team has time to take action.\nIf you would like to prevent this behavior in your workspace, fill outthis Airtable form.\n\n```\nEvent : Source Disabled\n```\n\n```\nActor : Segment\n```\nOne source or multiple sources?\nSegment suggests that you create one source for each type of data you want to collect. For example, you might have one source for all of your website tracking and a different source for any mobile tracking. Creating one source per data type provides the following benefits:\n- Debugger ease of use - mixing libraries/sources on a single API key means you’re heavily reliant on filtering to actually test events\n- Flexibility sending data to different projects - if you want to have different warehouse schemas, analytics projects, etc, having multiple sources would create this separation\n- More control - as your account grows with the number of destinations you enable, having separate sources allows you to have more control\n- A source type cannot be changed after it is created. You must create a new source if you would like to use a different source type.\n\n## Library tiers\nSegment has defined three tiers for libraries: Flagship, Maintenance, and Community. These tiers indicate the level of support, enhancements, and maintenance each library receives from Segment.\nThe criteria for assigning a library to a tier include its overall usage by customers and the availability of newer versions. Here’s how Segment defines each tier:\n- Flagshiplibraries offer the most up-to-date functionality on Segment’s most popular platforms. Segment actively maintains Flagship libraries, which benefit from new feature releases and ongoing development and support.\n- Maintenancelibraries send data as intended but receive no new feature support and only critical maintenance updates from Segment. When possible, Segment recommends using a Flagship version of these libraries.\n- Communitylibraries are neither managed nor updated by Segment. These libraries are available on GitHub under the MIT License for the open-source community to fork or contribute.\nIf a library falls into one of these tiers, you’ll see the tier label at the beginning of the library’s page.\nThis page was last modified: 18 Nov 2024\n\n## Further reading\n\n## Sources Catalog\nA list of the available sources on the Segment platform.\n\n## Need support?\nQuestions? Problems? Need more info? Contact Segment Support for assistance!\n\n## Help improve these docs!\n\n## Was this page helpful?\nThanks for your feedback!\nCan we improve this doc?Send us feedback!\n\n## Get started with Segment",
  "url": "https://segment.com/docs/connections/sources/"
}