{
  "title": " Reverse ETL | Segment Documentation",
  "content": "- Home\n- /\n- Connections\n- /\n- Reverse ETL\n\n## Reverse ETL\nReverse ETL (Extract, Transform, Load) extracts data from a warehouse using a query you provide and syncs this warehouse data to your third party destinations.\nUse Reverse ETL when you want to:\n- Elevate marketing campaigns: Sync audiences and other data built in the warehouse to multi-channel marketing tools, like Braze, Hubspot, or Salesforce Marketing Cloud, to personalize marketing campaigns.\n- Enrich your customer profiles: Sync enriched data to destinations like Mixpanel for a more complete view of the customer, or enrich Segment Profiles with data from your warehouse.\n- Activate data in Twilio Engage: Send data in the warehouse back into Segment as events that can be activated in all supported destinations, including Twilio Engage destinations.\n- Strengthen your conversion events: Pass offline or enriched data to conversion APIs like Facebook, Google Ads, TikTok, or Snapchat.\n- Make warehouse data accessible to business teams: Connect destinations like Google Sheets to a view in the warehouse to allow business teams to access up-to-date reports.\nReverse ETL supports event and object data\nEvent and object data includes customer profile data, subscriptions, product tables, shopping cart tables, and more.\n\n## Get started with Reverse ETL\n\n## Set up Reverse ETL\nSet up the infrastructure you need to sync data from your warehouse to your downstream destinations.\n\n## Manage Reverse ETL Syncs\nView your sync history, reset your syncs, or subscribe to alerts.\n\n## Learn more\nLearn more about the system that powers Reverse ETL, supported destinations, and frequently asked questions.\n\n## Reverse ETL System\nReference material about system limits and how Segment detects data changes.\n\n## Destination catalog\nView the destinations you can connect to your Reverse ETL sources.\n\n## Reverse ETL FAQ\nFrequently asked questions about Reverse ETL.\n\n## More Reverse ETL resources\n\n## What is Reverse ETL? A complete guide\nIn this blog from Segment, learn how Reverse ETL helps businesses activate their data to drive better decision-making and greater operational efficiency.\n\n## Customer story: MongoDB\nLearn how MongoDB used Reverse ETL to connect the work of analytics teams to downstream marketing and sales tools to deliver just-in-time communications that increased customer satisfaction and engagement.\nThis page was last modified: 10 Sep 2024\n\n## Need support?\nQuestions? Problems? Need more info? Contact Segment Support for assistance!\n\n## Help improve these docs!\n\n## Was this page helpful?\nThanks for your feedback!\nCan we improve this doc?Send us feedback!\n\n## Get started with Segment",
  "url": "https://segment.com/docs/connections/reverse-etl/"
}