{
  "title": " Protocols Overview | Segment Documentation",
  "content": "- Home\n- /\n- Protocols Overview\n\n## Protocols Overview\nProtocols is available as an add-on for Business plans only.See theavailable plans, orcontact Support.\nOn this page\n- There are four steps to using Protocols\n- Learn more\nProtocols isonlyavailable forevent stream(website, mobile, and server sources) andEngagesources.\nSegment helps customers collect and integrate customer data across a wide range of tools and Destinations. To do so reliably, the data Segment receives must be clean, consistent and adhere to a well thought out tracking plan.\nProtocols was built to automate and scale thedata quality best practicesdeveloped over years of helping customers implement Segment. Investing in data quality will improve trust in your data, reduce time spent by your engineering and business teams navigating and validating data, and ultimately allow your business to grow faster.\nProtocols is a premium add-on feature available to Business Tier customers. If your plan includes Protocols, you can access itfrom theprotocolspath in your workspace. If your plan doesn’t include Protocols, contact your Segment account executive.\n\n```\nprotocols\n```\n\n## There are four steps to using Protocols\n\n## 1. Align teams with a Tracking Plan\nGood data quality starts with a well thought out Tracking Plan. With Protocols, you can define your events and corresponding properties in a Tracking Plan. This tracking plan becomes a central source of truth for product, engineering, analytics, and business teams.\n\n## 2. Validate data quality with violations\nWith your tracking plan living in Segment, you can apply it to 1 or more data sources. Any event or property that does not match the tracking plan will generate a violation. Violations are displayed in aggregated form to spot trends, and detailed form to help you quickly find and resolve discrepancies.\n\n## 3. Enforce data standards with controls\nTo maintain a high degree of quality over time, we offer strict controls to block non-conforming events. Blocked events can be forwarded to a separate quarantined Segment source for analysis and review.\n\n## 4. Resolve data issues with transformations\nEven the most exacting data collection processes are subject to human error and organizational complexity. Transformations can be applied from within Protocols to change event and property names without touching code.\n\n## Learn more\n\n## Best Practices\nLearn more about tracking plans and why you need them.\n\n## Tracking Plan\nCreate a Tracking Plan to standardize your collected data.\n\n## FAQ\nGet answers to Protocols questions that come up the most.\nGet Started: Learn more about Tracking Plans ->\nThis page was last modified: 13 Jul 2023\n\n## Need support?\nQuestions? Problems? Need more info? Contact Segment Support for assistance!\n\n## Help improve these docs!\n\n## Was this page helpful?\nThanks for your feedback!\nCan we improve this doc?Send us feedback!\n\n## Get started with Segment",
  "url": "https://segment.com/docs/protocols/#there-are-four-steps-to-using-protocols"
}